TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
typedef struct {
  __IO uint32_t TEST0;                             /* !< (@ 0x000A0C00) Test 0 register */
} M33C1SPGSS2_SPGSS_LMGMT_DFT_ATRT_Regs;

/*@}*/ /* end of group M33C1SPGSS2_SPGSS_LMGMT_DFT_ATRT */

/** @addtogroup M33C1SPGSS2_I2C_PAIR
  @{
*/

typedef struct {
  __IO uint32_t PAIR0;                             /* !< (@ 0x000A01C0) Pairing of I2C for MULTI-MASTER/SMBUS applications */
  __IO uint32_t PAIR1;                             /* !< (@ 0x000A01C4) Pairing of I2C for MULTI-MASTER/SMBUS applications */
} M33C1SPGSS2_I2C_PAIR_Regs;

/*@}*/ /* end of group M33C1SPGSS2_I2C_PAIR */

/** @addtogroup M33C1SPGSS2_UNICOMM_LPBK
  @{
*/

typedef struct {
  __IO uint32_t LPBK0;                             /* !< (@ 0x000A0120) Loopback between SPG instances User has to ensure
                                                      that the SPGs looped back have the same underlying IP instantiated;
                                                      i.e. both UART, both SPI, both I2C, etc., */
  __IO uint32_t LPBK1;                             /* !< (@ 0x000A0124) Loopback between SPG instances User has to ensure
                                                      that the SPGs looped back have the same underlying IP instantiated;
                                                      i.e. both UART, both SPI, both I2C, etc., */
} M33C1SPGSS2_UNICOMM_LPBK_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UNICOMM_LPBK */

/** @addtogroup M33C1SPGSS2_SPGSS_IPSPECIFIC
  @{
*/

typedef struct {
       uint32_t RESERVED0[8];
  M33C1SPGSS2_UNICOMM_LPBK_Regs  UNICOMM_LPBK;                      /* !< (@ 0x000A0120) */
       uint32_t RESERVED1[38];
  M33C1SPGSS2_I2C_PAIR_Regs  I2C_PAIR;                          /* !< (@ 0x000A01C0) */
} M33C1SPGSS2_SPGSS_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS2_SPGSS_IPSPECIFIC */

/** @addtogroup M33C1SPGSS2_UC3_IPSPECIFIC
  @{
*/

typedef struct {
  __IO uint32_t IPMODE;                            /* !< (@ 0x00087100) Mode Selection Register */
} M33C1SPGSS2_UC3_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC3_IPSPECIFIC */

/** @addtogroup M33C1SPGSS2_EXT_GPRCM_UC3_GPRCM
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00086800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00086804) Reset Control */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x00086808) Peripheral Clock Configuration Register */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x00086814) Status Register */
} M33C1SPGSS2_EXT_GPRCM_UC3_GPRCM_Regs;

/*@}*/ /* end of group M33C1SPGSS2_EXT_GPRCM_UC3_GPRCM */

/** @addtogroup M33C1SPGSS2_EXT_GPRCM_UC3
  @{
*/

typedef struct {
  M33C1SPGSS2_EXT_GPRCM_UC3_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00086800) */
} M33C1SPGSS2_EXT_GPRCM_UC3_Regs;

/*@}*/ /* end of group M33C1SPGSS2_EXT_GPRCM_UC3 */

/** @addtogroup M33C1SPGSS2_UC2_IPSPECIFIC
  @{
*/

typedef struct {
  __IO uint32_t IPMODE;                            /* !< (@ 0x00085100) Mode Selection Register */
} M33C1SPGSS2_UC2_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC2_IPSPECIFIC */

/** @addtogroup M33C1SPGSS2_EXT_GPRCM_UC2_GPRCM
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00084800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00084804) Reset Control */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x00084808) Peripheral Clock Configuration Register */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x00084814) Status Register */
} M33C1SPGSS2_EXT_GPRCM_UC2_GPRCM_Regs;

/*@}*/ /* end of group M33C1SPGSS2_EXT_GPRCM_UC2_GPRCM */

/** @addtogroup M33C1SPGSS2_EXT_GPRCM_UC2
  @{
*/

typedef struct {
  M33C1SPGSS2_EXT_GPRCM_UC2_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00084800) */
} M33C1SPGSS2_EXT_GPRCM_UC2_Regs;

/*@}*/ /* end of group M33C1SPGSS2_EXT_GPRCM_UC2 */

/** @addtogroup M33C1SPGSS2_UC1_IPSPECIFIC
  @{
*/

typedef struct {
  __IO uint32_t IPMODE;                            /* !< (@ 0x00083100) Mode Selection Register */
} M33C1SPGSS2_UC1_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC1_IPSPECIFIC */

/** @addtogroup M33C1SPGSS2_EXT_GPRCM_UC1_GPRCM
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00082800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00082804) Reset Control */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x00082808) Peripheral Clock Configuration Register */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x00082814) Status Register */
} M33C1SPGSS2_EXT_GPRCM_UC1_GPRCM_Regs;

/*@}*/ /* end of group M33C1SPGSS2_EXT_GPRCM_UC1_GPRCM */

/** @addtogroup M33C1SPGSS2_EXT_GPRCM_UC1
  @{
*/

typedef struct {
  M33C1SPGSS2_EXT_GPRCM_UC1_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00082800) */
} M33C1SPGSS2_EXT_GPRCM_UC1_Regs;

/*@}*/ /* end of group M33C1SPGSS2_EXT_GPRCM_UC1 */

/** @addtogroup M33C1SPGSS2_UC0_IPSPECIFIC
  @{
*/

typedef struct {
  __IO uint32_t IPMODE;                            /* !< (@ 0x00081100) Mode Selection Register */
} M33C1SPGSS2_UC0_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC0_IPSPECIFIC */

/** @addtogroup M33C1SPGSS2_EXT_GPRCM_UC0_GPRCM
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00080800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00080804) Reset Control */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x00080808) Peripheral Clock Configuration Register */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x00080814) Status Register */
} M33C1SPGSS2_EXT_GPRCM_UC0_GPRCM_Regs;

/*@}*/ /* end of group M33C1SPGSS2_EXT_GPRCM_UC0_GPRCM */

/** @addtogroup M33C1SPGSS2_EXT_GPRCM_UC0
  @{
*/

