TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
typedef struct {
  M33C1SPGSS2_EXT_GPRCM_UC0_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00080800) */
} M33C1SPGSS2_EXT_GPRCM_UC0_Regs;

/*@}*/ /* end of group M33C1SPGSS2_EXT_GPRCM_UC0 */

/** @addtogroup M33C1SPGSS2_UC2_SPI_LMGMT_DFT_ATRT
  @{
*/

typedef struct {
  __IO uint32_t TEST0;                             /* !< (@ 0x00065E00) Test 0 Register */
} M33C1SPGSS2_UC2_SPI_LMGMT_DFT_ATRT_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC2_SPI_LMGMT_DFT_ATRT */

/** @addtogroup M33C1SPGSS2_UC2_SPI_IPSPECIFIC
  @{
*/

typedef struct {
  __IO uint32_t CTL0;                              /* !< (@ 0x00065100) SPI control register 0 */
       uint32_t RESERVED0;
  __I  uint32_t STAT;                              /* !< (@ 0x00065108) Status Register */
  __IO uint32_t IFLS;                              /* !< (@ 0x0006510C) Interrupt FIFO Level Select Register */
  __IO uint32_t CLKCTL;                            /* !< (@ 0x00065110) Clock prescaler and divider register. */
       uint32_t RESERVED1[3];
  __O  uint32_t TXDATA;                            /* !< (@ 0x00065120) TXDATA Register */
  __I  uint32_t RXDATA;                            /* !< (@ 0x00065124) RXDATA Register */
       uint32_t RESERVED2[9];
  __IO uint32_t CTL1;                              /* !< (@ 0x0006514C) SPI control register 1 */
} M33C1SPGSS2_UC2_SPI_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC2_SPI_IPSPECIFIC */

/** @addtogroup M33C1SPGSS2_UC2_SPI_IPSTANDARD_DMA_TRIG_TX
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00065088) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00065090) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00065098) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x000650A0) Interrupt set */
} M33C1SPGSS2_UC2_SPI_IPSTANDARD_DMA_TRIG_TX_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC2_SPI_IPSTANDARD_DMA_TRIG_TX */

/** @addtogroup M33C1SPGSS2_UC2_SPI_IPSTANDARD_DMA_TRIG_RX
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00065058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00065060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00065068) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00065070) Interrupt set */
} M33C1SPGSS2_UC2_SPI_IPSTANDARD_DMA_TRIG_RX_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC2_SPI_IPSTANDARD_DMA_TRIG_RX */

/** @addtogroup M33C1SPGSS2_UC2_SPI_IPSTANDARD_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00065020) Interrupt Index Register */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00065028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00065030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00065038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00065040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00065048) Interrupt clear */
} M33C1SPGSS2_UC2_SPI_IPSTANDARD_CPU_INT_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC2_SPI_IPSTANDARD_CPU_INT */

/** @addtogroup M33C1SPGSS2_UC2_SPI_IPSTANDARD
  @{
*/

typedef struct {
  __IO uint32_t CLKDIV;                            /* !< (@ 0x00065000) Clock Divider */
       uint32_t RESERVED0;
  __IO uint32_t CLKSEL;                            /* !< (@ 0x00065008) Clock Select for Ultra Low Power peripherals */
       uint32_t RESERVED1[3];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00065018) Peripheral Debug Control */
       uint32_t RESERVED2;
  M33C1SPGSS2_UC2_SPI_IPSTANDARD_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00065020) */
       uint32_t RESERVED3;
  M33C1SPGSS2_UC2_SPI_IPSTANDARD_DMA_TRIG_RX_Regs  DMA_TRIG_RX;                       /* !< (@ 0x00065050) */
       uint32_t RESERVED4[3];
  M33C1SPGSS2_UC2_SPI_IPSTANDARD_DMA_TRIG_TX_Regs  DMA_TRIG_TX;                       /* !< (@ 0x00065080) */
       uint32_t RESERVED5[16];
  __O  uint32_t INTCTL;                            /* !< (@ 0x000650E4) Interrupt control register */
} M33C1SPGSS2_UC2_SPI_IPSTANDARD_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC2_SPI_IPSTANDARD */

/** @addtogroup M33C1SPGSS2_UC1_SPI_LMGMT_DFT_ATRT
  @{
*/

typedef struct {
  __IO uint32_t TEST0;                             /* !< (@ 0x00063E00) Test 0 Register */
} M33C1SPGSS2_UC1_SPI_LMGMT_DFT_ATRT_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC1_SPI_LMGMT_DFT_ATRT */

/** @addtogroup M33C1SPGSS2_UC1_SPI_IPSPECIFIC
  @{
*/

typedef struct {
  __IO uint32_t CTL0;                              /* !< (@ 0x00063100) SPI control register 0 */
       uint32_t RESERVED0;
  __I  uint32_t STAT;                              /* !< (@ 0x00063108) Status Register */
  __IO uint32_t IFLS;                              /* !< (@ 0x0006310C) Interrupt FIFO Level Select Register */
  __IO uint32_t CLKCTL;                            /* !< (@ 0x00063110) Clock prescaler and divider register. */
       uint32_t RESERVED1[3];
  __O  uint32_t TXDATA;                            /* !< (@ 0x00063120) TXDATA Register */
  __I  uint32_t RXDATA;                            /* !< (@ 0x00063124) RXDATA Register */
       uint32_t RESERVED2[9];
  __IO uint32_t CTL1;                              /* !< (@ 0x0006314C) SPI control register 1 */
} M33C1SPGSS2_UC1_SPI_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC1_SPI_IPSPECIFIC */

/** @addtogroup M33C1SPGSS2_UC1_SPI_IPSTANDARD_DMA_TRIG_TX
  @{
*/

