TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00063088) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00063090) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00063098) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x000630A0) Interrupt set */
} M33C1SPGSS2_UC1_SPI_IPSTANDARD_DMA_TRIG_TX_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC1_SPI_IPSTANDARD_DMA_TRIG_TX */

/** @addtogroup M33C1SPGSS2_UC1_SPI_IPSTANDARD_DMA_TRIG_RX
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00063058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00063060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00063068) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00063070) Interrupt set */
} M33C1SPGSS2_UC1_SPI_IPSTANDARD_DMA_TRIG_RX_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC1_SPI_IPSTANDARD_DMA_TRIG_RX */

/** @addtogroup M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00063020) Interrupt Index Register */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00063028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00063030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00063038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00063040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00063048) Interrupt clear */
} M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT */

/** @addtogroup M33C1SPGSS2_UC1_SPI_IPSTANDARD
  @{
*/

typedef struct {
  __IO uint32_t CLKDIV;                            /* !< (@ 0x00063000) Clock Divider */
       uint32_t RESERVED0;
  __IO uint32_t CLKSEL;                            /* !< (@ 0x00063008) Clock Select for Ultra Low Power peripherals */
       uint32_t RESERVED1[3];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00063018) Peripheral Debug Control */
       uint32_t RESERVED2;
  M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00063020) */
       uint32_t RESERVED3;
  M33C1SPGSS2_UC1_SPI_IPSTANDARD_DMA_TRIG_RX_Regs  DMA_TRIG_RX;                       /* !< (@ 0x00063050) */
       uint32_t RESERVED4[3];
  M33C1SPGSS2_UC1_SPI_IPSTANDARD_DMA_TRIG_TX_Regs  DMA_TRIG_TX;                       /* !< (@ 0x00063080) */
       uint32_t RESERVED5[16];
  __O  uint32_t INTCTL;                            /* !< (@ 0x000630E4) Interrupt control register */
} M33C1SPGSS2_UC1_SPI_IPSTANDARD_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC1_SPI_IPSTANDARD */

/** @addtogroup M33C1SPGSS2_UC0_SPI_LMGMT_DFT_ATRT
  @{
*/

typedef struct {
  __IO uint32_t TEST0;                             /* !< (@ 0x00061E00) Test 0 Register */
} M33C1SPGSS2_UC0_SPI_LMGMT_DFT_ATRT_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC0_SPI_LMGMT_DFT_ATRT */

/** @addtogroup M33C1SPGSS2_UC0_SPI_IPSPECIFIC
  @{
*/

typedef struct {
  __IO uint32_t CTL0;                              /* !< (@ 0x00061100) SPI control register 0 */
       uint32_t RESERVED0;
  __I  uint32_t STAT;                              /* !< (@ 0x00061108) Status Register */
  __IO uint32_t IFLS;                              /* !< (@ 0x0006110C) Interrupt FIFO Level Select Register */
  __IO uint32_t CLKCTL;                            /* !< (@ 0x00061110) Clock prescaler and divider register. */
       uint32_t RESERVED1[3];
  __O  uint32_t TXDATA;                            /* !< (@ 0x00061120) TXDATA Register */
  __I  uint32_t RXDATA;                            /* !< (@ 0x00061124) RXDATA Register */
       uint32_t RESERVED2[9];
  __IO uint32_t CTL1;                              /* !< (@ 0x0006114C) SPI control register 1 */
} M33C1SPGSS2_UC0_SPI_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC0_SPI_IPSPECIFIC */

/** @addtogroup M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00061088) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00061090) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00061098) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x000610A0) Interrupt set */
} M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX */

/** @addtogroup M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_RX
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00061058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00061060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00061068) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00061070) Interrupt set */
} M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_RX */

/** @addtogroup M33C1SPGSS2_UC0_SPI_IPSTANDARD_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00061020) Interrupt Index Register */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00061028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00061030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00061038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00061040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00061048) Interrupt clear */
} M33C1SPGSS2_UC0_SPI_IPSTANDARD_CPU_INT_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC0_SPI_IPSTANDARD_CPU_INT */

/** @addtogroup M33C1SPGSS2_UC0_SPI_IPSTANDARD
  @{
*/

