TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/** @addtogroup M33C1SPGSS2_UC2_I2CT_LMGMT_DFT_ATRT
  @{
*/

typedef struct {
  __IO uint32_t TEST0;                             /* !< (@ 0x00045E00) Test 0 register */
} M33C1SPGSS2_UC2_I2CT_LMGMT_DFT_ATRT_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC2_I2CT_LMGMT_DFT_ATRT */

/** @addtogroup M33C1SPGSS2_UC2_I2CT_IPSPECIFIC
  @{
*/

typedef struct {
  __IO uint32_t CTR;                               /* !< (@ 0x00045100) I2C Target Control Register */
  __IO uint32_t ACKCTL;                            /* !< (@ 0x00045104) I2C Target ACK Control */
  __I  uint32_t SR;                                /* !< (@ 0x00045108) Status Register */
  __IO uint32_t IFLS;                              /* !< (@ 0x0004510C) Interrupt FIFO Level Select Register */
       uint32_t RESERVED0[2];
  __IO uint32_t GFCTL;                             /* !< (@ 0x00045118) I2C Glitch Filter Control */
       uint32_t RESERVED1;
  __O  uint32_t TTXDATA;                           /* !< (@ 0x00045120) I2C TXData */
  __I  uint32_t RXDATA;                            /* !< (@ 0x00045124) I2C RXData */
       uint32_t RESERVED2[9];
  __IO uint32_t OAR;                               /* !< (@ 0x0004514C) I2C Own Address */
  __I  uint32_t TIMEOUT_CNT;                       /* !< (@ 0x00045150) I2C Timeout Count Register */
  __IO uint32_t TIMEOUT_CTL;                       /* !< (@ 0x00045154) I2C Timeout Count Control Register */
} M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC2_I2CT_IPSPECIFIC */

/** @addtogroup M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG0
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00045088) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00045090) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00045098) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x000450A0) Interrupt set */
} M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG0_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG0 */

/** @addtogroup M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG1
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00045058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00045060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00045068) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00045070) Interrupt set */
} M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG1_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG1 */

/** @addtogroup M33C1SPGSS2_UC2_I2CT_IPSTANDARD_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00045020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00045028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00045030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00045038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00045040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00045048) Interrupt clear */
} M33C1SPGSS2_UC2_I2CT_IPSTANDARD_CPU_INT_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC2_I2CT_IPSTANDARD_CPU_INT */

/** @addtogroup M33C1SPGSS2_UC2_I2CT_IPSTANDARD
  @{
*/

typedef struct {
  __IO uint32_t CLKDIV;                            /* !< (@ 0x00045000) Clock Divider */
       uint32_t RESERVED0;
  __IO uint32_t CLKSEL;                            /* !< (@ 0x00045008) Clock Select for Ultra Low Power peripherals */
       uint32_t RESERVED1[3];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00045018) Peripheral Debug Control */
       uint32_t RESERVED2;
  M33C1SPGSS2_UC2_I2CT_IPSTANDARD_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00045020) */
       uint32_t RESERVED3;
  M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG1_Regs  DMA_TRIG1;                         /* !< (@ 0x00045050) */
       uint32_t RESERVED4[3];
  M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG0_Regs  DMA_TRIG0;                         /* !< (@ 0x00045080) */
       uint32_t RESERVED5[16];
  __O  uint32_t INTCTL;                            /* !< (@ 0x000450E4) Interrupt control register */
} M33C1SPGSS2_UC2_I2CT_IPSTANDARD_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC2_I2CT_IPSTANDARD */

/** @addtogroup M33C1SPGSS2_UC1_I2CT_LMGMT_DFT_ATRT
  @{
*/

typedef struct {
  __IO uint32_t TEST0;                             /* !< (@ 0x00043E00) Test 0 register */
} M33C1SPGSS2_UC1_I2CT_LMGMT_DFT_ATRT_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC1_I2CT_LMGMT_DFT_ATRT */

/** @addtogroup M33C1SPGSS2_UC1_I2CT_IPSPECIFIC
  @{
*/

typedef struct {
  __IO uint32_t CTR;                               /* !< (@ 0x00043100) I2C Target Control Register */
  __IO uint32_t ACKCTL;                            /* !< (@ 0x00043104) I2C Target ACK Control */
  __I  uint32_t SR;                                /* !< (@ 0x00043108) Status Register */
  __IO uint32_t IFLS;                              /* !< (@ 0x0004310C) Interrupt FIFO Level Select Register */
       uint32_t RESERVED0[2];
  __IO uint32_t GFCTL;                             /* !< (@ 0x00043118) I2C Glitch Filter Control */
       uint32_t RESERVED1;
  __O  uint32_t TTXDATA;                           /* !< (@ 0x00043120) I2C TXData */
  __I  uint32_t RXDATA;                            /* !< (@ 0x00043124) I2C RXData */
       uint32_t RESERVED2[9];
  __IO uint32_t OAR;                               /* !< (@ 0x0004314C) I2C Own Address */
  __I  uint32_t TIMEOUT_CNT;                       /* !< (@ 0x00043150) I2C Timeout Count Register */
  __IO uint32_t TIMEOUT_CTL;                       /* !< (@ 0x00043154) I2C Timeout Count Control Register */
} M33C1SPGSS2_UC1_I2CT_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC1_I2CT_IPSPECIFIC */

/** @addtogroup M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0
  @{
*/

