TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00041020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00041028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00041030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00041038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00041040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00041048) Interrupt clear */
} M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT */

/** @addtogroup M33C1SPGSS2_UC0_I2CT_IPSTANDARD
  @{
*/

typedef struct {
  __IO uint32_t CLKDIV;                            /* !< (@ 0x00041000) Clock Divider */
       uint32_t RESERVED0;
  __IO uint32_t CLKSEL;                            /* !< (@ 0x00041008) Clock Select for Ultra Low Power peripherals */
       uint32_t RESERVED1[3];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00041018) Peripheral Debug Control */
       uint32_t RESERVED2;
  M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00041020) */
       uint32_t RESERVED3;
  M33C1SPGSS2_UC0_I2CT_IPSTANDARD_DMA_TRIG1_Regs  DMA_TRIG1;                         /* !< (@ 0x00041050) */
       uint32_t RESERVED4[3];
  M33C1SPGSS2_UC0_I2CT_IPSTANDARD_DMA_TRIG0_Regs  DMA_TRIG0;                         /* !< (@ 0x00041080) */
       uint32_t RESERVED5[16];
  __O  uint32_t INTCTL;                            /* !< (@ 0x000410E4) Interrupt control register */
} M33C1SPGSS2_UC0_I2CT_IPSTANDARD_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC0_I2CT_IPSTANDARD */

/** @addtogroup M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT
  @{
*/

typedef struct {
  __IO uint32_t TEST0;                             /* !< (@ 0x00027E00) Test 0 register */
  __IO uint32_t TEST1;                             /* !< (@ 0x00027E04) Test 0 register */
} M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT */

/** @addtogroup M33C1SPGSS2_UC3_I2CC_IPSPECIFIC
  @{
*/

typedef struct {
  __IO uint32_t CTR;                               /* !< (@ 0x00027100) Control Register */
  __IO uint32_t CR;                                /* !< (@ 0x00027104) Configuration */
  __I  uint32_t SR;                                /* !< (@ 0x00027108) Status Register */
  __IO uint32_t IFLS;                              /* !< (@ 0x0002710C) Interrupt FIFO Level Select Register */
  __IO uint32_t TPR;                               /* !< (@ 0x00027110) Timer Period */
       uint32_t RESERVED0;
  __IO uint32_t GFCTL;                             /* !< (@ 0x00027118) I2C Glitch Filter Control */
  __I  uint32_t BMON;                              /* !< (@ 0x0002711C) Bus Monitor */
  __O  uint32_t TXDATA;                            /* !< (@ 0x00027120) TXData */
  __I  uint32_t RXDATA;                            /* !< (@ 0x00027124) RXData */
  __I  uint32_t PECSR;                             /* !< (@ 0x00027128) PEC status register */
       uint32_t RESERVED1[8];
  __IO uint32_t TA;                                /* !< (@ 0x0002714C) Target Address Register */
  __I  uint32_t TIMEOUT_CNT;                       /* !< (@ 0x00027150) I2C Timeout Count Register */
  __IO uint32_t TIMEOUT_CTL;                       /* !< (@ 0x00027154) I2C Timeout Count Control Register */
  __IO uint32_t PECCTL;                            /* !< (@ 0x00027158) I2C PEC control register */
} M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC3_I2CC_IPSPECIFIC */

/** @addtogroup M33C1SPGSS2_UC3_I2CC_IPSTANDARD_DMA_TRIG0
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00027088) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00027090) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00027098) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x000270A0) Interrupt set */
} M33C1SPGSS2_UC3_I2CC_IPSTANDARD_DMA_TRIG0_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC3_I2CC_IPSTANDARD_DMA_TRIG0 */

/** @addtogroup M33C1SPGSS2_UC3_I2CC_IPSTANDARD_DMA_TRIG1
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00027058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00027060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00027068) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00027070) Interrupt set */
} M33C1SPGSS2_UC3_I2CC_IPSTANDARD_DMA_TRIG1_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC3_I2CC_IPSTANDARD_DMA_TRIG1 */

/** @addtogroup M33C1SPGSS2_UC3_I2CC_IPSTANDARD_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00027020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00027028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00027030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00027038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00027040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00027048) Interrupt clear */
} M33C1SPGSS2_UC3_I2CC_IPSTANDARD_CPU_INT_Regs;

