TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/*@}*/ /* end of group M33C1SPGSS2_UC2_I2CC_IPSTANDARD */

/** @addtogroup M33C1SPGSS2_UC1_I2CC_LMGMT_DFT_ATRT
  @{
*/

typedef struct {
  __IO uint32_t TEST0;                             /* !< (@ 0x00023E00) Test 0 register */
} M33C1SPGSS2_UC1_I2CC_LMGMT_DFT_ATRT_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC1_I2CC_LMGMT_DFT_ATRT */

/** @addtogroup M33C1SPGSS2_UC1_I2CC_IPSPECIFIC
  @{
*/

typedef struct {
  __IO uint32_t CTR;                               /* !< (@ 0x00023100) Control Register */
  __IO uint32_t CR;                                /* !< (@ 0x00023104) Configuration */
  __I  uint32_t SR;                                /* !< (@ 0x00023108) Status Register */
  __IO uint32_t IFLS;                              /* !< (@ 0x0002310C) Interrupt FIFO Level Select Register */
  __IO uint32_t TPR;                               /* !< (@ 0x00023110) Timer Period */
       uint32_t RESERVED0;
  __IO uint32_t GFCTL;                             /* !< (@ 0x00023118) I2C Glitch Filter Control */
  __I  uint32_t BMON;                              /* !< (@ 0x0002311C) Bus Monitor */
  __O  uint32_t TXDATA;                            /* !< (@ 0x00023120) TXData */
  __I  uint32_t RXDATA;                            /* !< (@ 0x00023124) RXData */
       uint32_t RESERVED1[9];
  __IO uint32_t TA;                                /* !< (@ 0x0002314C) Target Address Register */
  __I  uint32_t TIMEOUT_CNT;                       /* !< (@ 0x00023150) I2C Timeout Count Register */
  __IO uint32_t TIMEOUT_CTL;                       /* !< (@ 0x00023154) I2C Timeout Count Control Register */
} M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC1_I2CC_IPSPECIFIC */

/** @addtogroup M33C1SPGSS2_UC1_I2CC_IPSTANDARD_DMA_TRIG0
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00023088) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00023090) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00023098) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x000230A0) Interrupt set */
} M33C1SPGSS2_UC1_I2CC_IPSTANDARD_DMA_TRIG0_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC1_I2CC_IPSTANDARD_DMA_TRIG0 */

/** @addtogroup M33C1SPGSS2_UC1_I2CC_IPSTANDARD_DMA_TRIG1
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00023058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00023060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00023068) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00023070) Interrupt set */
} M33C1SPGSS2_UC1_I2CC_IPSTANDARD_DMA_TRIG1_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC1_I2CC_IPSTANDARD_DMA_TRIG1 */

/** @addtogroup M33C1SPGSS2_UC1_I2CC_IPSTANDARD_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00023020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00023028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00023030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00023038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00023040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00023048) Interrupt clear */
} M33C1SPGSS2_UC1_I2CC_IPSTANDARD_CPU_INT_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC1_I2CC_IPSTANDARD_CPU_INT */

/** @addtogroup M33C1SPGSS2_UC1_I2CC_IPSTANDARD
  @{
*/

typedef struct {
  __IO uint32_t CLKDIV;                            /* !< (@ 0x00023000) Clock Divider */
       uint32_t RESERVED0;
  __IO uint32_t CLKSEL;                            /* !< (@ 0x00023008) Clock Select for Ultra Low Power peripherals */
       uint32_t RESERVED1[3];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00023018) Peripheral Debug Control */
       uint32_t RESERVED2;
  M33C1SPGSS2_UC1_I2CC_IPSTANDARD_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00023020) */
       uint32_t RESERVED3;
  M33C1SPGSS2_UC1_I2CC_IPSTANDARD_DMA_TRIG1_Regs  DMA_TRIG1;                         /* !< (@ 0x00023050) */
       uint32_t RESERVED4[3];
  M33C1SPGSS2_UC1_I2CC_IPSTANDARD_DMA_TRIG0_Regs  DMA_TRIG0;                         /* !< (@ 0x00023080) */
       uint32_t RESERVED5[16];
  __O  uint32_t INTCTL;                            /* !< (@ 0x000230E4) Interrupt control register */
} M33C1SPGSS2_UC1_I2CC_IPSTANDARD_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC1_I2CC_IPSTANDARD */

/** @addtogroup M33C1SPGSS2_UC0_I2CC_LMGMT_DFT_ATRT
  @{
*/

typedef struct {
  __IO uint32_t TEST0;                             /* !< (@ 0x00021E00) Test 0 register */
} M33C1SPGSS2_UC0_I2CC_LMGMT_DFT_ATRT_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC0_I2CC_LMGMT_DFT_ATRT */

/** @addtogroup M33C1SPGSS2_UC0_I2CC_IPSPECIFIC
  @{
*/

typedef struct {
  __IO uint32_t CTR;                               /* !< (@ 0x00021100) Control Register */
  __IO uint32_t CR;                                /* !< (@ 0x00021104) Configuration */
  __I  uint32_t SR;                                /* !< (@ 0x00021108) Status Register */
  __IO uint32_t IFLS;                              /* !< (@ 0x0002110C) Interrupt FIFO Level Select Register */
  __IO uint32_t TPR;                               /* !< (@ 0x00021110) Timer Period */
       uint32_t RESERVED0;
  __IO uint32_t GFCTL;                             /* !< (@ 0x00021118) I2C Glitch Filter Control */
  __I  uint32_t BMON;                              /* !< (@ 0x0002111C) Bus Monitor */
  __O  uint32_t TXDATA;                            /* !< (@ 0x00021120) TXData */
  __I  uint32_t RXDATA;                            /* !< (@ 0x00021124) RXData */
       uint32_t RESERVED1[9];
  __IO uint32_t TA;                                /* !< (@ 0x0002114C) Target Address Register */
  __I  uint32_t TIMEOUT_CNT;                       /* !< (@ 0x00021150) I2C Timeout Count Register */
  __IO uint32_t TIMEOUT_CTL;                       /* !< (@ 0x00021154) I2C Timeout Count Control Register */
} M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC0_I2CC_IPSPECIFIC */

/** @addtogroup M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0
  @{
*/

