TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00021088) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00021090) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00021098) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x000210A0) Interrupt set */
} M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0 */

/** @addtogroup M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00021058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00021060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00021068) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00021070) Interrupt set */
} M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1 */

/** @addtogroup M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00021020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00021028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00021030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00021038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00021040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00021048) Interrupt clear */
} M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT */

/** @addtogroup M33C1SPGSS2_UC0_I2CC_IPSTANDARD
  @{
*/

typedef struct {
  __IO uint32_t CLKDIV;                            /* !< (@ 0x00021000) Clock Divider */
       uint32_t RESERVED0;
  __IO uint32_t CLKSEL;                            /* !< (@ 0x00021008) Clock Select for Ultra Low Power peripherals */
       uint32_t RESERVED1[3];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00021018) Peripheral Debug Control */
       uint32_t RESERVED2;
  M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00021020) */
       uint32_t RESERVED3;
  M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_Regs  DMA_TRIG1;                         /* !< (@ 0x00021050) */
       uint32_t RESERVED4[3];
  M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_Regs  DMA_TRIG0;                         /* !< (@ 0x00021080) */
       uint32_t RESERVED5[16];
  __O  uint32_t INTCTL;                            /* !< (@ 0x000210E4) Interrupt control register */
} M33C1SPGSS2_UC0_I2CC_IPSTANDARD_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC0_I2CC_IPSTANDARD */

/** @addtogroup M33C1SPGSS2_UC3_UART_LMGMT_DFT_ATRT
  @{
*/

typedef struct {
  __IO uint32_t TEST0;                             /* !< (@ 0x00007E00) Test 0 register */
} M33C1SPGSS2_UC3_UART_LMGMT_DFT_ATRT_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC3_UART_LMGMT_DFT_ATRT */

/** @addtogroup M33C1SPGSS2_UC3_UART_IPSPECIFIC
  @{
*/

typedef struct {
  __IO uint32_t CTL0;                              /* !< (@ 0x00007100) UART Control Register 0 */
  __IO uint32_t LCRH;                              /* !< (@ 0x00007104) UART Line Control Register */
  __I  uint32_t STAT;                              /* !< (@ 0x00007108) UART Status Register */
  __IO uint32_t IFLS;                              /* !< (@ 0x0000710C) UART Interrupt FIFO Level Select Register */
  __IO uint32_t IBRD;                              /* !< (@ 0x00007110) UART Integer Baud-Rate Divisor Register */
  __IO uint32_t FBRD;                              /* !< (@ 0x00007114) UART Fractional Baud-Rate Divisor Register */
       uint32_t RESERVED0[2];
  __O  uint32_t TXDATA;                            /* !< (@ 0x00007120) UART Transmit Data Register */
  __I  uint32_t RXDATA;                            /* !< (@ 0x00007124) UART Receive Data Register */
       uint32_t RESERVED1[2];
  __IO uint32_t LINCNT;                            /* !< (@ 0x00007130) UART LIN Mode Counter Register */
  __IO uint32_t LINCTL;                            /* !< (@ 0x00007134) UART LIN Mode Control Register */
  __IO uint32_t LINC0;                             /* !< (@ 0x00007138) UART LIN Mode Capture 0 Register */
  __IO uint32_t LINC1;                             /* !< (@ 0x0000713C) UART LIN Mode Capture 1 Register */
       uint32_t RESERVED2[2];
  __IO uint32_t AMASK;                             /* !< (@ 0x00007148) Self Address Mask Register */
  __IO uint32_t ADDR;                              /* !< (@ 0x0000714C) Self Address Register */
} M33C1SPGSS2_UC3_UART_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC3_UART_IPSPECIFIC */

/** @addtogroup M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00007088) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00007090) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00007098) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x000070A0) Interrupt set */
} M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX */

/** @addtogroup M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX
  @{
*/

