TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00007058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00007060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00007068) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00007070) Interrupt set */
} M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX */

/** @addtogroup M33C1SPGSS2_UC3_UART_IPSTANDARD_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00007020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00007028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00007030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00007038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00007040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00007048) Interrupt clear */
} M33C1SPGSS2_UC3_UART_IPSTANDARD_CPU_INT_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC3_UART_IPSTANDARD_CPU_INT */

/** @addtogroup M33C1SPGSS2_UC3_UART_IPSTANDARD
  @{
*/

typedef struct {
  __IO uint32_t CLKDIV;                            /* !< (@ 0x00007000) Clock Divider */
       uint32_t RESERVED0;
  __IO uint32_t CLKSEL;                            /* !< (@ 0x00007008) Clock Select for Ultra Low Power peripherals */
       uint32_t RESERVED1[3];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00007018) Peripheral Debug Control */
       uint32_t RESERVED2;
  M33C1SPGSS2_UC3_UART_IPSTANDARD_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00007020) */
       uint32_t RESERVED3;
  M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_Regs  DMA_TRIG_RX;                       /* !< (@ 0x00007050) */
       uint32_t RESERVED4[3];
  M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_Regs  DMA_TRIG_TX;                       /* !< (@ 0x00007080) */
       uint32_t RESERVED5[16];
  __O  uint32_t INTCTL;                            /* !< (@ 0x000070E4) Interrupt control register */
} M33C1SPGSS2_UC3_UART_IPSTANDARD_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC3_UART_IPSTANDARD */

/** @addtogroup M33C1SPGSS2_UC2_UART_LMGMT_DFT_ATRT
  @{
*/

typedef struct {
  __IO uint32_t TEST0;                             /* !< (@ 0x00005E00) Test 0 register */
} M33C1SPGSS2_UC2_UART_LMGMT_DFT_ATRT_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC2_UART_LMGMT_DFT_ATRT */

/** @addtogroup M33C1SPGSS2_UC2_UART_IPSPECIFIC
  @{
*/

typedef struct {
  __IO uint32_t CTL0;                              /* !< (@ 0x00005100) UART Control Register 0 */
  __IO uint32_t LCRH;                              /* !< (@ 0x00005104) UART Line Control Register */
  __I  uint32_t STAT;                              /* !< (@ 0x00005108) UART Status Register */
  __IO uint32_t IFLS;                              /* !< (@ 0x0000510C) UART Interrupt FIFO Level Select Register */
  __IO uint32_t IBRD;                              /* !< (@ 0x00005110) UART Integer Baud-Rate Divisor Register */
  __IO uint32_t FBRD;                              /* !< (@ 0x00005114) UART Fractional Baud-Rate Divisor Register */
       uint32_t RESERVED0[2];
  __O  uint32_t TXDATA;                            /* !< (@ 0x00005120) UART Transmit Data Register */
  __I  uint32_t RXDATA;                            /* !< (@ 0x00005124) UART Receive Data Register */
       uint32_t RESERVED1[8];
  __IO uint32_t AMASK;                             /* !< (@ 0x00005148) Self Address Mask Register */
  __IO uint32_t ADDR;                              /* !< (@ 0x0000514C) Self Address Register */
} M33C1SPGSS2_UC2_UART_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC2_UART_IPSPECIFIC */

/** @addtogroup M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00005088) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00005090) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00005098) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x000050A0) Interrupt set */
} M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX */

/** @addtogroup M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00005058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00005060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00005068) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00005070) Interrupt set */
} M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX */

/** @addtogroup M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00005020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00005028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00005030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00005038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00005040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00005048) Interrupt clear */
} M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT */

/** @addtogroup M33C1SPGSS2_UC2_UART_IPSTANDARD
  @{
*/

