TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
typedef struct {
  __IO uint32_t TEST0;                             /* !< (@ 0x00001E00) Test 0 register */
} M33C1SPGSS2_UC0_UART_LMGMT_DFT_ATRT_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC0_UART_LMGMT_DFT_ATRT */

/** @addtogroup M33C1SPGSS2_UC0_UART_IPSPECIFIC
  @{
*/

typedef struct {
  __IO uint32_t CTL0;                              /* !< (@ 0x00001100) UART Control Register 0 */
  __IO uint32_t LCRH;                              /* !< (@ 0x00001104) UART Line Control Register */
  __I  uint32_t STAT;                              /* !< (@ 0x00001108) UART Status Register */
  __IO uint32_t IFLS;                              /* !< (@ 0x0000110C) UART Interrupt FIFO Level Select Register */
  __IO uint32_t IBRD;                              /* !< (@ 0x00001110) UART Integer Baud-Rate Divisor Register */
  __IO uint32_t FBRD;                              /* !< (@ 0x00001114) UART Fractional Baud-Rate Divisor Register */
       uint32_t RESERVED0[2];
  __O  uint32_t TXDATA;                            /* !< (@ 0x00001120) UART Transmit Data Register */
  __I  uint32_t RXDATA;                            /* !< (@ 0x00001124) UART Receive Data Register */
       uint32_t RESERVED1[8];
  __IO uint32_t AMASK;                             /* !< (@ 0x00001148) Self Address Mask Register */
  __IO uint32_t ADDR;                              /* !< (@ 0x0000114C) Self Address Register */
} M33C1SPGSS2_UC0_UART_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC0_UART_IPSPECIFIC */

/** @addtogroup M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00001088) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001090) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001098) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x000010A0) Interrupt set */
} M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX */

/** @addtogroup M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00001058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001068) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001070) Interrupt set */
} M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX */

/** @addtogroup M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001048) Interrupt clear */
} M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT */

/** @addtogroup M33C1SPGSS2_UC0_UART_IPSTANDARD
  @{
*/

typedef struct {
  __IO uint32_t CLKDIV;                            /* !< (@ 0x00001000) Clock Divider */
       uint32_t RESERVED0;
  __IO uint32_t CLKSEL;                            /* !< (@ 0x00001008) Clock Select for Ultra Low Power peripherals */
       uint32_t RESERVED1[3];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00001018) Peripheral Debug Control */
       uint32_t RESERVED2;
  M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00001020) */
       uint32_t RESERVED3;
  M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_Regs  DMA_TRIG_RX;                       /* !< (@ 0x00001050) */
       uint32_t RESERVED4[3];
  M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_Regs  DMA_TRIG_TX;                       /* !< (@ 0x00001080) */
       uint32_t RESERVED5[16];
  __O  uint32_t INTCTL;                            /* !< (@ 0x000010E4) Interrupt control register */
} M33C1SPGSS2_UC0_UART_IPSTANDARD_Regs;

/*@}*/ /* end of group M33C1SPGSS2_UC0_UART_IPSTANDARD */

/** @addtogroup M33C1SPGSS2_FUPDATE
  @{
*/

typedef struct {
  union {
      __O  uint32_t U0_SCLK_SCL_RX;                    /* !< FUPDATE version of P0 */
      __I  uint32_t U0_SCLK_SCL_RX_STAT_IO0;           /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U0_PICO_SDA_TX;                    /* !< FUPDATE version of P0 */
      __I  uint32_t U0_PICO_SDA_TX_STAT_IO1;           /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U0_POCI_RTS;                       /* !< FUPDATE version of P0 */
      __I  uint32_t U0_POCI_RTS_STAT_IO2;              /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U0_CS0_CTS;                        /* !< FUPDATE version of P0 */
      __I  uint32_t U0_CS0_CTS_STAT_IO3;               /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U1_SCLK_SCL_RX;                    /* !< FUPDATE version of P0 */
      __I  uint32_t U1_SCLK_SCL_RX_STAT_IO4;           /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U1_PICO_SDA_TX;                    /* !< FUPDATE version of P0 */
      __I  uint32_t U1_PICO_SDA_TX_STAT_IO5;           /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U1_POCI_RTS;                       /* !< FUPDATE version of P0 */
      __I  uint32_t U1_POCI_RTS_STAT_IO6;              /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U1_CS0_CTS;                        /* !< FUPDATE version of P0 */
      __I  uint32_t U1_CS0_CTS_STAT_IO7;               /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U2_SCLK_SCL_RX;                    /* !< FUPDATE version of P0 */
      __I  uint32_t U2_SCLK_SCL_RX_STAT_IO8;           /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U2_PICO_SDA_TX;                    /* !< FUPDATE version of P0 */
      __I  uint32_t U2_PICO_SDA_TX_STAT_IO9;           /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U2_POCI_RTS;                       /* !< FUPDATE version of P0 */
      __I  uint32_t U2_POCI_RTS_STAT_IO10;             /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U2_CS0_CTS;                        /* !< FUPDATE version of P0 */
      __I  uint32_t U2_CS0_CTS_STAT_IO11;              /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U3_SCL_RX;                         /* !< FUPDATE version of P0 */
      __I  uint32_t U3_SCL_RX_STAT_IO12;               /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U3_SDA_TX;                         /* !< FUPDATE version of P0 */
      __I  uint32_t U3_SDA_TX_STAT_IO13;               /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U3_RTS;                            /* !< FUPDATE version of P0 */
      __I  uint32_t U3_RTS_STAT_IO14;                  /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U3_CTS;                            /* !< FUPDATE version of P0 */
      __I  uint32_t U3_CTS_STAT_IO15;                  /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
} M33C1SPGSS2_FUPDATE_Regs;

/*@}*/ /* end of group M33C1SPGSS2_FUPDATE */

/** @addtogroup M33C1SPGSS2_PINCM
  @{
*/

