TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
typedef struct {
  __IO uint32_t U0_SCLK_SCL_RX;                    /* !< (@ 0x00000004) P0 */
  __IO uint32_t U0_PICO_SDA_TX;                    /* !< (@ 0x00000008) P0 */
  __IO uint32_t U0_POCI_RTS;                       /* !< (@ 0x0000000C) P0 */
  __IO uint32_t U0_CS0_CTS;                        /* !< (@ 0x00000010) P0 */
  __IO uint32_t U1_SCLK_SCL_RX;                    /* !< (@ 0x00000014) P0 */
  __IO uint32_t U1_PICO_SDA_TX;                    /* !< (@ 0x00000018) P0 */
  __IO uint32_t U1_POCI_RTS;                       /* !< (@ 0x0000001C) P0 */
  __IO uint32_t U1_CS0_CTS;                        /* !< (@ 0x00000020) P0 */
  __IO uint32_t U2_SCLK_SCL_RX;                    /* !< (@ 0x00000024) P0 */
  __IO uint32_t U2_PICO_SDA_TX;                    /* !< (@ 0x00000028) P0 */
  __IO uint32_t U2_POCI_RTS;                       /* !< (@ 0x0000002C) P0 */
  __IO uint32_t U2_CS0_CTS;                        /* !< (@ 0x00000030) P0 */
  __IO uint32_t U3_SCL_RX;                         /* !< (@ 0x00000034) P0 */
  __IO uint32_t U3_SDA_TX;                         /* !< (@ 0x00000038) P0 */
  __IO uint32_t U3_RTS;                            /* !< (@ 0x0000003C) P0 */
  __IO uint32_t U3_CTS;                            /* !< (@ 0x00000040) P0 */
} M33C1SPGSS2_PINCM_Regs;

/*@}*/ /* end of group M33C1SPGSS2_PINCM */

/** @addtogroup M33C1SPGSS2
  @{
*/

typedef struct {
       uint32_t RESERVED0;
  M33C1SPGSS2_PINCM_Regs  PINCM;                             /* !< (@ 0x00000004) */
       uint32_t RESERVED1[112];
  M33C1SPGSS2_FUPDATE_Regs  FUPDATE;                           /* !< (@ 0x00000204) */
       uint32_t RESERVED2[879];
  M33C1SPGSS2_UC0_UART_IPSTANDARD_Regs  UC0_UART_IPSTANDARD;               /* !< (@ 0x00001000) */
       uint32_t RESERVED3[6];
  M33C1SPGSS2_UC0_UART_IPSPECIFIC_Regs  UC0_UART_IPSPECIFIC;               /* !< (@ 0x00001100) */
       uint32_t RESERVED4[812];
  M33C1SPGSS2_UC0_UART_LMGMT_DFT_ATRT_Regs  UC0_UART_LMGMT_DFT_ATRT;           /* !< (@ 0x00001E00) */
       uint32_t RESERVED5[1151];
  M33C1SPGSS2_UC1_UART_IPSTANDARD_Regs  UC1_UART_IPSTANDARD;               /* !< (@ 0x00003000) */
       uint32_t RESERVED6[6];
  M33C1SPGSS2_UC1_UART_IPSPECIFIC_Regs  UC1_UART_IPSPECIFIC;               /* !< (@ 0x00003100) */
       uint32_t RESERVED7[812];
  M33C1SPGSS2_UC1_UART_LMGMT_DFT_ATRT_Regs  UC1_UART_LMGMT_DFT_ATRT;           /* !< (@ 0x00003E00) */
       uint32_t RESERVED8[1151];
  M33C1SPGSS2_UC2_UART_IPSTANDARD_Regs  UC2_UART_IPSTANDARD;               /* !< (@ 0x00005000) */
       uint32_t RESERVED9[6];
  M33C1SPGSS2_UC2_UART_IPSPECIFIC_Regs  UC2_UART_IPSPECIFIC;               /* !< (@ 0x00005100) */
       uint32_t RESERVED10[812];
  M33C1SPGSS2_UC2_UART_LMGMT_DFT_ATRT_Regs  UC2_UART_LMGMT_DFT_ATRT;           /* !< (@ 0x00005E00) */
       uint32_t RESERVED11[1151];
  M33C1SPGSS2_UC3_UART_IPSTANDARD_Regs  UC3_UART_IPSTANDARD;               /* !< (@ 0x00007000) */
       uint32_t RESERVED12[6];
  M33C1SPGSS2_UC3_UART_IPSPECIFIC_Regs  UC3_UART_IPSPECIFIC;               /* !< (@ 0x00007100) */
       uint32_t RESERVED13[812];
  M33C1SPGSS2_UC3_UART_LMGMT_DFT_ATRT_Regs  UC3_UART_LMGMT_DFT_ATRT;           /* !< (@ 0x00007E00) */
       uint32_t RESERVED14[25727];
  M33C1SPGSS2_UC0_I2CC_IPSTANDARD_Regs  UC0_I2CC_IPSTANDARD;               /* !< (@ 0x00021000) */
       uint32_t RESERVED15[6];
  M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_Regs  UC0_I2CC_IPSPECIFIC;               /* !< (@ 0x00021100) */
       uint32_t RESERVED16[810];
  M33C1SPGSS2_UC0_I2CC_LMGMT_DFT_ATRT_Regs  UC0_I2CC_LMGMT_DFT_ATRT;           /* !< (@ 0x00021E00) */
       uint32_t RESERVED17[1151];
  M33C1SPGSS2_UC1_I2CC_IPSTANDARD_Regs  UC1_I2CC_IPSTANDARD;               /* !< (@ 0x00023000) */
       uint32_t RESERVED18[6];
  M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_Regs  UC1_I2CC_IPSPECIFIC;               /* !< (@ 0x00023100) */
       uint32_t RESERVED19[810];
  M33C1SPGSS2_UC1_I2CC_LMGMT_DFT_ATRT_Regs  UC1_I2CC_LMGMT_DFT_ATRT;           /* !< (@ 0x00023E00) */
       uint32_t RESERVED20[1151];
  M33C1SPGSS2_UC2_I2CC_IPSTANDARD_Regs  UC2_I2CC_IPSTANDARD;               /* !< (@ 0x00025000) */
       uint32_t RESERVED21[6];
  M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_Regs  UC2_I2CC_IPSPECIFIC;               /* !< (@ 0x00025100) */
       uint32_t RESERVED22[810];
  M33C1SPGSS2_UC2_I2CC_LMGMT_DFT_ATRT_Regs  UC2_I2CC_LMGMT_DFT_ATRT;           /* !< (@ 0x00025E00) */
       uint32_t RESERVED23[1151];
  M33C1SPGSS2_UC3_I2CC_IPSTANDARD_Regs  UC3_I2CC_IPSTANDARD;               /* !< (@ 0x00027000) */
       uint32_t RESERVED24[6];
  M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_Regs  UC3_I2CC_IPSPECIFIC;               /* !< (@ 0x00027100) */
       uint32_t RESERVED25[809];
  M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_Regs  UC3_I2CC_LMGMT_DFT_ATRT;           /* !< (@ 0x00027E00) */
       uint32_t RESERVED26[25726];
  M33C1SPGSS2_UC0_I2CT_IPSTANDARD_Regs  UC0_I2CT_IPSTANDARD;               /* !< (@ 0x00041000) */
       uint32_t RESERVED27[6];
  M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_Regs  UC0_I2CT_IPSPECIFIC;               /* !< (@ 0x00041100) */
       uint32_t RESERVED28[810];
  M33C1SPGSS2_UC0_I2CT_LMGMT_DFT_ATRT_Regs  UC0_I2CT_LMGMT_DFT_ATRT;           /* !< (@ 0x00041E00) */
       uint32_t RESERVED29[1151];
  M33C1SPGSS2_UC1_I2CT_IPSTANDARD_Regs  UC1_I2CT_IPSTANDARD;               /* !< (@ 0x00043000) */
       uint32_t RESERVED30[6];
  M33C1SPGSS2_UC1_I2CT_IPSPECIFIC_Regs  UC1_I2CT_IPSPECIFIC;               /* !< (@ 0x00043100) */
       uint32_t RESERVED31[810];
  M33C1SPGSS2_UC1_I2CT_LMGMT_DFT_ATRT_Regs  UC1_I2CT_LMGMT_DFT_ATRT;           /* !< (@ 0x00043E00) */
       uint32_t RESERVED32[1151];
  M33C1SPGSS2_UC2_I2CT_IPSTANDARD_Regs  UC2_I2CT_IPSTANDARD;               /* !< (@ 0x00045000) */
       uint32_t RESERVED33[6];
  M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_Regs  UC2_I2CT_IPSPECIFIC;               /* !< (@ 0x00045100) */
       uint32_t RESERVED34[810];
  M33C1SPGSS2_UC2_I2CT_LMGMT_DFT_ATRT_Regs  UC2_I2CT_LMGMT_DFT_ATRT;           /* !< (@ 0x00045E00) */
       uint32_t RESERVED35[1151];
  M33C1SPGSS2_UC3_I2CT_IPSTANDARD_Regs  UC3_I2CT_IPSTANDARD;               /* !< (@ 0x00047000) */
       uint32_t RESERVED36[6];
  M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_Regs  UC3_I2CT_IPSPECIFIC;               /* !< (@ 0x00047100) */
       uint32_t RESERVED37[809];
  M33C1SPGSS2_UC3_I2CT_LMGMT_DFT_ATRT_Regs  UC3_I2CT_LMGMT_DFT_ATRT;           /* !< (@ 0x00047E00) */
       uint32_t RESERVED38[25726];
  M33C1SPGSS2_UC0_SPI_IPSTANDARD_Regs  UC0_SPI_IPSTANDARD;                /* !< (@ 0x00061000) */
       uint32_t RESERVED39[6];
  M33C1SPGSS2_UC0_SPI_IPSPECIFIC_Regs  UC0_SPI_IPSPECIFIC;                /* !< (@ 0x00061100) */
       uint32_t RESERVED40[812];
  M33C1SPGSS2_UC0_SPI_LMGMT_DFT_ATRT_Regs  UC0_SPI_LMGMT_DFT_ATRT;            /* !< (@ 0x00061E00) */
       uint32_t RESERVED41[1151];
  M33C1SPGSS2_UC1_SPI_IPSTANDARD_Regs  UC1_SPI_IPSTANDARD;                /* !< (@ 0x00063000) */
       uint32_t RESERVED42[6];
  M33C1SPGSS2_UC1_SPI_IPSPECIFIC_Regs  UC1_SPI_IPSPECIFIC;                /* !< (@ 0x00063100) */
       uint32_t RESERVED43[812];
  M33C1SPGSS2_UC1_SPI_LMGMT_DFT_ATRT_Regs  UC1_SPI_LMGMT_DFT_ATRT;            /* !< (@ 0x00063E00) */
       uint32_t RESERVED44[1151];
  M33C1SPGSS2_UC2_SPI_IPSTANDARD_Regs  UC2_SPI_IPSTANDARD;                /* !< (@ 0x00065000) */
       uint32_t RESERVED45[6];
  M33C1SPGSS2_UC2_SPI_IPSPECIFIC_Regs  UC2_SPI_IPSPECIFIC;                /* !< (@ 0x00065100) */
       uint32_t RESERVED46[812];
  M33C1SPGSS2_UC2_SPI_LMGMT_DFT_ATRT_Regs  UC2_SPI_LMGMT_DFT_ATRT;            /* !< (@ 0x00065E00) */
       uint32_t RESERVED47[27263];
  M33C1SPGSS2_EXT_GPRCM_UC0_Regs  EXT_GPRCM_UC0;                     /* !< (@ 0x00080800) */
       uint32_t RESERVED48[570];
  M33C1SPGSS2_UC0_IPSPECIFIC_Regs  UC0_IPSPECIFIC;                    /* !< (@ 0x00081100) */
       uint32_t RESERVED49[1471];
  M33C1SPGSS2_EXT_GPRCM_UC1_Regs  EXT_GPRCM_UC1;                     /* !< (@ 0x00082800) */
       uint32_t RESERVED50[570];
  M33C1SPGSS2_UC1_IPSPECIFIC_Regs  UC1_IPSPECIFIC;                    /* !< (@ 0x00083100) */
       uint32_t RESERVED51[1471];
  M33C1SPGSS2_EXT_GPRCM_UC2_Regs  EXT_GPRCM_UC2;                     /* !< (@ 0x00084800) */
       uint32_t RESERVED52[570];
  M33C1SPGSS2_UC2_IPSPECIFIC_Regs  UC2_IPSPECIFIC;                    /* !< (@ 0x00085100) */
       uint32_t RESERVED53[1471];
  M33C1SPGSS2_EXT_GPRCM_UC3_Regs  EXT_GPRCM_UC3;                     /* !< (@ 0x00086800) */
       uint32_t RESERVED54[570];
  M33C1SPGSS2_UC3_IPSPECIFIC_Regs  UC3_IPSPECIFIC;                    /* !< (@ 0x00087100) */
       uint32_t RESERVED55[25599];
  M33C1SPGSS2_SPGSS_IPSPECIFIC_Regs  SPGSS_IPSPECIFIC;                  /* !< (@ 0x000A0100) */
       uint32_t RESERVED56[654];
  M33C1SPGSS2_SPGSS_LMGMT_DFT_ATRT_Regs  SPGSS_LMGMT_DFT_ATRT;              /* !< (@ 0x000A0C00) */
} M33C1SPGSS2_Regs;

/*@}*/ /* end of group M33C1SPGSS2 */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

