TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/******************************************************************************
* SPGSS2 Register Control Bits
******************************************************************************/

/* M33C1SPGSS2_SPGSS_LMGMT_DFT_ATRT_TEST0 Bits */
/* M33C1SPGSS2_SPGSS_LMGMT_DFT_ATRT_TEST0[DTB_MUX_SEL] Bits */
#define M33C1SPGSS2_SPGSS_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_OFS (0)                             /* !< DTB_MUX_SEL Offset */
#define M33C1SPGSS2_SPGSS_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_MASK ((uint32_t)0x0000000FU)         /* !< This bit field is used to select
                                                                                    DTB mux digital output signals. */

/* M33C1SPGSS2_PAIR0 Bits */
/* M33C1SPGSS2_PAIR0[CTL] Bits */
#define M33C1SPGSS2_PAIR0_CTL_OFS                (8)                             /* !< CTL Offset */
#define M33C1SPGSS2_PAIR0_CTL_MASK               ((uint32_t)0x00000F00U)         /* !< UNICOMM instance for loopback. This
                                                                                    instance will be treated as the
                                                                                    controller. */
#define M33C1SPGSS2_PAIR0_CTL_SPG1               ((uint32_t)0x00000000U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR0_CTL_SPG2               ((uint32_t)0x00000100U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR0_CTL_SPG3               ((uint32_t)0x00000200U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR0_CTL_SPG4               ((uint32_t)0x00000300U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR0_CTL_SPG5               ((uint32_t)0x00000400U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR0_CTL_SPG6               ((uint32_t)0x00000500U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR0_CTL_SPG7               ((uint32_t)0x00000600U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR0_CTL_SPG8               ((uint32_t)0x00000700U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR0_CTL_SPG9               ((uint32_t)0x00000800U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR0_CTL_SPG10              ((uint32_t)0x00000900U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR0_CTL_SPG11              ((uint32_t)0x00000A00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR0_CTL_SPG12              ((uint32_t)0x00000B00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR0_CTL_SPG13              ((uint32_t)0x00000C00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR0_CTL_SPG14              ((uint32_t)0x00000D00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR0_CTL_SPG15              ((uint32_t)0x00000E00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR0_CTL_SPG16              ((uint32_t)0x00000F00U)         /* !< SPG commander select for loopback. */
/* M33C1SPGSS2_PAIR0[TARGET] Bits */
#define M33C1SPGSS2_PAIR0_TARGET_OFS             (12)                            /* !< TARGET Offset */
#define M33C1SPGSS2_PAIR0_TARGET_MASK            ((uint32_t)0x0000F000U)         /* !< UNICOMM instance for loopback. This
                                                                                    instance will be treated as the
                                                                                    target */
#define M33C1SPGSS2_PAIR0_TARGET_SPG1            ((uint32_t)0x00000000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR0_TARGET_SPG2            ((uint32_t)0x00001000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR0_TARGET_SPG3            ((uint32_t)0x00002000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR0_TARGET_SPG4            ((uint32_t)0x00003000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR0_TARGET_SPG5            ((uint32_t)0x00004000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR0_TARGET_SPG6            ((uint32_t)0x00005000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR0_TARGET_SPG7            ((uint32_t)0x00006000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR0_TARGET_SPG8            ((uint32_t)0x00007000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR0_TARGET_SPG9            ((uint32_t)0x00008000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR0_TARGET_SPG10           ((uint32_t)0x00009000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR0_TARGET_SPG11           ((uint32_t)0x0000A000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR0_TARGET_SPG12           ((uint32_t)0x0000B000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR0_TARGET_SPG13           ((uint32_t)0x0000C000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR0_TARGET_SPG14           ((uint32_t)0x0000D000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR0_TARGET_SPG15           ((uint32_t)0x0000E000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR0_TARGET_SPG16           ((uint32_t)0x0000F000U)         /* !< SPG responder select for loopback. */
/* M33C1SPGSS2_PAIR0[EN] Bits */
#define M33C1SPGSS2_PAIR0_EN_OFS                 (0)                             /* !< EN Offset */
#define M33C1SPGSS2_PAIR0_EN_MASK                ((uint32_t)0x00000001U)         /* !< Enable */
#define M33C1SPGSS2_PAIR0_EN_DISABLE             ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define M33C1SPGSS2_PAIR0_EN_ENABLE              ((uint32_t)0x00000001U)         /* !< Select this clock as a source */

/* M33C1SPGSS2_PAIR1 Bits */
/* M33C1SPGSS2_PAIR1[CTL] Bits */
#define M33C1SPGSS2_PAIR1_CTL_OFS                (8)                             /* !< CTL Offset */
#define M33C1SPGSS2_PAIR1_CTL_MASK               ((uint32_t)0x00000F00U)         /* !< UNICOMM instance for loopback. This
                                                                                    instance will be treated as the
                                                                                    controller. */
#define M33C1SPGSS2_PAIR1_CTL_SPG1               ((uint32_t)0x00000000U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR1_CTL_SPG2               ((uint32_t)0x00000100U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR1_CTL_SPG3               ((uint32_t)0x00000200U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR1_CTL_SPG4               ((uint32_t)0x00000300U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR1_CTL_SPG5               ((uint32_t)0x00000400U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR1_CTL_SPG6               ((uint32_t)0x00000500U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR1_CTL_SPG7               ((uint32_t)0x00000600U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR1_CTL_SPG8               ((uint32_t)0x00000700U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR1_CTL_SPG9               ((uint32_t)0x00000800U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR1_CTL_SPG10              ((uint32_t)0x00000900U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR1_CTL_SPG11              ((uint32_t)0x00000A00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR1_CTL_SPG12              ((uint32_t)0x00000B00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR1_CTL_SPG13              ((uint32_t)0x00000C00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR1_CTL_SPG14              ((uint32_t)0x00000D00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR1_CTL_SPG15              ((uint32_t)0x00000E00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_PAIR1_CTL_SPG16              ((uint32_t)0x00000F00U)         /* !< SPG commander select for loopback. */
/* M33C1SPGSS2_PAIR1[TARGET] Bits */
#define M33C1SPGSS2_PAIR1_TARGET_OFS             (12)                            /* !< TARGET Offset */
#define M33C1SPGSS2_PAIR1_TARGET_MASK            ((uint32_t)0x0000F000U)         /* !< UNICOMM instance for loopback. This
                                                                                    instance will be treated as the
                                                                                    target */
#define M33C1SPGSS2_PAIR1_TARGET_SPG1            ((uint32_t)0x00000000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR1_TARGET_SPG2            ((uint32_t)0x00001000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR1_TARGET_SPG3            ((uint32_t)0x00002000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR1_TARGET_SPG4            ((uint32_t)0x00003000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR1_TARGET_SPG5            ((uint32_t)0x00004000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR1_TARGET_SPG6            ((uint32_t)0x00005000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR1_TARGET_SPG7            ((uint32_t)0x00006000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR1_TARGET_SPG8            ((uint32_t)0x00007000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR1_TARGET_SPG9            ((uint32_t)0x00008000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR1_TARGET_SPG10           ((uint32_t)0x00009000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR1_TARGET_SPG11           ((uint32_t)0x0000A000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR1_TARGET_SPG12           ((uint32_t)0x0000B000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR1_TARGET_SPG13           ((uint32_t)0x0000C000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR1_TARGET_SPG14           ((uint32_t)0x0000D000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR1_TARGET_SPG15           ((uint32_t)0x0000E000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_PAIR1_TARGET_SPG16           ((uint32_t)0x0000F000U)         /* !< SPG responder select for loopback. */
/* M33C1SPGSS2_PAIR1[EN] Bits */
#define M33C1SPGSS2_PAIR1_EN_OFS                 (0)                             /* !< EN Offset */
#define M33C1SPGSS2_PAIR1_EN_MASK                ((uint32_t)0x00000001U)         /* !< Enable */
#define M33C1SPGSS2_PAIR1_EN_DISABLE             ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define M33C1SPGSS2_PAIR1_EN_ENABLE              ((uint32_t)0x00000001U)         /* !< Select this clock as a source */

/* M33C1SPGSS2_LPBK0 Bits */
/* M33C1SPGSS2_LPBK0[CONTROLLER] Bits */
#define M33C1SPGSS2_LPBK0_CONTROLLER_OFS         (8)                             /* !< CONTROLLER Offset */
#define M33C1SPGSS2_LPBK0_CONTROLLER_MASK        ((uint32_t)0x00000F00U)         /* !< Select SPG controller for loopback.
                                                                                    Signals invovled in loopback based
                                                                                    on interface chosen 1. SPI : CS,
                                                                                    SCLK, SDI, SDO  2. I2C : SCL, SDA 3.
                                                                                    UART : TX, RX */
#define M33C1SPGSS2_LPBK0_CONTROLLER_SPG1        ((uint32_t)0x00000000U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK0_CONTROLLER_SPG2        ((uint32_t)0x00000100U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK0_CONTROLLER_SPG3        ((uint32_t)0x00000200U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK0_CONTROLLER_SPG4        ((uint32_t)0x00000300U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK0_CONTROLLER_SPG5        ((uint32_t)0x00000400U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK0_CONTROLLER_SPG6        ((uint32_t)0x00000500U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK0_CONTROLLER_SPG7        ((uint32_t)0x00000600U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK0_CONTROLLER_SPG8        ((uint32_t)0x00000700U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK0_CONTROLLER_SPG9        ((uint32_t)0x00000800U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK0_CONTROLLER_SPG10       ((uint32_t)0x00000900U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK0_CONTROLLER_SPG11       ((uint32_t)0x00000A00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK0_CONTROLLER_SPG12       ((uint32_t)0x00000B00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK0_CONTROLLER_SPG13       ((uint32_t)0x00000C00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK0_CONTROLLER_SPG14       ((uint32_t)0x00000D00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK0_CONTROLLER_SPG15       ((uint32_t)0x00000E00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK0_CONTROLLER_SPG16       ((uint32_t)0x00000F00U)         /* !< SPG commander select for loopback. */
/* M33C1SPGSS2_LPBK0[EN] Bits */
#define M33C1SPGSS2_LPBK0_EN_OFS                 (0)                             /* !< EN Offset */
#define M33C1SPGSS2_LPBK0_EN_MASK                ((uint32_t)0x00000001U)         /* !< Loopback  enable */
#define M33C1SPGSS2_LPBK0_EN_DISABLE             ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define M33C1SPGSS2_LPBK0_EN_ENABLE              ((uint32_t)0x00000001U)         /* !< Select this clock as a source */
/* M33C1SPGSS2_LPBK0[PERIPHERAL] Bits */
#define M33C1SPGSS2_LPBK0_PERIPHERAL_OFS         (12)                            /* !< PERIPHERAL Offset */
#define M33C1SPGSS2_LPBK0_PERIPHERAL_MASK        ((uint32_t)0x0000F000U)         /* !< Select SPG peripheral for loopback.
                                                                                    Signals invovled in loopback based
                                                                                    on interface chosen 1. SPI : CS,
                                                                                    SCLK, SDI, SDO  2. I2C : SCL, SDA 3.
                                                                                    UART : TX, RX */
#define M33C1SPGSS2_LPBK0_PERIPHERAL_SPG1        ((uint32_t)0x00000000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK0_PERIPHERAL_SPG2        ((uint32_t)0x00001000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK0_PERIPHERAL_SPG3        ((uint32_t)0x00002000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK0_PERIPHERAL_SPG4        ((uint32_t)0x00003000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK0_PERIPHERAL_SPG5        ((uint32_t)0x00004000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK0_PERIPHERAL_SPG6        ((uint32_t)0x00005000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK0_PERIPHERAL_SPG7        ((uint32_t)0x00006000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK0_PERIPHERAL_SPG8        ((uint32_t)0x00007000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK0_PERIPHERAL_SPG9        ((uint32_t)0x00008000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK0_PERIPHERAL_SPG10       ((uint32_t)0x00009000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK0_PERIPHERAL_SPG11       ((uint32_t)0x0000A000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK0_PERIPHERAL_SPG12       ((uint32_t)0x0000B000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK0_PERIPHERAL_SPG13       ((uint32_t)0x0000C000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK0_PERIPHERAL_SPG14       ((uint32_t)0x0000D000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK0_PERIPHERAL_SPG15       ((uint32_t)0x0000E000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK0_PERIPHERAL_SPG16       ((uint32_t)0x0000F000U)         /* !< SPG responder select for loopback. */

/* M33C1SPGSS2_LPBK1 Bits */
/* M33C1SPGSS2_LPBK1[CONTROLLER] Bits */
#define M33C1SPGSS2_LPBK1_CONTROLLER_OFS         (8)                             /* !< CONTROLLER Offset */
#define M33C1SPGSS2_LPBK1_CONTROLLER_MASK        ((uint32_t)0x00000F00U)         /* !< Select SPG controller for loopback.
                                                                                    Signals invovled in loopback based
                                                                                    on interface chosen 1. SPI : CS,
                                                                                    SCLK, SDI, SDO  2. I2C : SCL, SDA 3.
                                                                                    UART : TX, RX */
#define M33C1SPGSS2_LPBK1_CONTROLLER_SPG1        ((uint32_t)0x00000000U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK1_CONTROLLER_SPG2        ((uint32_t)0x00000100U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK1_CONTROLLER_SPG3        ((uint32_t)0x00000200U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK1_CONTROLLER_SPG4        ((uint32_t)0x00000300U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK1_CONTROLLER_SPG5        ((uint32_t)0x00000400U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK1_CONTROLLER_SPG6        ((uint32_t)0x00000500U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK1_CONTROLLER_SPG7        ((uint32_t)0x00000600U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK1_CONTROLLER_SPG8        ((uint32_t)0x00000700U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK1_CONTROLLER_SPG9        ((uint32_t)0x00000800U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK1_CONTROLLER_SPG10       ((uint32_t)0x00000900U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK1_CONTROLLER_SPG11       ((uint32_t)0x00000A00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK1_CONTROLLER_SPG12       ((uint32_t)0x00000B00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK1_CONTROLLER_SPG13       ((uint32_t)0x00000C00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK1_CONTROLLER_SPG14       ((uint32_t)0x00000D00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK1_CONTROLLER_SPG15       ((uint32_t)0x00000E00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS2_LPBK1_CONTROLLER_SPG16       ((uint32_t)0x00000F00U)         /* !< SPG commander select for loopback. */
/* M33C1SPGSS2_LPBK1[EN] Bits */
#define M33C1SPGSS2_LPBK1_EN_OFS                 (0)                             /* !< EN Offset */
#define M33C1SPGSS2_LPBK1_EN_MASK                ((uint32_t)0x00000001U)         /* !< Loopback  enable */
#define M33C1SPGSS2_LPBK1_EN_DISABLE             ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define M33C1SPGSS2_LPBK1_EN_ENABLE              ((uint32_t)0x00000001U)         /* !< Select this clock as a source */
/* M33C1SPGSS2_LPBK1[PERIPHERAL] Bits */
#define M33C1SPGSS2_LPBK1_PERIPHERAL_OFS         (12)                            /* !< PERIPHERAL Offset */
#define M33C1SPGSS2_LPBK1_PERIPHERAL_MASK        ((uint32_t)0x0000F000U)         /* !< Select SPG peripheral for loopback.
                                                                                    Signals invovled in loopback based
                                                                                    on interface chosen 1. SPI : CS,
                                                                                    SCLK, SDI, SDO  2. I2C : SCL, SDA 3.
                                                                                    UART : TX, RX */
#define M33C1SPGSS2_LPBK1_PERIPHERAL_SPG1        ((uint32_t)0x00000000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK1_PERIPHERAL_SPG2        ((uint32_t)0x00001000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK1_PERIPHERAL_SPG3        ((uint32_t)0x00002000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK1_PERIPHERAL_SPG4        ((uint32_t)0x00003000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK1_PERIPHERAL_SPG5        ((uint32_t)0x00004000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK1_PERIPHERAL_SPG6        ((uint32_t)0x00005000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK1_PERIPHERAL_SPG7        ((uint32_t)0x00006000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK1_PERIPHERAL_SPG8        ((uint32_t)0x00007000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK1_PERIPHERAL_SPG9        ((uint32_t)0x00008000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK1_PERIPHERAL_SPG10       ((uint32_t)0x00009000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK1_PERIPHERAL_SPG11       ((uint32_t)0x0000A000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK1_PERIPHERAL_SPG12       ((uint32_t)0x0000B000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK1_PERIPHERAL_SPG13       ((uint32_t)0x0000C000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK1_PERIPHERAL_SPG14       ((uint32_t)0x0000D000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK1_PERIPHERAL_SPG15       ((uint32_t)0x0000E000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS2_LPBK1_PERIPHERAL_SPG16       ((uint32_t)0x0000F000U)         /* !< SPG responder select for loopback. */

