TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC1_SPI_IPSPECIFIC_RXDATA Bits */
/* M33C1SPGSS2_UC1_SPI_IPSPECIFIC_RXDATA[DATA] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_RXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_RXDATA_DATA_MASK ((uint32_t)0x0000FFFFU)         /* !< Received Data When PACKEN=1,two
                                                                                    entries of the FIFO are returned as a
                                                                                    32-bit value. When PACKEN=0, 1 entry
                                                                                    of FIFO is returned as 16-bit value.
                                                                                    As data values are removed by the
                                                                                    receive logic from the incoming data
                                                                                    frame, they are placed into the entry
                                                                                    in the receive FIFO, pointed to by
                                                                                    the current FIFO write pointer.
                                                                                    Received data less than 16 bits is
                                                                                    automatically right justified in the
                                                                                    receive buffer. */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_RXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_RXDATA_DATA_MAXIMUM ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1 Bits */
/* M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1[LBM] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_LBM_OFS (1)                             /* !< LBM Offset */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_LBM_MASK ((uint32_t)0x00000002U)         /* !< Loop back mode */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_LBM_DISABLE ((uint32_t)0x00000000U)         /* !< Disable loopback mode */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_LBM_ENABLE ((uint32_t)0x00000002U)         /* !< Enable loopback mode */
/* M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1[CP] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_CP_OFS (2)                             /* !< CP Offset */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_CP_MASK ((uint32_t)0x00000004U)         /* !< Controller or peripheral mode
                                                                                    select. This bit can be modified only
                                                                                    when SPI is disabled, CTL1.ENABLE=0. */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_CP_DISABLE ((uint32_t)0x00000000U)         /* !< Select Peripheral mode */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_CP_ENABLE ((uint32_t)0x00000004U)         /* !< Select Controller Mode */
/* M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1[POD] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_POD_OFS (3)                             /* !< POD Offset */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_POD_MASK ((uint32_t)0x00000008U)         /* !< Peripheral-mode: Data output
                                                                                    disabled This bit is relevant only in
                                                                                    Peripheral mode. In
                                                                                    multiple-peripheral system
                                                                                    topologies, SPI controller can
                                                                                    broadcast a message to all
                                                                                    peripherals, while only one
                                                                                    peripheral drives the line.  POD can
                                                                                    be used by the SPI peripheral to
                                                                                    disable driving data on the line. */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_POD_DISABLE ((uint32_t)0x00000000U)         /* !< SPI can drive the POCI output in
                                                                                    peripheral mode. */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_POD_ENABLE ((uint32_t)0x00000008U)         /* !< SPI cannot drive the POCI output in
                                                                                    peripheral mode. */
/* M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1[MSB] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_MSB_OFS (4)                             /* !< MSB Offset */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_MSB_MASK ((uint32_t)0x00000010U)         /* !< MSB first select. Controls the
                                                                                    direction of the receive and transmit
                                                                                    shift register. */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_MSB_DISABLE ((uint32_t)0x00000000U)         /* !< LSB first */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_MSB_ENABLE ((uint32_t)0x00000010U)         /* !< MSB first */
/* M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1[PREN] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_PREN_OFS (5)                             /* !< PREN Offset */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_PREN_MASK ((uint32_t)0x00000020U)         /* !< Parity receive enable If enabled,
                                                                                    parity reception check will be done
                                                                                    for both controller and peripheral
                                                                                    modes In case of a parity miss-match
                                                                                    the parity error flag RIS.PER will be
                                                                                    set. */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_PREN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Parity receive function */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_PREN_ENABLE ((uint32_t)0x00000020U)         /* !< Enable Parity receive function */
/* M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1[PES] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_PES_OFS (6)                             /* !< PES Offset */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_PES_MASK ((uint32_t)0x00000040U)         /* !< Even Parity Select */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_PES_DISABLE ((uint32_t)0x00000000U)         /* !< Odd Parity mode */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_PES_ENABLE ((uint32_t)0x00000040U)         /* !< Even Parity mode */
/* M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1[ENABLE] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_ENABLE_OFS (0)                             /* !< ENABLE Offset */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_ENABLE_MASK ((uint32_t)0x00000001U)         /* !< SPI enable */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_ENABLE_DISABLE ((uint32_t)0x00000000U)         /* !< Disable module function */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_ENABLE_ENABLE ((uint32_t)0x00000001U)         /* !< Enable module function */
/* M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1[PTEN] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_PTEN_OFS (8)                             /* !< PTEN Offset */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_PTEN_MASK ((uint32_t)0x00000100U)         /* !< Parity transmit enable If enabled,
                                                                                    parity transmission will be done for
                                                                                    both controller and peripheral modes. */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_PTEN_DISABLE ((uint32_t)0x00000000U)         /* !< Parity transmission is disabled */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_PTEN_ENABLE ((uint32_t)0x00000100U)         /* !< Parity transmission is enabled */
/* M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1[SUSPEND] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_SUSPEND_OFS (9)                             /* !< SUSPEND Offset */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_SUSPEND_MASK ((uint32_t)0x00000200U)         /* !< Suspend external communication */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_SUSPEND_DISABLE ((uint32_t)0x00000000U)         /* !< Functional mode resumed */
#define M33C1SPGSS2_UC1_SPI_IPSPECIFIC_CTL1_SUSPEND_ENABLE ((uint32_t)0x00000200U)         /* !< External communication suspended */

