TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK Bits */
/* M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK[RX] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_RX_OFS (2)                             /* !< RX Offset */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_RX_MASK ((uint32_t)0x00000004U)         /* !< Mask Receive Event */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_RX_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_RX_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK[TX] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_TX_OFS (5)                             /* !< TX Offset */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_TX_MASK ((uint32_t)0x00000020U)         /* !< Mask Transmit Event */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_TX_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_TX_SET ((uint32_t)0x00000020U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK[TXEMPTY] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_TXEMPTY_OFS (6)                             /* !< TXEMPTY Offset */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_TXEMPTY_MASK ((uint32_t)0x00000040U)         /* !< Transmit FIFO Empty event mask. */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_TXEMPTY_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_TXEMPTY_SET ((uint32_t)0x00000040U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK[PER] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_PER_OFS (0)                             /* !< PER Offset */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_PER_MASK ((uint32_t)0x00000001U)         /* !< Parity error event mask. */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_PER_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_PER_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK[RXFIFO_OVF] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_RXFIFO_OVF_OFS (1)                             /* !< RXFIFO_OVF Offset */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_RXFIFO_OVF_MASK ((uint32_t)0x00000002U)         /* !< RXFIFO overflow event mask. */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_RXFIFO_OVF_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_RXFIFO_OVF_SET ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK[IDLE] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_IDLE_OFS (8)                             /* !< IDLE Offset */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_IDLE_MASK ((uint32_t)0x00000100U)         /* !< SPI Idle event mask. */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_IDLE_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_IDLE_SET ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK[RXFULL] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_RXFULL_OFS (3)                             /* !< RXFULL Offset */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_RXFULL_MASK ((uint32_t)0x00000008U)         /* !< RX FIFO Full Interrupt Mask */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_RXFULL_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_RXFULL_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK[TXFIFO_UNF] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_TXFIFO_UNF_OFS (4)                             /* !< TXFIFO_UNF Offset */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_TXFIFO_UNF_MASK ((uint32_t)0x00000010U)         /* !< TX FIFO underflow interrupt mask */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_TXFIFO_UNF_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_TXFIFO_UNF_SET ((uint32_t)0x00000010U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK[DMA_DONE_RX] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< Enable DMA Done on RX Event Channel
                                                                                    Interrupt */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_RX_SET ((uint32_t)0x00008000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK[DMA_DONE_TX] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< Enable DMA Done on TX Event Channel
                                                                                    Interrupt */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_TX_SET ((uint32_t)0x00010000U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS Bits */
/* M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS[RX] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_RX_OFS (2)                             /* !< RX Offset */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_RX_MASK ((uint32_t)0x00000004U)         /* !< Receive event When FIFO is present,
                                                                                    this bit is set when FIFO threshold
                                                                                    is reached When FIFO is not present,
                                                                                    this bit is set when a frame is
                                                                                    received */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_RX_SET ((uint32_t)0x00000004U)         /* !< Interrupt occurred */
/* M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS[TX] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_TX_OFS (5)                             /* !< TX Offset */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_TX_MASK ((uint32_t)0x00000020U)         /* !< Transmit event When FIFO is
                                                                                    present, this bit is set when Tx FIFO
                                                                                    threshold is reached When FIFO is not
                                                                                    present, this bit is set when tx
                                                                                    buffer is empty */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_TX_SET ((uint32_t)0x00000020U)         /* !< Interrupt occurred */
/* M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS[TXEMPTY] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_TXEMPTY_OFS (6)                             /* !< TXEMPTY Offset */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_TXEMPTY_MASK ((uint32_t)0x00000040U)         /* !< Transmit FIFO Empty interrupt mask.
                                                                                    This interrupt is set if all data in
                                                                                    the Transmit FIFO have been move to
                                                                                    the shift register. */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_TXEMPTY_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_TXEMPTY_SET ((uint32_t)0x00000040U)         /* !< Interrupt occurred */
/* M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS[PER] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_PER_OFS (0)                             /* !< PER Offset */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_PER_MASK ((uint32_t)0x00000001U)         /* !< Parity error event: this bit is set
                                                                                    if a Parity error has been detected */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_PER_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_PER_SET ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS[RXFIFO_OVF] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_RXFIFO_OVF_OFS (1)                             /* !< RXFIFO_OVF Offset */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_RXFIFO_OVF_MASK ((uint32_t)0x00000002U)         /* !< RXFIFO overflow event. This
                                                                                    interrupt is set if an RX FIFO
                                                                                    overflow has been detected. */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_RXFIFO_OVF_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_RXFIFO_OVF_SET ((uint32_t)0x00000002U)         /* !< Interrupt occurred */
/* M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS[IDLE] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_IDLE_OFS (8)                             /* !< IDLE Offset */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_IDLE_MASK ((uint32_t)0x00000100U)         /* !< SPI has done finished transfers and
                                                                                    changed into IDLE mode. This bit is
                                                                                    set when BUSY goes low. */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_IDLE_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_IDLE_SET ((uint32_t)0x00000100U)         /* !< Interrupt occurred */
/* M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS[TXFIFO_UNF] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_TXFIFO_UNF_OFS (4)                             /* !< TXFIFO_UNF Offset */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_TXFIFO_UNF_MASK ((uint32_t)0x00000010U)         /* !< TX FIFO Underflow Interrupt */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_TXFIFO_UNF_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_TXFIFO_UNF_SET ((uint32_t)0x00000010U)         /* !< Interrupt occurred */
/* M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS[RXFULL] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_RXFULL_OFS (3)                             /* !< RXFULL Offset */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_RXFULL_MASK ((uint32_t)0x00000008U)         /* !< RX FIFO Full Interrupt */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_RXFULL_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_RXFULL_SET ((uint32_t)0x00000008U)         /* !< Interrupt occurred */
/* M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS[DMA_DONE_RX] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< DMA Done on RX Event Channel
                                                                                    Interrupt */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_DMA_DONE_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_DMA_DONE_RX_SET ((uint32_t)0x00008000U)         /* !< Interrupt occured */
/* M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS[DMA_DONE_TX] Bits */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< DMA Done on TX Event Channel
                                                                                    Interrupt */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_DMA_DONE_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS2_UC1_SPI_IPSTANDARD_CPU_INT_RIS_DMA_DONE_TX_SET ((uint32_t)0x00010000U)         /* !< Interrupt occured */

