TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC0_SPI_LMGMT_DFT_ATRT_TEST0 Bits */
/* M33C1SPGSS2_UC0_SPI_LMGMT_DFT_ATRT_TEST0[DTB_MUX_SEL] Bits */
#define M33C1SPGSS2_UC0_SPI_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_OFS (0)                             /* !< DTB_MUX_SEL Offset */
#define M33C1SPGSS2_UC0_SPI_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_MASK ((uint32_t)0x0000000FU)         /* !< This bit field is used to select
                                                                                    DTB mux digital output signals. */
#define M33C1SPGSS2_UC0_SPI_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Disables DTB MUX */
#define M33C1SPGSS2_UC0_SPI_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP1 ((uint32_t)0x00000001U)         /* !< Selects test group 1 */
#define M33C1SPGSS2_UC0_SPI_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP2 ((uint32_t)0x00000002U)         /* !< Selects test group 2 */
#define M33C1SPGSS2_UC0_SPI_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP3 ((uint32_t)0x00000003U)         /* !< Selects test group 3 */
#define M33C1SPGSS2_UC0_SPI_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP4 ((uint32_t)0x00000004U)         /* !< Selects test group 4 */
#define M33C1SPGSS2_UC0_SPI_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP5 ((uint32_t)0x00000005U)         /* !< Selects test group 5 */
#define M33C1SPGSS2_UC0_SPI_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP6 ((uint32_t)0x00000006U)         /* !< Selects test group 6 */
#define M33C1SPGSS2_UC0_SPI_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP7 ((uint32_t)0x00000007U)         /* !< Selects test group 7 */
#define M33C1SPGSS2_UC0_SPI_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP8 ((uint32_t)0x00000008U)         /* !< Selects test group 8 */
#define M33C1SPGSS2_UC0_SPI_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP9 ((uint32_t)0x00000009U)         /* !< Selects test group 9 */

/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0 Bits */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0[DSS] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_DSS_OFS (0)                             /* !< DSS Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_DSS_MASK ((uint32_t)0x0000001FU)         /* !< Data Size Select. Values 0 - 2 are
                                                                                    reserved and shall not be used. 3h =
                                                                                    4_BIT : 4-bit data SPI allows only
                                                                                    values up to 16 Bit */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_DSS_DSS_4 ((uint32_t)0x00000003U)         /* !< Data Size Select bits: 4 */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_DSS_DSS_5 ((uint32_t)0x00000004U)         /* !< Data Size Select bits: 5 */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_DSS_DSS_6 ((uint32_t)0x00000005U)         /* !< Data Size Select bits: 6 */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_DSS_DSS_7 ((uint32_t)0x00000006U)         /* !< Data Size Select bits: 7 */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_DSS_DSS_8 ((uint32_t)0x00000007U)         /* !< Data Size Select bits: 8 */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_DSS_DSS_9 ((uint32_t)0x00000008U)         /* !< Data Size Select bits: 9 */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_DSS_DSS_10 ((uint32_t)0x00000009U)         /* !< Data Size Select bits: 10 */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_DSS_DSS_11 ((uint32_t)0x0000000AU)         /* !< Data Size Select bits: 11 */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_DSS_DSS_12 ((uint32_t)0x0000000BU)         /* !< Data Size Select bits: 12 */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_DSS_DSS_13 ((uint32_t)0x0000000CU)         /* !< Data Size Select bits: 13 */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_DSS_DSS_14 ((uint32_t)0x0000000DU)         /* !< Data Size Select bits: 14 */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_DSS_DSS_15 ((uint32_t)0x0000000EU)         /* !< Data Size Select bits: 15 */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_DSS_DSS_16 ((uint32_t)0x0000000FU)         /* !< Data Size Select bits: 16 */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0[FRF] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_FRF_OFS (5)                             /* !< FRF Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_FRF_MASK ((uint32_t)0x00000060U)         /* !< Frame format Select */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_FRF_MOTOROLA_3WIRE ((uint32_t)0x00000000U)         /* !< Motorola SPI frame format (3 wire
                                                                                    mode) */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_FRF_MOTOROLA_4WIRE ((uint32_t)0x00000020U)         /* !< Motorola SPI frame format (4 wire
                                                                                    mode) */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_FRF_TI_SYNC ((uint32_t)0x00000040U)         /* !< TI synchronous serial frame format */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0[SPO] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_SPO_OFS (8)                             /* !< SPO Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_SPO_MASK ((uint32_t)0x00000100U)         /* !< CLKOUT polarity (Motorola SPI frame
                                                                                    format only) */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_SPO_LOW ((uint32_t)0x00000000U)         /* !< SPI produces a steady state LOW
                                                                                    value on the CLKOUT */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_SPO_HIGH ((uint32_t)0x00000100U)         /* !< SPI produces a steady state HIGH
                                                                                    value on the CLKOUT */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0[SPH] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_SPH_OFS (9)                             /* !< SPH Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_SPH_MASK ((uint32_t)0x00000200U)         /* !< CLKOUT phase (Motorola SPI frame
                                                                                    format only) This bit selects the
                                                                                    clock edge that captures data and
                                                                                    enables it to change state. It has
                                                                                    the most impact on the first bit
                                                                                    transmitted by either permitting or
                                                                                    not permitting a clock transition
                                                                                    before the first data capture edge. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_SPH_FIRST ((uint32_t)0x00000000U)         /* !< Data is captured on the first clock
                                                                                    edge transition. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_SPH_SECOND ((uint32_t)0x00000200U)         /* !< Data is captured on the second
                                                                                    clock edge transition. */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0[CSCLR] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_CSCLR_OFS (14)                            /* !< CSCLR Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_CSCLR_MASK ((uint32_t)0x00004000U)         /* !< Clear shift register counter on CS
                                                                                    inactive This bit is relevant only in
                                                                                    the peripheral, CTL1.CP=0. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_CSCLR_DISABLE ((uint32_t)0x00000000U)         /* !< Disable automatic clear of shift
                                                                                    register when CS goes to disable. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL0_CSCLR_ENABLE ((uint32_t)0x00004000U)         /* !< Enable automatic clear of shift
                                                                                    register when CS goes to disable. */

/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT Bits */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT[TXFE] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_TXFE_OFS (5)                             /* !< TXFE Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_TXFE_MASK ((uint32_t)0x00000020U)         /* !< Transmit FIFO empty. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_TXFE_NOT_EMPTY ((uint32_t)0x00000000U)         /* !< Transmit FIFO is not empty. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_TXFE_EMPTY ((uint32_t)0x00000020U)         /* !< Transmit FIFO is empty. */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT[RXFE] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_RXFE_OFS (2)                             /* !< RXFE Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_RXFE_MASK ((uint32_t)0x00000004U)         /* !< Receive FIFO empty. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_RXFE_NOT_EMPTY ((uint32_t)0x00000000U)         /* !< Receive FIFO is not empty. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_RXFE_EMPTY ((uint32_t)0x00000004U)         /* !< Receive FIFO is empty. */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT[BUSY] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_BUSY_OFS (8)                             /* !< BUSY Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_BUSY_MASK ((uint32_t)0x00000100U)         /* !< Busy */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_BUSY_IDLE ((uint32_t)0x00000000U)         /* !< SPI is in idle mode. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_BUSY_ACTIVE ((uint32_t)0x00000100U)         /* !< SPI is currently transmitting
                                                                                    and/or receiving data */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT[RXCLR] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_RXCLR_OFS (4)                             /* !< RXCLR Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_RXCLR_MASK ((uint32_t)0x00000010U)         /* !< RX FIFO Clear Status */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_RXCLR_CLEARED ((uint32_t)0x00000000U)         /* !< FIFO is not cleared */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_RXCLR_SET ((uint32_t)0x00000010U)         /* !< FIFO clear is complete */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT[TXCLR] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_TXCLR_OFS (7)                             /* !< TXCLR Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_TXCLR_MASK ((uint32_t)0x00000080U)         /* !< TX FIFO Clear Status */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_TXCLR_CLEARED ((uint32_t)0x00000000U)         /* !< FIFO is not cleared */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_TXCLR_SET ((uint32_t)0x00000080U)         /* !< FIFO clear is complete */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT[RXFF] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_RXFF_OFS (3)                             /* !< RXFF Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_RXFF_MASK ((uint32_t)0x00000008U)         /* !< Receive FIFO Full  The meaning of
                                                                                    this bit depends on the state of the
                                                                                    FEN bit in the CTL0 register. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_RXFF_CLEARED ((uint32_t)0x00000000U)         /* !< The receiver can receive data. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_RXFF_SET ((uint32_t)0x00000008U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the receive holding register is full.
                                                                                    If the FIFO is enabled (FEN is 1),
                                                                                    the receive FIFO is full. */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT[TXFF] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_TXFF_OFS (6)                             /* !< TXFF Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_TXFF_MASK ((uint32_t)0x00000040U)         /* !< Transmit FIFO Full  The meaning of
                                                                                    this bit depends on the state of the
                                                                                    FEN bit in the CTL0 register. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_TXFF_CLEARED ((uint32_t)0x00000000U)         /* !< The transmitter is not full. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_STAT_TXFF_SET ((uint32_t)0x00000040U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the transmit holding register is
                                                                                    full. If the FIFO is enabled (FEN is
                                                                                    1), the transmit FIFO is full. */

