TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS Bits */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS[TXIFLSEL] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_TXIFLSEL_OFS (0)                             /* !< TXIFLSEL Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_TXIFLSEL_MASK ((uint32_t)0x00000007U)         /* !< FIFO Level Select for generating
                                                                                    events (interrupt/dma).  Note: for
                                                                                    undefined settings the default
                                                                                    configuration is used. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_TXIFLSEL_LVL_3_4 ((uint32_t)0x00000001U)         /* !< TX FIFO <= 3/4 empty */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_TXIFLSEL_LVL_1_2 ((uint32_t)0x00000002U)         /* !< TX FIFO <= 1/2 empty (default) */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_TXIFLSEL_LVL_1_4 ((uint32_t)0x00000003U)         /* !< TX FIFO <= 1/4 empty */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_TXIFLSEL_LVL_NOT_FULL ((uint32_t)0x00000004U)         /* !< Opposite of full */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_TXIFLSEL_LVL_EMPTY ((uint32_t)0x00000005U)         /* !< TX FIFO is empty */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_TXIFLSEL_LVL_ALMOST_EMPTY ((uint32_t)0x00000006U)         /* !< TX FIFO <= 1 */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_TXIFLSEL_LVL_ALMOST_FULL ((uint32_t)0x00000007U)         /* !< TX_FIFO >= (MAX_FIFO_LEN -1) */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS[RXIFLSEL] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_RXIFLSEL_OFS (4)                             /* !< RXIFLSEL Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_RXIFLSEL_MASK ((uint32_t)0x00000070U)         /* !< FIFO Level Select for generating
                                                                                    events (interrupt/dma).  Note: for
                                                                                    undefined settings the default
                                                                                    configuration is used. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_RXIFLSEL_LVL_1_4 ((uint32_t)0x00000010U)         /* !< RX FIFO >= 1/4 full */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_RXIFLSEL_LVL_1_2 ((uint32_t)0x00000020U)         /* !< RX FIFO >= 1/2 full (default) */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_RXIFLSEL_LVL_3_4 ((uint32_t)0x00000030U)         /* !< RX FIFO >= 3/4 full */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_RXIFLSEL_LVL_NOT_EMPTY ((uint32_t)0x00000040U)         /* !< Opposite of empty */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_RXIFLSEL_LVL_FULL ((uint32_t)0x00000050U)         /* !< RX FIFO is full */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_RXIFLSEL_LVL_ALMOST_FULL ((uint32_t)0x00000060U)         /* !< RX_FIFO >= (MAX_FIFO_LEN -1) */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_RXIFLSEL_LVL_ALMOST_EMPTY ((uint32_t)0x00000070U)         /* !< RX_FIFO <= 1 */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS[TXCLR] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_TXCLR_OFS (3)                             /* !< TXCLR Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_TXCLR_MASK ((uint32_t)0x00000008U)         /* !< TX FIFO CLEAR. Setting this bit
                                                                                    will clear the TX FIFO contents. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_TXCLR_DISABLE ((uint32_t)0x00000000U)         /* !< Disable FIFO clear */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_TXCLR_ENABLE ((uint32_t)0x00000008U)         /* !< Enable FIFO Clear */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS[RXCLR] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_RXCLR_OFS (7)                             /* !< RXCLR Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_RXCLR_MASK ((uint32_t)0x00000080U)         /* !< RX FIFO CLEAR. Setting this bit
                                                                                    will clear the RX FIFO contents. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_RXCLR_DISABLE ((uint32_t)0x00000000U)         /* !< Disable FIFO clear */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_IFLS_RXCLR_ENABLE ((uint32_t)0x00000080U)         /* !< Enable FIFO Clear */

/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CLKCTL Bits */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CLKCTL[SCR] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CLKCTL_SCR_OFS (0)                             /* !< SCR Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CLKCTL_SCR_MASK ((uint32_t)0x000003FFU)         /* !< Serial clock divider: This is used
                                                                                    to generate the transmit and receive
                                                                                    bit rate of the SPI. The SPI bit rate
                                                                                    is (SPI's functional clock
                                                                                    frequency)/((SCR+1)*2). SCR is a
                                                                                    value from 0-1023. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CLKCTL_SCR_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CLKCTL_SCR_MAXIMUM ((uint32_t)0x000003FFU)         /* !< Highest possible value */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CLKCTL[DSAMPLE] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CLKCTL_DSAMPLE_OFS (28)                            /* !< DSAMPLE Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CLKCTL_DSAMPLE_MASK ((uint32_t)0xF0000000U)         /* !< Delayed sampling value.  In
                                                                                    controller mode the data on the input
                                                                                    pin will be delayed sampled by the
                                                                                    defined clock cycles of internal
                                                                                    functional clock hence relaxing the
                                                                                    setup time of input data. This
                                                                                    setting is useful in systems where
                                                                                    the board delays and external
                                                                                    peripheral delays are more than the
                                                                                    input setup time of the controller.
                                                                                    Please refer to the datasheet for
                                                                                    values of controller input setup time
                                                                                    and assess what DSAMPLE value meets
                                                                                    the requirement of the system. Note:
                                                                                    High values of DSAMPLE can cause HOLD
                                                                                    time violations and must be factored
                                                                                    in the calculations. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CLKCTL_DSAMPLE_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CLKCTL_DSAMPLE_MAXIMUM ((uint32_t)0xF0000000U)         /* !< Highest possible value */

/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_TXDATA Bits */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_TXDATA[DATA] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_TXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_TXDATA_DATA_MASK ((uint32_t)0x0000FFFFU)         /* !< Transmit Data When read, last
                                                                                    written value will be returned. If
                                                                                    the last write to this field was a
                                                                                    32-bit write (with PACKEN=1), 32-bits
                                                                                    will be returned and if the last
                                                                                    write was a 16-bit write (PACKEN=0),
                                                                                    those 16-bits will be returned.
                                                                                    When written, one or two FIFO entries
                                                                                    will be written depending on PACKEN
                                                                                    value. Data values are removed from
                                                                                    the transmit FIFO one value at a time
                                                                                    by the transmit logic. It is loaded
                                                                                    into the transmit serial shifter,
                                                                                    then serially shifted out onto the
                                                                                    TXD output pin at the programmed bit
                                                                                    rate.  When a data size of less than
                                                                                    16 bits is selected, the user must
                                                                                    right-justify data written to the
                                                                                    transmit FIFO. The transmit logic
                                                                                    ignores the unused bits. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_TXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_TXDATA_DATA_MAXIMUM ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_RXDATA Bits */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_RXDATA[DATA] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_RXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_RXDATA_DATA_MASK ((uint32_t)0x0000FFFFU)         /* !< Received Data When PACKEN=1,two
                                                                                    entries of the FIFO are returned as a
                                                                                    32-bit value. When PACKEN=0, 1 entry
                                                                                    of FIFO is returned as 16-bit value.
                                                                                    As data values are removed by the
                                                                                    receive logic from the incoming data
                                                                                    frame, they are placed into the entry
                                                                                    in the receive FIFO, pointed to by
                                                                                    the current FIFO write pointer.
                                                                                    Received data less than 16 bits is
                                                                                    automatically right justified in the
                                                                                    receive buffer. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_RXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_RXDATA_DATA_MAXIMUM ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1 Bits */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1[LBM] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_LBM_OFS (1)                             /* !< LBM Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_LBM_MASK ((uint32_t)0x00000002U)         /* !< Loop back mode */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_LBM_DISABLE ((uint32_t)0x00000000U)         /* !< Disable loopback mode */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_LBM_ENABLE ((uint32_t)0x00000002U)         /* !< Enable loopback mode */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1[CP] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_CP_OFS (2)                             /* !< CP Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_CP_MASK ((uint32_t)0x00000004U)         /* !< Controller or peripheral mode
                                                                                    select. This bit can be modified only
                                                                                    when SPI is disabled, CTL1.ENABLE=0. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_CP_DISABLE ((uint32_t)0x00000000U)         /* !< Select Peripheral mode */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_CP_ENABLE ((uint32_t)0x00000004U)         /* !< Select Controller Mode */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1[POD] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_POD_OFS (3)                             /* !< POD Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_POD_MASK ((uint32_t)0x00000008U)         /* !< Peripheral-mode: Data output
                                                                                    disabled This bit is relevant only in
                                                                                    Peripheral mode. In
                                                                                    multiple-peripheral system
                                                                                    topologies, SPI controller can
                                                                                    broadcast a message to all
                                                                                    peripherals, while only one
                                                                                    peripheral drives the line.  POD can
                                                                                    be used by the SPI peripheral to
                                                                                    disable driving data on the line. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_POD_DISABLE ((uint32_t)0x00000000U)         /* !< SPI can drive the POCI output in
                                                                                    peripheral mode. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_POD_ENABLE ((uint32_t)0x00000008U)         /* !< SPI cannot drive the POCI output in
                                                                                    peripheral mode. */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1[MSB] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_MSB_OFS (4)                             /* !< MSB Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_MSB_MASK ((uint32_t)0x00000010U)         /* !< MSB first select. Controls the
                                                                                    direction of the receive and transmit
                                                                                    shift register. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_MSB_DISABLE ((uint32_t)0x00000000U)         /* !< LSB first */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_MSB_ENABLE ((uint32_t)0x00000010U)         /* !< MSB first */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1[PREN] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_PREN_OFS (5)                             /* !< PREN Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_PREN_MASK ((uint32_t)0x00000020U)         /* !< Parity receive enable If enabled,
                                                                                    parity reception check will be done
                                                                                    for both controller and peripheral
                                                                                    modes In case of a parity miss-match
                                                                                    the parity error flag RIS.PER will be
                                                                                    set. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_PREN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Parity receive function */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_PREN_ENABLE ((uint32_t)0x00000020U)         /* !< Enable Parity receive function */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1[PES] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_PES_OFS (6)                             /* !< PES Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_PES_MASK ((uint32_t)0x00000040U)         /* !< Even Parity Select */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_PES_DISABLE ((uint32_t)0x00000000U)         /* !< Odd Parity mode */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_PES_ENABLE ((uint32_t)0x00000040U)         /* !< Even Parity mode */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1[ENABLE] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_ENABLE_OFS (0)                             /* !< ENABLE Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_ENABLE_MASK ((uint32_t)0x00000001U)         /* !< SPI enable */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_ENABLE_DISABLE ((uint32_t)0x00000000U)         /* !< Disable module function */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_ENABLE_ENABLE ((uint32_t)0x00000001U)         /* !< Enable module function */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1[PTEN] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_PTEN_OFS (8)                             /* !< PTEN Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_PTEN_MASK ((uint32_t)0x00000100U)         /* !< Parity transmit enable If enabled,
                                                                                    parity transmission will be done for
                                                                                    both controller and peripheral modes. */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_PTEN_DISABLE ((uint32_t)0x00000000U)         /* !< Parity transmission is disabled */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_PTEN_ENABLE ((uint32_t)0x00000100U)         /* !< Parity transmission is enabled */
/* M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1[SUSPEND] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_SUSPEND_OFS (9)                             /* !< SUSPEND Offset */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_SUSPEND_MASK ((uint32_t)0x00000200U)         /* !< Suspend external communication */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_SUSPEND_DISABLE ((uint32_t)0x00000000U)         /* !< Functional mode resumed */
#define M33C1SPGSS2_UC0_SPI_IPSPECIFIC_CTL1_SUSPEND_ENABLE ((uint32_t)0x00000200U)         /* !< External communication suspended */

/* M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_IMASK Bits */
/* M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_IMASK[TX] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_IMASK_TX_OFS (5)                             /* !< TX Offset */
#define M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_IMASK_TX_MASK ((uint32_t)0x00000020U)         /* !< Transmit FIFO event mask. */
#define M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_IMASK_TX_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_IMASK_TX_SET ((uint32_t)0x00000020U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_RIS Bits */
/* M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_RIS[TX] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_RIS_TX_OFS (5)                             /* !< TX Offset */
#define M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_RIS_TX_MASK ((uint32_t)0x00000020U)         /* !< Transmit FIFO event: A read returns
                                                                                    the current mask for transmit FIFO
                                                                                    interrupt. On a write of 1, the mask
                                                                                    for transmit FIFO interrupt is set
                                                                                    which means the interrupt state will
                                                                                    be reflected in MIS.TXMIS. A write of
                                                                                    0 clears the mask which means
                                                                                    MIS.TXMIS will not reflect the
                                                                                    interrupt. */
#define M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_RIS_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_RIS_TX_SET ((uint32_t)0x00000020U)         /* !< Interrupt occurred */

/* M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_MIS Bits */
/* M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_MIS[TX] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_MIS_TX_OFS (5)                             /* !< TX Offset */
#define M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_MIS_TX_MASK ((uint32_t)0x00000020U)         /* !< Masked Transmit FIFO event */
#define M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_MIS_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_MIS_TX_SET ((uint32_t)0x00000020U)         /* !< Interrupt occurred */

/* M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_ISET Bits */
/* M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_ISET[TX] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_ISET_TX_OFS (5)                             /* !< TX Offset */
#define M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_ISET_TX_MASK ((uint32_t)0x00000020U)         /* !< Set Transmit FIFO event. */
#define M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_ISET_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_TX_ISET_TX_SET ((uint32_t)0x00000020U)         /* !< Set Interrupt */

/* M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK Bits */
/* M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK[RX] Bits */
#define M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK_RX_OFS (2)                             /* !< RX Offset */
#define M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK_RX_MASK ((uint32_t)0x00000004U)         /* !< Receive FIFO event mask. */
#define M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK_RX_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_SPI_IPSTANDARD_DMA_TRIG_RX_IMASK_RX_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

