TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_PECSR Bits */
/* M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_PECSR[PECBYTECNT] Bits */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_PECSR_PECBYTECNT_OFS (0)                             /* !< PECBYTECNT Offset */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_PECSR_PECBYTECNT_MASK ((uint32_t)0x000001FFU)         /* !< This is the current PEC Byte Count
                                                                                    of the State Machine. */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_PECSR_PECBYTECNT_MINIMUM ((uint32_t)0x00000000U)         /* !< Minimum Value */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_PECSR_PECBYTECNT_MAXIMUM ((uint32_t)0x000001FFU)         /* !< Maximum Value */
/* M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_PECSR[PECSTS_CHECK] Bits */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_PECSR_PECSTS_CHECK_OFS (16)                            /* !< PECSTS_CHECK Offset */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_PECSR_PECSTS_CHECK_MASK ((uint32_t)0x00010000U)         /* !< This status bit indicates if the
                                                                                    PEC was checked in the transaction
                                                                                    that occurred before the last Stop.
                                                                                    Latched on Stop. */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_PECSR_PECSTS_CHECK_CLEARED ((uint32_t)0x00000000U)         /* !< Indicates PEC was not checked in
                                                                                    the transaction that occurred before
                                                                                    the last Stop */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_PECSR_PECSTS_CHECK_SET ((uint32_t)0x00010000U)         /* !< Indicates PEC was checked in the
                                                                                    transaction that occurred before the
                                                                                    last Stop */
/* M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_PECSR[PECSTS_ERROR] Bits */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_PECSR_PECSTS_ERROR_OFS (17)                            /* !< PECSTS_ERROR Offset */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_PECSR_PECSTS_ERROR_MASK ((uint32_t)0x00020000U)         /* !< This status bit indicates if a PEC
                                                                                    check error occurred in the
                                                                                    transaction that occurred before the
                                                                                    last Stop. Latched on Stop. */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_PECSR_PECSTS_ERROR_CLEARED ((uint32_t)0x00000000U)         /* !< Indicates PEC check error did not
                                                                                    occurr in the transaction that
                                                                                    occurred before the last Stop */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_PECSR_PECSTS_ERROR_SET ((uint32_t)0x00020000U)         /* !< Indicates PEC check error occurred
                                                                                    in the transaction that occurred
                                                                                    before the last Stop */

/* M33C1SPGSS2_OAR2 Bits */
/* M33C1SPGSS2_OAR2[OAR2] Bits */
#define M33C1SPGSS2_OAR2_OAR2_OFS                (0)                             /* !< OAR2 Offset */
#define M33C1SPGSS2_OAR2_OAR2_MASK               ((uint32_t)0x0000007FU)         /* !< Own Address 2This field specifies
                                                                                    the alternate OAR2 address. */
#define M33C1SPGSS2_OAR2_OAR2_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_OAR2_OAR2_MAXIMUM            ((uint32_t)0x0000007FU)         /* !< Highest possible value */
/* M33C1SPGSS2_OAR2[OAR2EN] Bits */
#define M33C1SPGSS2_OAR2_OAR2EN_OFS              (7)                             /* !< OAR2EN Offset */
#define M33C1SPGSS2_OAR2_OAR2EN_MASK             ((uint32_t)0x00000080U)         /* !< Own Address 2 Enable */
#define M33C1SPGSS2_OAR2_OAR2EN_DISABLE          ((uint32_t)0x00000000U)         /* !< The alternate address is disabled. */
#define M33C1SPGSS2_OAR2_OAR2EN_ENABLE           ((uint32_t)0x00000080U)         /* !< Enables the use of the alternate
                                                                                    address in the OAR2 field. */
/* M33C1SPGSS2_OAR2[OAR2_MASK] Bits */
#define M33C1SPGSS2_OAR2_OAR2_MASK_OFS           (16)                            /* !< OAR2_MASK Offset */
#define M33C1SPGSS2_OAR2_OAR2_MASK_MASK          ((uint32_t)0x007F0000U)         /* !< Own Address 2 Mask: This field
                                                                                    specifies bits A6 through A0 of the
                                                                                    Target address. The bits with value 1
                                                                                    in SOAR2.OAR2_MASK field will make
                                                                                    the corresponding incoming address
                                                                                    bits to match by default regardless
                                                                                    of the value inside SOAR2.OAR2 i.e.
                                                                                    corresponding SOAR2.OAR2 bit is a
                                                                                    dont care. */
#define M33C1SPGSS2_OAR2_OAR2_MASK_MINIMUM       ((uint32_t)0x00000000U)         /* !< Minimum Value */
#define M33C1SPGSS2_OAR2_OAR2_MASK_MAXIMUM       ((uint32_t)0x007F0000U)         /* !< Maximum Value */

/* M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_OAR Bits */
/* M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_OAR[OAR] Bits */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_OAR_OAR_OFS (0)                             /* !< OAR Offset */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_OAR_OAR_MASK ((uint32_t)0x000003FFU)         /* !< Own Address: This field specifies
                                                                                    bits A9 through A0 of the Target
                                                                                    address. In 7-bit addressing mode as
                                                                                    selected by I2CSOAR.MODE bit, the top
                                                                                    3 bits are don't care */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_OAR_OAR_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_OAR_OAR_MAXIMUM ((uint32_t)0x000003FFU)         /* !< Highest possible value */
/* M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_OAR[OAREN] Bits */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_OAR_OAREN_OFS (14)                            /* !< OAREN Offset */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_OAR_OAREN_MASK ((uint32_t)0x00004000U)         /* !< Own Address Enable */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_OAR_OAREN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable OAR address */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_OAR_OAREN_ENABLE ((uint32_t)0x00004000U)         /* !< Enable OAR address */
/* M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_OAR[MODE] Bits */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_OAR_MODE_OFS (15)                            /* !< MODE Offset */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_OAR_MODE_MASK ((uint32_t)0x00008000U)         /* !< This bit selects the adressing mode
                                                                                    to be used. When 0, 7-bit addressing
                                                                                    is used. When 1, 10-bit addressing is
                                                                                    used. */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_OAR_MODE_MODE7 ((uint32_t)0x00000000U)         /* !< Enable 7-bit addressing */
#define M33C1SPGSS2_UC3_I2CT_IPSPECIFIC_OAR_MODE_MODE10 ((uint32_t)0x00008000U)         /* !< Enable 10-bit addressing */

