TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_GFCTL Bits */
/* M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_GFCTL[DGFSEL] Bits */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_GFCTL_DGFSEL_OFS (0)                             /* !< DGFSEL Offset */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_GFCTL_DGFSEL_MASK ((uint32_t)0x00000007U)         /* !< Glitch Suppression Pulse Width This
                                                                                    field controls the pulse width select
                                                                                    for glitch suppression on the SCL and
                                                                                    SDA lines. The following values are
                                                                                    the glitch suppression values in
                                                                                    terms of functional clocks. (Core
                                                                                    Domain only) */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_GFCTL_DGFSEL_DISABLED ((uint32_t)0x00000000U)         /* !< Bypass */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_GFCTL_DGFSEL_CLK_1 ((uint32_t)0x00000001U)         /* !< 1 clock */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_GFCTL_DGFSEL_CLK_2 ((uint32_t)0x00000002U)         /* !< 2 clocks */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_GFCTL_DGFSEL_CLK_3 ((uint32_t)0x00000003U)         /* !< 3 clocks */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_GFCTL_DGFSEL_CLK_4 ((uint32_t)0x00000004U)         /* !< 4 clocks */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_GFCTL_DGFSEL_CLK_8 ((uint32_t)0x00000005U)         /* !< 8 clocks */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_GFCTL_DGFSEL_CLK_16 ((uint32_t)0x00000006U)         /* !< 16 clocks */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_GFCTL_DGFSEL_CLK_31 ((uint32_t)0x00000007U)         /* !< 31 clocks */

/* M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TTXDATA Bits */
/* M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TTXDATA[DATA] Bits */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TTXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TTXDATA_DATA_MASK ((uint32_t)0x000000FFU)         /* !< Transmit Data This byte contains
                                                                                    the data to be transferred during the
                                                                                    next transaction. */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TTXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TTXDATA_DATA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_RXDATA Bits */
/* M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_RXDATA[DATA] Bits */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_RXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_RXDATA_DATA_MASK ((uint32_t)0x000000FFU)         /* !< Received Data.  This field contains
                                                                                    the last received data. */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_RXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_RXDATA_DATA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_OAR Bits */
/* M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_OAR[OAR] Bits */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_OAR_OAR_OFS (0)                             /* !< OAR Offset */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_OAR_OAR_MASK ((uint32_t)0x000003FFU)         /* !< Own Address: This field specifies
                                                                                    bits A9 through A0 of the Target
                                                                                    address. In 7-bit addressing mode as
                                                                                    selected by I2CSOAR.MODE bit, the top
                                                                                    3 bits are don't care */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_OAR_OAR_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_OAR_OAR_MAXIMUM ((uint32_t)0x000003FFU)         /* !< Highest possible value */
/* M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_OAR[OAREN] Bits */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_OAR_OAREN_OFS (14)                            /* !< OAREN Offset */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_OAR_OAREN_MASK ((uint32_t)0x00004000U)         /* !< Own Address Enable */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_OAR_OAREN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable OAR address */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_OAR_OAREN_ENABLE ((uint32_t)0x00004000U)         /* !< Enable OAR address */
/* M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_OAR[MODE] Bits */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_OAR_MODE_OFS (15)                            /* !< MODE Offset */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_OAR_MODE_MASK ((uint32_t)0x00008000U)         /* !< This bit selects the adressing mode
                                                                                    to be used. When 0, 7-bit addressing
                                                                                    is used. When 1, 10-bit addressing is
                                                                                    used. */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_OAR_MODE_MODE7 ((uint32_t)0x00000000U)         /* !< Enable 7-bit addressing */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_OAR_MODE_MODE10 ((uint32_t)0x00008000U)         /* !< Enable 10-bit addressing */

/* M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TIMEOUT_CNT Bits */
/* M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TIMEOUT_CNT[TCNTA] Bits */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TIMEOUT_CNT_TCNTA_OFS (0)                             /* !< TCNTA Offset */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TIMEOUT_CNT_TCNTA_MASK ((uint32_t)0x000000FFU)         /* !< Timeout Count A Current Count: This
                                                                                    field contains the upper 8 bits of a
                                                                                    12-bit current counter for timeout
                                                                                    counter A */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TIMEOUT_CNT_TCNTA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest Value */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TIMEOUT_CNT_TCNTA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TIMEOUT_CTL Bits */
/* M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TIMEOUT_CTL[TCNTLA] Bits */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_OFS (0)                             /* !< TCNTLA Offset */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_MASK ((uint32_t)0x000000FFU)         /* !< Timeout counter A load value
                                                                                    Counter A is used for SCL low
                                                                                    detection. This field contains the
                                                                                    upper 8 bits of a 12-bit pre-load
                                                                                    value for the Timeout A count. NOTE:
                                                                                    The value of CNTLA must be greater
                                                                                    than 1h.  Each count is equal to 520
                                                                                    times the timeout period of
                                                                                    functional clock. For example, with
                                                                                    8MHz functional clock and a 100KHz
                                                                                    operating I2C clock, one timeout
                                                                                    period will be equal to (1 / 8MHz) *
                                                                                    520 or 65 us. */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest Value */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TIMEOUT_CTL[TCNTAEN] Bits */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_OFS (15)                            /* !< TCNTAEN Offset */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_MASK ((uint32_t)0x00008000U)         /* !< Timeout Counter A Enable */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Timeout Counter B */
#define M33C1SPGSS2_UC2_I2CT_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_ENABLE ((uint32_t)0x00008000U)         /* !< Enable Timeout Counter B */

/* M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG0_IMASK Bits */
/* M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG0_IMASK[TXTRG] Bits */
#define M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG0_IMASK_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG0_IMASK_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG0_IMASK_TXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG0_IMASK_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG0_RIS Bits */
/* M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG0_RIS[TXTRG] Bits */
#define M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG0_RIS_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG0_RIS_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG0_RIS_TXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG0_RIS_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG0_MIS Bits */
/* M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG0_MIS[TXTRG] Bits */
#define M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG0_MIS_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG0_MIS_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG0_MIS_TXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC2_I2CT_IPSTANDARD_DMA_TRIG0_MIS_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

