TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC1_I2CT_IPSPECIFIC_TIMEOUT_CTL Bits */
/* M33C1SPGSS2_UC1_I2CT_IPSPECIFIC_TIMEOUT_CTL[TCNTLA] Bits */
#define M33C1SPGSS2_UC1_I2CT_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_OFS (0)                             /* !< TCNTLA Offset */
#define M33C1SPGSS2_UC1_I2CT_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_MASK ((uint32_t)0x000000FFU)         /* !< Timeout counter A load value
                                                                                    Counter A is used for SCL low
                                                                                    detection. This field contains the
                                                                                    upper 8 bits of a 12-bit pre-load
                                                                                    value for the Timeout A count. NOTE:
                                                                                    The value of CNTLA must be greater
                                                                                    than 1h.  Each count is equal to 520
                                                                                    times the timeout period of
                                                                                    functional clock. For example, with
                                                                                    8MHz functional clock and a 100KHz
                                                                                    operating I2C clock, one timeout
                                                                                    period will be equal to (1 / 8MHz) *
                                                                                    520 or 65 us. */
#define M33C1SPGSS2_UC1_I2CT_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest Value */
#define M33C1SPGSS2_UC1_I2CT_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* M33C1SPGSS2_UC1_I2CT_IPSPECIFIC_TIMEOUT_CTL[TCNTAEN] Bits */
#define M33C1SPGSS2_UC1_I2CT_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_OFS (15)                            /* !< TCNTAEN Offset */
#define M33C1SPGSS2_UC1_I2CT_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_MASK ((uint32_t)0x00008000U)         /* !< Timeout Counter A Enable */
#define M33C1SPGSS2_UC1_I2CT_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Timeout Counter B */
#define M33C1SPGSS2_UC1_I2CT_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_ENABLE ((uint32_t)0x00008000U)         /* !< Enable Timeout Counter B */

/* M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_IMASK Bits */
/* M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_IMASK[TXTRG] Bits */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_IMASK_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_IMASK_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_IMASK_TXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_IMASK_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_RIS Bits */
/* M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_RIS[TXTRG] Bits */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_RIS_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_RIS_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_RIS_TXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_RIS_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_MIS Bits */
/* M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_MIS[TXTRG] Bits */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_MIS_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_MIS_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_MIS_TXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_MIS_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_ISET Bits */
/* M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_ISET[TXTRG] Bits */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_ISET_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_ISET_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_ISET_TXTRG_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG0_ISET_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_IMASK Bits */
/* M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_IMASK[RXTRG] Bits */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_IMASK_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_IMASK_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_IMASK_RXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_IMASK_RXTRG_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_RIS Bits */
/* M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_RIS[RXTRG] Bits */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_RIS_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_RIS_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_RIS_RXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_RIS_RXTRG_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_MIS Bits */
/* M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_MIS[RXTRG] Bits */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_MIS_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_MIS_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_MIS_RXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_MIS_RXTRG_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_ISET Bits */
/* M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_ISET[RXTRG] Bits */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_ISET_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_ISET_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_ISET_RXTRG_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_DMA_TRIG1_ISET_RXTRG_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX Bits */
/* M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX[STAT] Bits */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX_STAT_OFS (0)                             /* !< STAT Offset */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX_STAT_MASK ((uint32_t)0x000000FFU)         /* !< I2C Module Interrupt Vector Value.
                                                                                    This register provides the highes
                                                                                    priority interrupt index. A read
                                                                                    clears the corresponding interrupt
                                                                                    flag in RIS and MISC. 15h-1Fh =
                                                                                    Reserved */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX_STAT_NO_INTR ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX_STAT_RXDONEFG ((uint32_t)0x00000001U)         /* !< Receive Done Flag */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX_STAT_TXDONEFG ((uint32_t)0x00000002U)         /* !< Transmit Done Flag */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX_STAT_RXTRG ((uint32_t)0x00000003U)         /* !< receive FIFO Trigger Level */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX_STAT_TXTRG ((uint32_t)0x00000004U)         /* !< transmit FIFO Trigger level */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX_STAT_RXFULL ((uint32_t)0x00000005U)         /* !< RX FIFO FULL Event/interrupt
                                                                                    pending */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX_STAT_TXEMPTY ((uint32_t)0x00000006U)         /* !< Transmit FIFO/Buffer Empty
                                                                                    Event/interrupt pending */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX_STAT_TX_UNFL ((uint32_t)0x00000007U)         /* !< Target TX FIFO underflow */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX_STAT_RX_OVFL ((uint32_t)0x00000008U)         /* !< Target RX FIFO overflow event */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX_STAT_GENCALL ((uint32_t)0x00000009U)         /* !< General Call Event */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX_STAT_STARTFG ((uint32_t)0x0000000AU)         /* !< Start Event */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX_STAT_STOPFG ((uint32_t)0x0000000BU)         /* !< Stop Event */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX_STAT_PEC_RX_ERR ((uint32_t)0x0000000CU)         /* !< PEC receive error event */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX_STAT_TIMEOUTA ((uint32_t)0x0000000DU)         /* !< Timeout A Event */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX_STAT_TIMEOUTB ((uint32_t)0x0000000EU)         /* !< Timeout B Event */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX_STAT_DMA_DONE_RX ((uint32_t)0x00000010U)         /* !< DMA DONE on Channel RX */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX_STAT_DMA_DONE_TX ((uint32_t)0x00000011U)         /* !< DMA DONE on Channel TX */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX_STAT_ARBLOSTFG ((uint32_t)0x00000012U)         /* !< Arbitration Lost */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX_STAT_DMA_PREIRQ_RX ((uint32_t)0x00000013U)         /* !< DMA PRE IRQ INTERRUPT */
#define M33C1SPGSS2_UC1_I2CT_IPSTANDARD_IIDX_STAT_DMA_PREIRQ_TX ((uint32_t)0x00000014U)         /* !< DMA PRE IRQ INTERRUPT */

