TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR Bits */
/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR[RREQ] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_RREQ_OFS (0)                             /* !< RREQ Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_RREQ_MASK ((uint32_t)0x00000001U)         /* !< Receive Request */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_RREQ_CLEARED ((uint32_t)0x00000000U)         /* !< No outstanding receive data. */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_RREQ_SET ((uint32_t)0x00000001U)         /* !< Module has outstanding receive data
                                                                                    and is using clock stretching to
                                                                                    delay the Controller until the data
                                                                                    has been read from the RXDATA FIFO
                                                                                    (RX FIFO is full). */
/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR[TREQ] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_TREQ_OFS (1)                             /* !< TREQ Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_TREQ_MASK ((uint32_t)0x00000002U)         /* !< Transmit Request */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_TREQ_CLEARED ((uint32_t)0x00000000U)         /* !< No outstanding transmit request. */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_TREQ_SET ((uint32_t)0x00000002U)         /* !< I2C Target is addressed as a
                                                                                    transmitter and is using clock
                                                                                    stretching to delay the Controller
                                                                                    until data has been written to the
                                                                                    TXDATA FIFO (TX FIFO is empty). */
/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR[RXMODE] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_RXMODE_OFS (2)                             /* !< RXMODE Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_RXMODE_MASK ((uint32_t)0x00000004U)         /* !< Target FSM is in Rx MODE */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_RXMODE_CLEARED ((uint32_t)0x00000000U)         /* !< The Target State Machine is not in
                                                                                    the RX_DATA, RX_ACK, RX_WAIT,
                                                                                    RX_ACK_WAIT or ADDR_ACK state with
                                                                                    the bus direction set to write. */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_RXMODE_SET ((uint32_t)0x00000004U)         /* !< The Target State Machine is in the
                                                                                    RX_DATA, RX_ACK, RX_WAIT, RX_ACK_WAIT
                                                                                    or ADDR_ACK state with the bus
                                                                                    direction set to write. */
/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR[BUSBSY] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_BUSBSY_OFS (6)                             /* !< BUSBSY Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_BUSBSY_MASK ((uint32_t)0x00000040U)         /* !< I2C bus is busy */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_BUSBSY_CLEARED ((uint32_t)0x00000000U)         /* !< The I2C Bus is not busy */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_BUSBSY_SET ((uint32_t)0x00000040U)         /* !< The I2C Bus is busy. This is
                                                                                    cleared on a timeout. */
/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR[TXMODE] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_TXMODE_OFS (7)                             /* !< TXMODE Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_TXMODE_MASK ((uint32_t)0x00000080U)         /* !< FSM is in TX MODE */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_TXMODE_CLEARED ((uint32_t)0x00000000U)         /* !< State Machine is not in TX_DATA,
                                                                                    TX_WAIT, TX_ACK  or ADDR_ACK state
                                                                                    with the bus direction set to read. */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_TXMODE_SET ((uint32_t)0x00000080U)         /* !< State Machine is in TX_DATA,
                                                                                    TX_WAIT, TX_ACK  or ADDR_ACK state
                                                                                    with the bus direction set to read. */
/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR[STALE_TXFIFO] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_STALE_TXFIFO_OFS (8)                             /* !< STALE_TXFIFO Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_STALE_TXFIFO_MASK ((uint32_t)0x00000100U)         /* !< Stale Tx FIFO */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_STALE_TXFIFO_CLEARED ((uint32_t)0x00000000U)         /* !< Tx FIFO is not stale */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_STALE_TXFIFO_SET ((uint32_t)0x00000100U)         /* !< The TX FIFO is stale. This occurs
                                                                                    when the TX FIFO was not emptied
                                                                                    during the previous I2C transaction. */
/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR[ADDRMATCH] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_ADDRMATCH_OFS (16)                            /* !< ADDRMATCH Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_ADDRMATCH_MASK ((uint32_t)0x03FF0000U)         /* !< Indicates the address for which
                                                                                    Target address match happened */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_ADDRMATCH_MINIMUM ((uint32_t)0x00000000U)         /* !< Minimum Value */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_ADDRMATCH_MAXIMUM ((uint32_t)0x03FF0000U)         /* !< Maximum Value */
/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR[RXCLR] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_RXCLR_OFS (9)                             /* !< RXCLR Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_RXCLR_MASK ((uint32_t)0x00000200U)         /* !< RX FIFO Clear Status */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_RXCLR_CLEARED ((uint32_t)0x00000000U)         /* !< FIFO is not cleared */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_RXCLR_SET ((uint32_t)0x00000200U)         /* !< FIFO clear is complete */
/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR[TXCLR] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_TXCLR_OFS (10)                            /* !< TXCLR Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_TXCLR_MASK ((uint32_t)0x00000400U)         /* !< TX FIFO Clear Status */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_TXCLR_CLEARED ((uint32_t)0x00000000U)         /* !< FIFO is not cleared */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_TXCLR_SET ((uint32_t)0x00000400U)         /* !< FIFO clear is complete */
/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR[RXFE] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_RXFE_OFS (11)                            /* !< RXFE Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_RXFE_MASK ((uint32_t)0x00000800U)         /* !< Receive FIFO Empty  The meaning of
                                                                                    this bit depends on the state of the
                                                                                    FEN bit in the CTL0 register. */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_RXFE_CLEARED ((uint32_t)0x00000000U)         /* !< The receiver is not empty. */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_RXFE_SET ((uint32_t)0x00000800U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the receive holding register is
                                                                                    empty. If the FIFO is enabled (FEN is
                                                                                    1), the receive FIFO is empty. */
/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR[RXFF] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_RXFF_OFS (12)                            /* !< RXFF Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_RXFF_MASK ((uint32_t)0x00001000U)         /* !< Receive FIFO Full  The meaning of
                                                                                    this bit depends on the state of the
                                                                                    FEN bit in the CTL0 register. */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_RXFF_CLEARED ((uint32_t)0x00000000U)         /* !< The receiver can receive data. */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_RXFF_SET ((uint32_t)0x00001000U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the receive holding register is full.
                                                                                    If the FIFO is enabled (FEN is 1),
                                                                                    the receive FIFO is full. */
/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR[TXFE] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_TXFE_OFS (13)                            /* !< TXFE Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_TXFE_MASK ((uint32_t)0x00002000U)         /* !< Transmit FIFO Empty  The meaning of
                                                                                    this bit depends on the state of the
                                                                                    FEN bit in the CTL0 register. */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_TXFE_CLEARED ((uint32_t)0x00000000U)         /* !< The transmitter has data to
                                                                                    transmit. */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_TXFE_SET ((uint32_t)0x00002000U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the transmit holding register is
                                                                                    empty. If the FIFO is enabled (FEN is
                                                                                    1), the transmit FIFO is empty. */
/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR[TXFF] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_TXFF_OFS (14)                            /* !< TXFF Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_TXFF_MASK ((uint32_t)0x00004000U)         /* !< Transmit FIFO Full  The meaning of
                                                                                    this bit depends on the state of the
                                                                                    FEN bit in the CTL0 register. */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_TXFF_CLEARED ((uint32_t)0x00000000U)         /* !< The transmitter is not full. */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_TXFF_SET ((uint32_t)0x00004000U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the transmit holding register is
                                                                                    full. If the FIFO is enabled (FEN is
                                                                                    1), the transmit FIFO is full. */
/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR[ACKOEN] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_ACKOEN_OFS (15)                            /* !< ACKOEN Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_ACKOEN_MASK ((uint32_t)0x00008000U)         /* !< Status of ACK Override Enable */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_ACKOEN_DISABLE ((uint32_t)0x00000000U)         /* !< ACK override is disabled */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_SR_ACKOEN_ENABLE ((uint32_t)0x00008000U)         /* !< ACK override was enabled in design */

/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS Bits */
/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS[TXIFLSEL] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_TXIFLSEL_OFS (0)                             /* !< TXIFLSEL Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_TXIFLSEL_MASK ((uint32_t)0x00000007U)         /* !< FIFO Level Select for generating
                                                                                    events (interrupt/dma).  Note: for
                                                                                    undefined settings the default
                                                                                    configuration is used. */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_TXIFLSEL_LVL_3_4 ((uint32_t)0x00000001U)         /* !< TX FIFO <= 3/4 empty */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_TXIFLSEL_LVL_1_2 ((uint32_t)0x00000002U)         /* !< TX FIFO <= 1/2 empty (default) */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_TXIFLSEL_LVL_1_4 ((uint32_t)0x00000003U)         /* !< TX FIFO <= 1/4 empty */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_TXIFLSEL_LVL_NOT_FULL ((uint32_t)0x00000004U)         /* !< Opposite of full */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_TXIFLSEL_LVL_EMPTY ((uint32_t)0x00000005U)         /* !< TX FIFO is empty */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_TXIFLSEL_LVL_ALMOST_EMPTY ((uint32_t)0x00000006U)         /* !< TX FIFO <= 1 */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_TXIFLSEL_LVL_ALMOST_FULL ((uint32_t)0x00000007U)         /* !< TX_FIFO >= (MAX_FIFO_LEN -1) */
/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS[RXIFLSEL] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_RXIFLSEL_OFS (4)                             /* !< RXIFLSEL Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_RXIFLSEL_MASK ((uint32_t)0x00000070U)         /* !< FIFO Level Select for generating
                                                                                    events (interrupt/dma).  Note: for
                                                                                    undefined settings the default
                                                                                    configuration is used. */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_RXIFLSEL_LVL_1_4 ((uint32_t)0x00000010U)         /* !< RX FIFO >= 1/4 full */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_RXIFLSEL_LVL_1_2 ((uint32_t)0x00000020U)         /* !< RX FIFO >= 1/2 full (default) */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_RXIFLSEL_LVL_3_4 ((uint32_t)0x00000030U)         /* !< RX FIFO >= 3/4 full */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_RXIFLSEL_LVL_NOT_EMPTY ((uint32_t)0x00000040U)         /* !< Opposite of empty */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_RXIFLSEL_LVL_FULL ((uint32_t)0x00000050U)         /* !< RX FIFO is full */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_RXIFLSEL_LVL_ALMOST_FULL ((uint32_t)0x00000060U)         /* !< RX_FIFO >= (MAX_FIFO_LEN -1) */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_RXIFLSEL_LVL_ALMOST_EMPTY ((uint32_t)0x00000070U)         /* !< RX_FIFO <= 1 */
/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS[TXCLR] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_TXCLR_OFS (3)                             /* !< TXCLR Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_TXCLR_MASK ((uint32_t)0x00000008U)         /* !< TX FIFO CLEAR. Setting this bit
                                                                                    will clear the TX FIFO contents. */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_TXCLR_DISABLE ((uint32_t)0x00000000U)         /* !< Disable FIFO clear */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_TXCLR_ENABLE ((uint32_t)0x00000008U)         /* !< Enable FIFO Clear */
/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS[RXCLR] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_RXCLR_OFS (7)                             /* !< RXCLR Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_RXCLR_MASK ((uint32_t)0x00000080U)         /* !< RX FIFO CLEAR. Setting this bit
                                                                                    will clear the RX FIFO contents. */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_RXCLR_DISABLE ((uint32_t)0x00000000U)         /* !< Disable FIFO clear */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_IFLS_RXCLR_ENABLE ((uint32_t)0x00000080U)         /* !< Enable FIFO Clear */

/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_GFCTL Bits */
/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_GFCTL[DGFSEL] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_GFCTL_DGFSEL_OFS (0)                             /* !< DGFSEL Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_GFCTL_DGFSEL_MASK ((uint32_t)0x00000007U)         /* !< Glitch Suppression Pulse Width This
                                                                                    field controls the pulse width select
                                                                                    for glitch suppression on the SCL and
                                                                                    SDA lines. The following values are
                                                                                    the glitch suppression values in
                                                                                    terms of functional clocks. (Core
                                                                                    Domain only) */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_GFCTL_DGFSEL_DISABLED ((uint32_t)0x00000000U)         /* !< Bypass */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_GFCTL_DGFSEL_CLK_1 ((uint32_t)0x00000001U)         /* !< 1 clock */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_GFCTL_DGFSEL_CLK_2 ((uint32_t)0x00000002U)         /* !< 2 clocks */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_GFCTL_DGFSEL_CLK_3 ((uint32_t)0x00000003U)         /* !< 3 clocks */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_GFCTL_DGFSEL_CLK_4 ((uint32_t)0x00000004U)         /* !< 4 clocks */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_GFCTL_DGFSEL_CLK_8 ((uint32_t)0x00000005U)         /* !< 8 clocks */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_GFCTL_DGFSEL_CLK_16 ((uint32_t)0x00000006U)         /* !< 16 clocks */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_GFCTL_DGFSEL_CLK_31 ((uint32_t)0x00000007U)         /* !< 31 clocks */

/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_TTXDATA Bits */
/* M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_TTXDATA[DATA] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_TTXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_TTXDATA_DATA_MASK ((uint32_t)0x000000FFU)         /* !< Transmit Data This byte contains
                                                                                    the data to be transferred during the
                                                                                    next transaction. */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_TTXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC0_I2CT_IPSPECIFIC_TTXDATA_DATA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

