TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS Bits */
/* M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS[RXDONE] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_RXDONE_OFS (0)                             /* !< RXDONE Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_RXDONE_MASK ((uint32_t)0x00000001U)         /* !< Receive Done Interrupt: Set after a
                                                                                    byte is received */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_RXDONE_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_RXDONE_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS[TXDONE] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_TXDONE_OFS (1)                             /* !< TXDONE Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_TXDONE_MASK ((uint32_t)0x00000002U)         /* !< Transmission Done Interrupt: Set
                                                                                    after a byte is transmitted */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_TXDONE_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_TXDONE_SET ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS[GENCALL] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_GENCALL_OFS (8)                             /* !< GENCALL Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_GENCALL_MASK ((uint32_t)0x00000100U)         /* !< General Call Interrupt: set when a
                                                                                    general call is received */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_GENCALL_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_GENCALL_SET ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS[RXTRG] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger 				    When FIFO
                                                                                    is present, triggered as per IFLS
                                                                                    settings 				    when FIFO is not
                                                                                    present, this indicates when buffer
                                                                                    is full */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_RXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_RXTRG_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS[TXTRG] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger     When FIFO is
                                                                                    present, triggered as per IFLS
                                                                                    settings
                                                                                    When FIFO is not present, trigger
                                                                                    when transmit buffer is empty */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_TXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS[START] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_START_OFS (9)                             /* !< START Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_START_MASK ((uint32_t)0x00000200U)         /* !< Start Condition Interrupt: is set
                                                                                    after a START condition is received
                                                                                    and this target is addressed */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_START_CLR ((uint32_t)0x00000000U)         /* !< Clear interrupt */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_START_SET ((uint32_t)0x00000200U)         /* !< Set when a START condition is
                                                                                    receivied and address matches
                                                                                    target's address */
/* M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS[STOP] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_STOP_OFS (10)                            /* !< STOP Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_STOP_MASK ((uint32_t)0x00000400U)         /* !< Stop Condition Interrupt: set on a
                                                                                    STOP condition if this target was
                                                                                    being addressed */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_STOP_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_STOP_SET ((uint32_t)0x00000400U)         /* !< Interrupt is set when target is
                                                                                    addressed and STOP condition is
                                                                                    received */
/* M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS[DMA_DONE_TX] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< DMA Done on Event Channel TX */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_DMA_DONE_TX_CLR ((uint32_t)0x00000000U)         /* !< Clear interrupt */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_DMA_DONE_TX_SET ((uint32_t)0x00010000U)         /* !< Set interrupt */
/* M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS[DMA_DONE_RX] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< DMA Done on Event Channel RX */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_DMA_DONE_RX_CLR ((uint32_t)0x00000000U)         /* !< Clear interrupt */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_DMA_DONE_RX_SET ((uint32_t)0x00008000U)         /* !< Set interrupt */
/* M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS[TIMEOUTA] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_TIMEOUTA_OFS (12)                            /* !< TIMEOUTA Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_TIMEOUTA_MASK ((uint32_t)0x00001000U)         /* !< Timeout A Interrupt */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_TIMEOUTA_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_TIMEOUTA_SET ((uint32_t)0x00001000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS[RXFULL] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_RXFULL_OFS (4)                             /* !< RXFULL Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_RXFULL_MASK ((uint32_t)0x00000010U)         /* !< RXFIFO full event. This interrupt
                                                                                    is set if an RX FIFO is full. */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_RXFULL_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_RXFULL_SET ((uint32_t)0x00000010U)         /* !< Interrupt occured */
/* M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS[TXEMPTY] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_TXEMPTY_OFS (5)                             /* !< TXEMPTY Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_TXEMPTY_MASK ((uint32_t)0x00000020U)         /* !< Transmit FIFO Empty Interrupt. This
                                                                                    interrupt is set if all data in the
                                                                                    Transmit FIFO have been shifted out
                                                                                    and FSM goes into idle mode. */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_TXEMPTY_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_TXEMPTY_SET ((uint32_t)0x00000020U)         /* !< Interrupt occured */
/* M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS[TX_UNFL] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_TX_UNFL_OFS (6)                             /* !< TX_UNFL Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_TX_UNFL_MASK ((uint32_t)0x00000040U)         /* !< Transmit FIFO underflow */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_TX_UNFL_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_TX_UNFL_SET ((uint32_t)0x00000040U)         /* !< Interrupt occured */
/* M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS[RX_OVFL] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_RX_OVFL_OFS (7)                             /* !< RX_OVFL Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_RX_OVFL_MASK ((uint32_t)0x00000080U)         /* !< Receive FIFO overflow */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_RX_OVFL_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_CPU_INT_RIS_RX_OVFL_SET ((uint32_t)0x00000080U)         /* !< Interrupt Occured */

