TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC0_I2CT_IPSTANDARD_PDBGCTL Bits */
/* M33C1SPGSS2_UC0_I2CT_IPSTANDARD_PDBGCTL[FREE] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_PDBGCTL_FREE_OFS (0)                             /* !< FREE Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_PDBGCTL_FREE_MASK ((uint32_t)0x00000001U)         /* !< Free run control */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_PDBGCTL_FREE_STOP ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_PDBGCTL_FREE_RUN ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */
/* M33C1SPGSS2_UC0_I2CT_IPSTANDARD_PDBGCTL[SOFT] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_PDBGCTL_SOFT_OFS (1)                             /* !< SOFT Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_PDBGCTL_SOFT_MASK ((uint32_t)0x00000002U)         /* !< Soft halt boundary control. This
                                                                                    function is only available, if [FREE]
                                                                                    is set to 'STOP' */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_PDBGCTL_SOFT_DEPRECATED ((uint32_t)0x00000000U)         /* !< Not supported */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_PDBGCTL_SOFT_DELAYED ((uint32_t)0x00000002U)         /* !< The peripheral blocks the debug
                                                                                    freeze until it has reached a
                                                                                    boundary where it can resume without
                                                                                    corruption */

/* M33C1SPGSS2_UC0_I2CT_IPSTANDARD_INTCTL Bits */
/* M33C1SPGSS2_UC0_I2CT_IPSTANDARD_INTCTL[INTEVAL] Bits */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_INTCTL_INTEVAL_OFS (0)                             /* !< INTEVAL Offset */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_INTCTL_INTEVAL_MASK ((uint32_t)0x00000001U)         /* !< Writing a 1 to this field
                                                                                    re-evaluates the interrupt sources. */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_INTCTL_INTEVAL_DISABLE ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define M33C1SPGSS2_UC0_I2CT_IPSTANDARD_INTCTL_INTEVAL_EVAL ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */

/* M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST0 Bits */
/* M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST0[DTB_MUX_SEL] Bits */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_OFS (0)                             /* !< DTB_MUX_SEL Offset */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_MASK ((uint32_t)0x0000001FU)         /* !< This bit field is used to select
                                                                                    DTB mux digital output signals. */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Disables DTB MUX */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP1 ((uint32_t)0x00000001U)         /* !< Selects test group 1 */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP2 ((uint32_t)0x00000002U)         /* !< Selects test group 2 */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP3 ((uint32_t)0x00000003U)         /* !< Selects test group 3 */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP4 ((uint32_t)0x00000004U)         /* !< Selects test group 4 */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP5 ((uint32_t)0x00000005U)         /* !< Selects test group 5 */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP6 ((uint32_t)0x00000006U)         /* !< Selects test group 6 */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP7 ((uint32_t)0x00000007U)         /* !< Selects test group 7 */

/* M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST1 Bits */
/* M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST1[SCL_TRIM_EN] Bits */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST1_SCL_TRIM_EN_OFS (0)                             /* !< SCL_TRIM_EN Offset */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST1_SCL_TRIM_EN_MASK ((uint32_t)0x00000001U)         /* !< Analog glitch filter trimming
                                                                                    enable for SCL */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST1_SCL_TRIM_EN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Trim for SCL */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST1_SCL_TRIM_EN_ENABLE ((uint32_t)0x00000001U)         /* !< Enable Trim for SCL */
/* M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST1[SDA_TRIM_EN] Bits */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST1_SDA_TRIM_EN_OFS (1)                             /* !< SDA_TRIM_EN Offset */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST1_SDA_TRIM_EN_MASK ((uint32_t)0x00000002U)         /* !< Analog glitch filter trimming
                                                                                    enable for SDA */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST1_SDA_TRIM_EN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Trim for SDA */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST1_SDA_TRIM_EN_ENABLE ((uint32_t)0x00000002U)         /* !< Enable Trim for SDA */
/* M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST1[TRIM_SEL] Bits */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST1_TRIM_SEL_OFS (2)                             /* !< TRIM_SEL Offset */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST1_TRIM_SEL_MASK ((uint32_t)0x00000004U)         /* !< Select for which branch to trim */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST1_TRIM_SEL_FALLING_EDGE ((uint32_t)0x00000000U)         /* !< Select Trim on falling edge */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST1_TRIM_SEL_RISING_EDGE ((uint32_t)0x00000004U)         /* !< Select Trim on rising edge */
/* M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST1[AGFTEST] Bits */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST1_AGFTEST_OFS (8)                             /* !< AGFTEST Offset */
#define M33C1SPGSS2_UC3_I2CC_LMGMT_DFT_ATRT_TEST1_AGFTEST_MASK ((uint32_t)0x00000100U)

