TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_BMON Bits */
/* M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_BMON[SCL] Bits */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_BMON_SCL_OFS (0)                             /* !< SCL Offset */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_BMON_SCL_MASK ((uint32_t)0x00000001U)         /* !< I2C SCL Status */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_BMON_SCL_CLEARED ((uint32_t)0x00000000U)         /* !< The I2CSCL signal is low. */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_BMON_SCL_SET ((uint32_t)0x00000001U)         /* !< The I2CSCL signal is high. Note:
                                                                                    During and right after reset, the SCL
                                                                                    pin is in GPIO input mode without the
                                                                                    internal pull enabled. For proper I2C
                                                                                    operation, the user should have the
                                                                                    external pull-up resistor in place
                                                                                    before starting any I2C operations. */
/* M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_BMON[SDA] Bits */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_BMON_SDA_OFS (1)                             /* !< SDA Offset */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_BMON_SDA_MASK ((uint32_t)0x00000002U)         /* !< I2C SDA Status */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_BMON_SDA_CLEARED ((uint32_t)0x00000000U)         /* !< The I2CSDA signal is low. */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_BMON_SDA_SET ((uint32_t)0x00000002U)         /* !< The I2CSDA signal is high. Note:
                                                                                    During and right after reset, the SDA
                                                                                    pin is in GPIO input mode without the
                                                                                    internal pull enabled. For proper I2C
                                                                                    operation, the user should have the
                                                                                    external pull-up resistor in place
                                                                                    before starting any I2C operations. */

/* M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_TXDATA Bits */
/* M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_TXDATA[DATA] Bits */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_TXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_TXDATA_DATA_MASK ((uint32_t)0x000000FFU)         /* !< Transmit Data This byte contains
                                                                                    the data to be transferred during the
                                                                                    next transaction. */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_TXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_TXDATA_DATA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_RXDATA Bits */
/* M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_RXDATA[DATA] Bits */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_RXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_RXDATA_DATA_MASK ((uint32_t)0x000000FFU)         /* !< Received Data.  This field contains
                                                                                    the last received data. */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_RXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_RXDATA_DATA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_PECSR Bits */
/* M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_PECSR[PECBYTECNT] Bits */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_PECSR_PECBYTECNT_OFS (0)                             /* !< PECBYTECNT Offset */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_PECSR_PECBYTECNT_MASK ((uint32_t)0x000001FFU)         /* !< PEC Byte Count	 This is the current
                                                                                    PEC Byte Count of the Controller
                                                                                    State Machine. */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_PECSR_PECBYTECNT_MINIMUM ((uint32_t)0x00000000U)         /* !< Minimum Value */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_PECSR_PECBYTECNT_MAXIMUM ((uint32_t)0x000001FFU)         /* !< Maximum Value */
/* M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_PECSR[PECSTS_CHECK] Bits */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_PECSR_PECSTS_CHECK_OFS (16)                            /* !< PECSTS_CHECK Offset */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_PECSR_PECSTS_CHECK_MASK ((uint32_t)0x00010000U)         /* !< This status bit indicates if the
                                                                                    PEC was checked in the transaction
                                                                                    that occurred before the last Stop.
                                                                                    Latched on Stop. */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_PECSR_PECSTS_CHECK_CLEARED ((uint32_t)0x00000000U)         /* !< Indicates PEC was not checked in
                                                                                    the transaction that occurred before
                                                                                    the last Stop */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_PECSR_PECSTS_CHECK_SET ((uint32_t)0x00010000U)         /* !< Indicates if the PEC was checked in
                                                                                    the transaction that occurred before
                                                                                    the last Stop */
/* M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_PECSR[PECSTS_ERROR] Bits */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_PECSR_PECSTS_ERROR_OFS (17)                            /* !< PECSTS_ERROR Offset */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_PECSR_PECSTS_ERROR_MASK ((uint32_t)0x00020000U)         /* !< This status bit indicates if a PEC
                                                                                    check error occurred in the
                                                                                    transaction that occurred before the
                                                                                    last Stop. Latched on Stop. */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_PECSR_PECSTS_ERROR_CLEARED ((uint32_t)0x00000000U)         /* !< Indicates PEC check error did not
                                                                                    occurr in the transaction that
                                                                                    occurred before the last Stop */
#define M33C1SPGSS2_UC3_I2CC_IPSPECIFIC_PECSR_PECSTS_ERROR_SET ((uint32_t)0x00020000U)         /* !< Indicates if a PEC check error
                                                                                    occurred in the transaction that
                                                                                    occurred before the last Stop */

