TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR Bits */
/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR[FRM_START] Bits */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_FRM_START_OFS (0)                             /* !< FRM_START Offset */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_FRM_START_MASK ((uint32_t)0x00000001U)         /* !< Start Transfer */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_FRM_START_DISABLE ((uint32_t)0x00000000U)         /* !< In standard mode, this encoding
                                                                                    means the Controller is unable to
                                                                                    transmit or receive data. */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_FRM_START_ENABLE ((uint32_t)0x00000001U)         /* !< The Controller is able to transmit
                                                                                    or receive data. See field decoding
                                                                                    in Table: MCTR Field decoding. */
/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR[START] Bits */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_START_OFS (1)                             /* !< START Offset */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_START_MASK ((uint32_t)0x00000002U)         /* !< Generate START */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_START_DISABLE ((uint32_t)0x00000000U)         /* !< The controller does not generate
                                                                                    the START condition. */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_START_ENABLE ((uint32_t)0x00000002U)         /* !< The controller generates the START
                                                                                    or repeated START condition. See
                                                                                    field decoding in Table: MCTR Field
                                                                                    decoding. */
/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR[STOP] Bits */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_STOP_OFS (2)                             /* !< STOP Offset */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_STOP_MASK ((uint32_t)0x00000004U)         /* !< Generate STOP */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_STOP_DISABLE ((uint32_t)0x00000000U)         /* !< The controller does not generate
                                                                                    the STOP condition. */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_STOP_ENABLE ((uint32_t)0x00000004U)         /* !< The controller generates the STOP
                                                                                    condition. See field decoding in
                                                                                    Table: MCTR Field decoding. */
/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR[ACK] Bits */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_ACK_OFS (3)                             /* !< ACK Offset */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_ACK_MASK ((uint32_t)0x00000008U)         /* !< Data Acknowledge Enable. Software
                                                                                    needs to configure this bit to send
                                                                                    the ACK or NACK. See field decoding
                                                                                    in Table: MCTR Field decoding. */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_ACK_DISABLE ((uint32_t)0x00000000U)         /* !< The last received data byte of a
                                                                                    transaction is not acknowledged
                                                                                    automatically . */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_ACK_ENABLE ((uint32_t)0x00000008U)         /* !< The last received data byte of a
                                                                                    transaction is acknowledged
                                                                                    automatically . */
/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR[ACKOEN] Bits */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_ACKOEN_OFS (4)                             /* !< ACKOEN Offset */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_ACKOEN_MASK ((uint32_t)0x00000010U)         /* !< ACK overrride Enable */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_ACKOEN_DISABLE ((uint32_t)0x00000000U)         /* !< No special behavior */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_ACKOEN_ENABLE ((uint32_t)0x00000010U)         /* !< When 1 and the Controller is
                                                                                    receiving data and the number of
                                                                                    bytes indicated in MBLEN have been
                                                                                    received, the state machine will
                                                                                    generate an rxdone interrupt and wait
                                                                                    at the start of the ACK for FW to
                                                                                    indicate if an ACK or NACK should be
                                                                                    sent. The ACK or NACK is selected by
                                                                                    writing the MCTR register and setting
                                                                                    ACK accordingly. The other fields in
                                                                                    this register can also be written at
                                                                                    this time to continue on with the
                                                                                    transaction. If a NACK is sent the
                                                                                    state machine will automatically send
                                                                                    a Stop. */
/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR[RD_ON_TXEMPTY] Bits */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_RD_ON_TXEMPTY_OFS (5)                             /* !< RD_ON_TXEMPTY Offset */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_RD_ON_TXEMPTY_MASK ((uint32_t)0x00000020U)         /* !< Read on TX Empty */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_RD_ON_TXEMPTY_DISABLE ((uint32_t)0x00000000U)         /* !< No special behavior */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_RD_ON_TXEMPTY_ENABLE ((uint32_t)0x00000020U)         /* !< When 1 the Controller will transmit
                                                                                    all bytes from the TX FIFO before
                                                                                    continuing with the programmed Burst
                                                                                    Run Read. If the DIR is not set to
                                                                                    Read in the MSA then this bit is
                                                                                    ignored. The Start must be set in the
                                                                                    MCTR for proper I2C protocol. The
                                                                                    Controller will first send the Start
                                                                                    Condition, I2C Address with R/W bit
                                                                                    set to write, before sending the
                                                                                    bytes in the TX FIFO. When the TX
                                                                                    FIFO is empty, the I2C transaction
                                                                                    will continue as programmed in MTCR
                                                                                    and MSA without sending a Stop
                                                                                    Condition. This is intended to be
                                                                                    used to perform simple I2C command
                                                                                    based reads transition that will
                                                                                    complete after initiating them
                                                                                    without having to get an interrupt to
                                                                                    turn the bus around. */
/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR[SUSPEND] Bits */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_SUSPEND_OFS (6)                             /* !< SUSPEND Offset */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_SUSPEND_MASK ((uint32_t)0x00000040U)         /* !< Suspend external communication */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_SUSPEND_DISABLE ((uint32_t)0x00000000U)         /* !< Functional mode resumed */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_CTR_SUSPEND_ENABLE ((uint32_t)0x00000040U)         /* !< External communication suspended */

