TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TPR Bits */
/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TPR[TPR] Bits */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TPR_TPR_OFS (0)                             /* !< TPR Offset */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TPR_TPR_MASK ((uint32_t)0x0000007FU)         /* !< Timer Period  This field is used in
                                                                                    the equation to configure SCL_PERIOD
                                                                                    : SCL_PERIOD = (1 + TPR ) * (SCL_LP +
                                                                                    SCL_HP ) * INT_CLK_PRD where:
                                                                                    SCL_PRD is the SCL line period (I2C
                                                                                    clock).   TPR is the Timer Period
                                                                                    register value (range of 1 to 127).
                                                                                    SCL_LP is the SCL Low period (fixed
                                                                                    at 6).   SCL_HP is the SCL High
                                                                                    period (fixed at 4).   CLK_PRD is the
                                                                                    functional clock period in ns. */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TPR_TPR_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TPR_TPR_MAXIMUM ((uint32_t)0x0000007FU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_GFCTL Bits */
/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_GFCTL[DGFSEL] Bits */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_GFCTL_DGFSEL_OFS (0)                             /* !< DGFSEL Offset */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_GFCTL_DGFSEL_MASK ((uint32_t)0x00000007U)         /* !< Glitch Suppression Pulse Width
                                                                                    This field controls the pulse width
                                                                                    select for glitch suppression on the
                                                                                    SCL and SDA lines. The following
                                                                                    values are the glitch suppression
                                                                                    values in terms of functional clocks.
                                                                                    (Core Domain only) */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_GFCTL_DGFSEL_DISABLED ((uint32_t)0x00000000U)         /* !< Bypass */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_GFCTL_DGFSEL_CLK_1 ((uint32_t)0x00000001U)         /* !< 1 clock */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_GFCTL_DGFSEL_CLK_2 ((uint32_t)0x00000002U)         /* !< 2 clocks */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_GFCTL_DGFSEL_CLK_3 ((uint32_t)0x00000003U)         /* !< 3 clocks */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_GFCTL_DGFSEL_CLK_4 ((uint32_t)0x00000004U)         /* !< 4 clocks */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_GFCTL_DGFSEL_CLK_8 ((uint32_t)0x00000005U)         /* !< 8 clocks */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_GFCTL_DGFSEL_CLK_16 ((uint32_t)0x00000006U)         /* !< 16 clocks */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_GFCTL_DGFSEL_CLK_31 ((uint32_t)0x00000007U)         /* !< 31 clocks */

/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_BMON Bits */
/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_BMON[SCL] Bits */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_BMON_SCL_OFS (0)                             /* !< SCL Offset */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_BMON_SCL_MASK ((uint32_t)0x00000001U)         /* !< I2C SCL Status */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_BMON_SCL_CLEARED ((uint32_t)0x00000000U)         /* !< The I2CSCL signal is low. */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_BMON_SCL_SET ((uint32_t)0x00000001U)         /* !< The I2CSCL signal is high. Note:
                                                                                    During and right after reset, the SCL
                                                                                    pin is in GPIO input mode without the
                                                                                    internal pull enabled. For proper I2C
                                                                                    operation, the user should have the
                                                                                    external pull-up resistor in place
                                                                                    before starting any I2C operations. */
/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_BMON[SDA] Bits */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_BMON_SDA_OFS (1)                             /* !< SDA Offset */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_BMON_SDA_MASK ((uint32_t)0x00000002U)         /* !< I2C SDA Status */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_BMON_SDA_CLEARED ((uint32_t)0x00000000U)         /* !< The I2CSDA signal is low. */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_BMON_SDA_SET ((uint32_t)0x00000002U)         /* !< The I2CSDA signal is high. Note:
                                                                                    During and right after reset, the SDA
                                                                                    pin is in GPIO input mode without the
                                                                                    internal pull enabled. For proper I2C
                                                                                    operation, the user should have the
                                                                                    external pull-up resistor in place
                                                                                    before starting any I2C operations. */

