TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TXDATA Bits */
/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TXDATA[DATA] Bits */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TXDATA_DATA_MASK ((uint32_t)0x000000FFU)         /* !< Transmit Data This byte contains
                                                                                    the data to be transferred during the
                                                                                    next transaction. */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TXDATA_DATA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_RXDATA Bits */
/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_RXDATA[DATA] Bits */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_RXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_RXDATA_DATA_MASK ((uint32_t)0x000000FFU)         /* !< Received Data.  This field contains
                                                                                    the last received data. */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_RXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_RXDATA_DATA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TA Bits */
/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TA[DIR] Bits */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TA_DIR_OFS (0)                             /* !< DIR Offset */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TA_DIR_MASK ((uint32_t)0x00000001U)         /* !< Receive/Send The DIR bit specifies
                                                                                    if the next operation is a Receive
                                                                                    (High) or Transmit (Low). 0h =
                                                                                    Transmit 1h = Receive */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TA_DIR_TRANSMIT ((uint32_t)0x00000000U)         /* !< in transmit mode. */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TA_DIR_RECEIVE ((uint32_t)0x00000001U)         /* !< is in receive mode. */
/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TA[ADDR] Bits */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TA_ADDR_OFS (1)                             /* !< ADDR Offset */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TA_ADDR_MASK ((uint32_t)0x000007FEU)         /* !< I2C Target Address This field
                                                                                    specifies bits A9 through A0 of the
                                                                                    Target address. In 7-bit addressing
                                                                                    mode as selected by MSA.MODE bit, the
                                                                                    top 3 bits are don't care */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TA_ADDR_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TA_ADDR_MAXIMUM ((uint32_t)0x000007FEU)         /* !< Highest possible value */
/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TA[MODE] Bits */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TA_MODE_OFS (15)                            /* !< MODE Offset */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TA_MODE_MASK ((uint32_t)0x00008000U)         /* !< This bit selects the adressing mode
                                                                                    to be used  When 0, 7-bit addressing
                                                                                    is used. When 1, 10-bit addressing is
                                                                                    used. */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TA_MODE_MODE7 ((uint32_t)0x00000000U)         /* !< 7-bit addressing mode */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TA_MODE_MODE10 ((uint32_t)0x00008000U)         /* !< 10-bit addressing mode */

/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TIMEOUT_CNT Bits */
/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TIMEOUT_CNT[TCNTA] Bits */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTA_OFS (0)                             /* !< TCNTA Offset */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTA_MASK ((uint32_t)0x000000FFU)         /* !< Timeout Count A Current Count: This
                                                                                    field contains the upper 8 bits of a
                                                                                    12-bit current counter for timeout
                                                                                    counter A */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest Value */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TIMEOUT_CTL Bits */
/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TIMEOUT_CTL[TCNTLA] Bits */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_OFS (0)                             /* !< TCNTLA Offset */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_MASK ((uint32_t)0x000000FFU)         /* !< Timeout counter A load value
                                                                                    Counter A is used for SCL low
                                                                                    detection. This field contains the
                                                                                    upper 8 bits of a 12-bit pre-load
                                                                                    value for the Timeout A count. NOTE:
                                                                                    The value of CNTLA must be greater
                                                                                    than 1h.  Each count is equal to 520
                                                                                    times the timeout period of
                                                                                    functional clock. For example, with
                                                                                    8MHz functional clock and a 100KHz
                                                                                    operating I2C clock, one timeout
                                                                                    period will be equal to (1 / 8MHz) *
                                                                                    520 or 65 us. */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest Value */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TIMEOUT_CTL[TCNTAEN] Bits */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_OFS (15)                            /* !< TCNTAEN Offset */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_MASK ((uint32_t)0x00008000U)         /* !< Timeout Counter A Enable */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Timeout Counter B */
#define M33C1SPGSS2_UC2_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_ENABLE ((uint32_t)0x00008000U)         /* !< Enable Timeout Counter B */

