TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR Bits */
/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR[BUSY] Bits */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_BUSY_OFS (0)                             /* !< BUSY Offset */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_BUSY_MASK ((uint32_t)0x00000001U)         /* !< FSM Busy The BUSY bit is set during
                                                                                    an ongoing transaction, so is set
                                                                                    during the transmit/receive of the
                                                                                    amount of data set in MBLEN including
                                                                                    START, RESTART, Address and STOP
                                                                                    signal generation when required for
                                                                                    the current transaction. */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_BUSY_CLEARED ((uint32_t)0x00000000U)         /* !< The controller is idle. */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_BUSY_SET ((uint32_t)0x00000001U)         /* !< The controller is busy. */
/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR[ERR] Bits */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_ERR_OFS (1)                             /* !< ERR Offset */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_ERR_MASK ((uint32_t)0x00000002U)         /* !< Error  The error can be from the
                                                                                    Target address not being acknowledged
                                                                                    or the transmit data not being
                                                                                    acknowledged. */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_ERR_CLEARED ((uint32_t)0x00000000U)         /* !< No error was detected on the last
                                                                                    operation. */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_ERR_SET ((uint32_t)0x00000002U)         /* !< An error occurred on the last
                                                                                    operation. */
/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR[ADRACK] Bits */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_ADRACK_OFS (2)                             /* !< ADRACK Offset */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_ADRACK_MASK ((uint32_t)0x00000004U)         /* !< Acknowledge Address */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_ADRACK_CLEARED ((uint32_t)0x00000000U)         /* !< The transmitted address was
                                                                                    acknowledged */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_ADRACK_SET ((uint32_t)0x00000004U)         /* !< The transmitted address was not
                                                                                    acknowledged. */
/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR[DATACK] Bits */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_DATACK_OFS (3)                             /* !< DATACK Offset */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_DATACK_MASK ((uint32_t)0x00000008U)         /* !< Acknowledge Data */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_DATACK_CLEARED ((uint32_t)0x00000000U)         /* !< The transmitted data was
                                                                                    acknowledged */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_DATACK_SET ((uint32_t)0x00000008U)         /* !< The transmitted data was not
                                                                                    acknowledged. */
/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR[ARBLST] Bits */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_ARBLST_OFS (4)                             /* !< ARBLST Offset */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_ARBLST_MASK ((uint32_t)0x00000010U)         /* !< Arbitration Lost */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_ARBLST_CLEARED ((uint32_t)0x00000000U)         /* !< The I2C controller won arbitration. */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_ARBLST_SET ((uint32_t)0x00000010U)         /* !< The I2C controller lost
                                                                                    arbitration. */
/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR[IDLE] Bits */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_IDLE_OFS (5)                             /* !< IDLE Offset */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_IDLE_MASK ((uint32_t)0x00000020U)         /* !< I2C Idle */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_IDLE_CLEARED ((uint32_t)0x00000000U)         /* !< The I2C controller is not idle. */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_IDLE_SET ((uint32_t)0x00000020U)         /* !< The I2C controller is idle. */
/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR[BUSBSY] Bits */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_BUSBSY_OFS (6)                             /* !< BUSBSY Offset */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_BUSBSY_MASK ((uint32_t)0x00000040U)         /* !< I2C Bus is Busy Controller State
                                                                                    Machine will wait until this bit to
                                                                                    be cleared before starting a
                                                                                    transaction. When first enabling the
                                                                                    Controller in multi Controller
                                                                                    environments, FW should wait for one
                                                                                    I2C clock period after setting ACTIVE
                                                                                    high before writing to the CTR
                                                                                    register to start the transaction so
                                                                                    that if SCL goes low it will trigger
                                                                                    the BUSBSY. */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_BUSBSY_CLEARED ((uint32_t)0x00000000U)         /* !< The I2C bus is idle. */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_BUSBSY_SET ((uint32_t)0x00000040U)         /* !< 'This Status bit is set on a START
                                                                                    or when SCL goes low. It is cleared
                                                                                    on a STOP,  or when a SCL high bus
                                                                                    busy timeout occurs and SCL and SDA
                                                                                    are both high. This status is cleared
                                                                                    when the ACTIVE bit is low. Note that
                                                                                    the Controller State Machine will
                                                                                    wait until this bit is cleared before
                                                                                    starting an I2C transaction. When
                                                                                    first enabling the Controller in
                                                                                    multi Controller environments, FW
                                                                                    should wait for one I2C clock period
                                                                                    after setting ACTIVE high before
                                                                                    writing to the MTCR register to start
                                                                                    the transaction so that if SCL goes
                                                                                    low it will trigger the BUSBSY. */
/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR[RXCLR] Bits */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_RXCLR_OFS (9)                             /* !< RXCLR Offset */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_RXCLR_MASK ((uint32_t)0x00000200U)         /* !< RX FIFO Clear Status */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_RXCLR_CLEARED ((uint32_t)0x00000000U)         /* !< FIFO is not cleared */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_RXCLR_SET ((uint32_t)0x00000200U)         /* !< FIFO clear is complete */
/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR[TXCLR] Bits */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_TXCLR_OFS (10)                            /* !< TXCLR Offset */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_TXCLR_MASK ((uint32_t)0x00000400U)         /* !< TX FIFO Clear Status */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_TXCLR_CLEARED ((uint32_t)0x00000000U)         /* !< FIFO is not cleared */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_TXCLR_SET ((uint32_t)0x00000400U)         /* !< FIFO clear is complete */
/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR[RXFE] Bits */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_RXFE_OFS (11)                            /* !< RXFE Offset */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_RXFE_MASK ((uint32_t)0x00000800U)         /* !< Receive FIFO Empty  The meaning of
                                                                                    this bit depends on the state of the
                                                                                    FEN bit in the CTL0 register. */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_RXFE_CLEARED ((uint32_t)0x00000000U)         /* !< The receiver is not empty. */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_RXFE_SET ((uint32_t)0x00000800U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the receive holding register is
                                                                                    empty. If the FIFO is enabled (FEN is
                                                                                    1), the receive FIFO is empty. */
/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR[RXFF] Bits */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_RXFF_OFS (12)                            /* !< RXFF Offset */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_RXFF_MASK ((uint32_t)0x00001000U)         /* !< Receive FIFO Full  The meaning of
                                                                                    this bit depends on the state of the
                                                                                    FEN bit in the CTL0 register. */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_RXFF_CLEARED ((uint32_t)0x00000000U)         /* !< The receiver can receive data. */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_RXFF_SET ((uint32_t)0x00001000U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the receive holding register is full.
                                                                                    If the FIFO is enabled (FEN is 1),
                                                                                    the receive FIFO is full. */
/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR[TXFE] Bits */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_TXFE_OFS (13)                            /* !< TXFE Offset */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_TXFE_MASK ((uint32_t)0x00002000U)         /* !< Transmit FIFO Empty  The meaning of
                                                                                    this bit depends on the state of the
                                                                                    FEN bit in the CTL0 register. */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_TXFE_CLEARED ((uint32_t)0x00000000U)         /* !< The transmitter has data to
                                                                                    transmit. */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_TXFE_SET ((uint32_t)0x00002000U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the transmit holding register is
                                                                                    empty. If the FIFO is enabled (FEN is
                                                                                    1), the transmit FIFO is empty. */
/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR[TXFF] Bits */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_TXFF_OFS (14)                            /* !< TXFF Offset */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_TXFF_MASK ((uint32_t)0x00004000U)         /* !< Transmit FIFO Full  The meaning of
                                                                                    this bit depends on the state of the
                                                                                    FEN bit in the CTL0 register. */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_TXFF_CLEARED ((uint32_t)0x00000000U)         /* !< The transmitter is not full. */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_SR_TXFF_SET ((uint32_t)0x00004000U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the transmit holding register is
                                                                                    full. If the FIFO is enabled (FEN is
                                                                                    1), the transmit FIFO is full. */

/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS Bits */
/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS[TXIFLSEL] Bits */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_TXIFLSEL_OFS (0)                             /* !< TXIFLSEL Offset */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_TXIFLSEL_MASK ((uint32_t)0x00000007U)         /* !< FIFO Level Select for generating
                                                                                    events (interrupt/dma).  Note: for
                                                                                    undefined settings the default
                                                                                    configuration is used. */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_TXIFLSEL_LVL_3_4 ((uint32_t)0x00000001U)         /* !< TX FIFO <= 3/4 empty */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_TXIFLSEL_LVL_1_2 ((uint32_t)0x00000002U)         /* !< TX FIFO <= 1/2 empty (default) */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_TXIFLSEL_LVL_1_4 ((uint32_t)0x00000003U)         /* !< TX FIFO <= 1/4 empty */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_TXIFLSEL_LVL_NOT_FULL ((uint32_t)0x00000004U)         /* !< Opposite of full */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_TXIFLSEL_LVL_EMPTY ((uint32_t)0x00000005U)         /* !< TX FIFO is empty */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_TXIFLSEL_LVL_ALMOST_EMPTY ((uint32_t)0x00000006U)         /* !< TX FIFO <= 1 */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_TXIFLSEL_LVL_ALMOST_FULL ((uint32_t)0x00000007U)         /* !< TX_FIFO >= (MAX_FIFO_LEN -1) */
/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS[RXIFLSEL] Bits */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_RXIFLSEL_OFS (4)                             /* !< RXIFLSEL Offset */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_RXIFLSEL_MASK ((uint32_t)0x00000070U)         /* !< FIFO Level Select for generating
                                                                                    events (interrupt/dma).  Note: for
                                                                                    undefined settings the default
                                                                                    configuration is used. */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_RXIFLSEL_LVL_1_4 ((uint32_t)0x00000010U)         /* !< RX FIFO >= 1/4 full */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_RXIFLSEL_LVL_1_2 ((uint32_t)0x00000020U)         /* !< RX FIFO >= 1/2 full (default) */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_RXIFLSEL_LVL_3_4 ((uint32_t)0x00000030U)         /* !< RX FIFO >= 3/4 full */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_RXIFLSEL_LVL_NOT_EMPTY ((uint32_t)0x00000040U)         /* !< Opposite of empty */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_RXIFLSEL_LVL_FULL ((uint32_t)0x00000050U)         /* !< RX FIFO is full */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_RXIFLSEL_LVL_ALMOST_FULL ((uint32_t)0x00000060U)         /* !< RX_FIFO >= (MAX_FIFO_LEN -1) */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_RXIFLSEL_LVL_ALMOST_EMPTY ((uint32_t)0x00000070U)         /* !< RX_FIFO <= 1 */
/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS[TXCLR] Bits */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_TXCLR_OFS (3)                             /* !< TXCLR Offset */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_TXCLR_MASK ((uint32_t)0x00000008U)         /* !< TX FIFO CLEAR. Setting this bit
                                                                                    will clear the TX FIFO contents. */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_TXCLR_DISABLE ((uint32_t)0x00000000U)         /* !< Disable FIFO clear */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_TXCLR_ENABLE ((uint32_t)0x00000008U)         /* !< Enable FIFO Clear */
/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS[RXCLR] Bits */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_RXCLR_OFS (7)                             /* !< RXCLR Offset */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_RXCLR_MASK ((uint32_t)0x00000080U)         /* !< RX FIFO CLEAR. Setting this bit
                                                                                    will clear the RX FIFO contents. */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_RXCLR_DISABLE ((uint32_t)0x00000000U)         /* !< Disable FIFO clear */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_IFLS_RXCLR_ENABLE ((uint32_t)0x00000080U)         /* !< Enable FIFO Clear */

/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_TPR Bits */
/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_TPR[TPR] Bits */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_TPR_TPR_OFS (0)                             /* !< TPR Offset */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_TPR_TPR_MASK ((uint32_t)0x0000007FU)         /* !< Timer Period  This field is used in
                                                                                    the equation to configure SCL_PERIOD
                                                                                    : SCL_PERIOD = (1 + TPR ) * (SCL_LP +
                                                                                    SCL_HP ) * INT_CLK_PRD where:
                                                                                    SCL_PRD is the SCL line period (I2C
                                                                                    clock).   TPR is the Timer Period
                                                                                    register value (range of 1 to 127).
                                                                                    SCL_LP is the SCL Low period (fixed
                                                                                    at 6).   SCL_HP is the SCL High
                                                                                    period (fixed at 4).   CLK_PRD is the
                                                                                    functional clock period in ns. */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_TPR_TPR_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_TPR_TPR_MAXIMUM ((uint32_t)0x0000007FU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_GFCTL Bits */
/* M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_GFCTL[DGFSEL] Bits */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_GFCTL_DGFSEL_OFS (0)                             /* !< DGFSEL Offset */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_GFCTL_DGFSEL_MASK ((uint32_t)0x00000007U)         /* !< Glitch Suppression Pulse Width
                                                                                    This field controls the pulse width
                                                                                    select for glitch suppression on the
                                                                                    SCL and SDA lines. The following
                                                                                    values are the glitch suppression
                                                                                    values in terms of functional clocks.
                                                                                    (Core Domain only) */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_GFCTL_DGFSEL_DISABLED ((uint32_t)0x00000000U)         /* !< Bypass */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_GFCTL_DGFSEL_CLK_1 ((uint32_t)0x00000001U)         /* !< 1 clock */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_GFCTL_DGFSEL_CLK_2 ((uint32_t)0x00000002U)         /* !< 2 clocks */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_GFCTL_DGFSEL_CLK_3 ((uint32_t)0x00000003U)         /* !< 3 clocks */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_GFCTL_DGFSEL_CLK_4 ((uint32_t)0x00000004U)         /* !< 4 clocks */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_GFCTL_DGFSEL_CLK_8 ((uint32_t)0x00000005U)         /* !< 8 clocks */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_GFCTL_DGFSEL_CLK_16 ((uint32_t)0x00000006U)         /* !< 16 clocks */
#define M33C1SPGSS2_UC1_I2CC_IPSPECIFIC_GFCTL_DGFSEL_CLK_31 ((uint32_t)0x00000007U)         /* !< 31 clocks */

