TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_GFCTL Bits */
/* M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_GFCTL[DGFSEL] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_GFCTL_DGFSEL_OFS (0)                             /* !< DGFSEL Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_GFCTL_DGFSEL_MASK ((uint32_t)0x00000007U)         /* !< Glitch Suppression Pulse Width
                                                                                    This field controls the pulse width
                                                                                    select for glitch suppression on the
                                                                                    SCL and SDA lines. The following
                                                                                    values are the glitch suppression
                                                                                    values in terms of functional clocks.
                                                                                    (Core Domain only) */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_GFCTL_DGFSEL_DISABLED ((uint32_t)0x00000000U)         /* !< Bypass */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_GFCTL_DGFSEL_CLK_1 ((uint32_t)0x00000001U)         /* !< 1 clock */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_GFCTL_DGFSEL_CLK_2 ((uint32_t)0x00000002U)         /* !< 2 clocks */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_GFCTL_DGFSEL_CLK_3 ((uint32_t)0x00000003U)         /* !< 3 clocks */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_GFCTL_DGFSEL_CLK_4 ((uint32_t)0x00000004U)         /* !< 4 clocks */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_GFCTL_DGFSEL_CLK_8 ((uint32_t)0x00000005U)         /* !< 8 clocks */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_GFCTL_DGFSEL_CLK_16 ((uint32_t)0x00000006U)         /* !< 16 clocks */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_GFCTL_DGFSEL_CLK_31 ((uint32_t)0x00000007U)         /* !< 31 clocks */

/* M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_BMON Bits */
/* M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_BMON[SCL] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_BMON_SCL_OFS (0)                             /* !< SCL Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_BMON_SCL_MASK ((uint32_t)0x00000001U)         /* !< I2C SCL Status */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_BMON_SCL_CLEARED ((uint32_t)0x00000000U)         /* !< The I2CSCL signal is low. */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_BMON_SCL_SET ((uint32_t)0x00000001U)         /* !< The I2CSCL signal is high. Note:
                                                                                    During and right after reset, the SCL
                                                                                    pin is in GPIO input mode without the
                                                                                    internal pull enabled. For proper I2C
                                                                                    operation, the user should have the
                                                                                    external pull-up resistor in place
                                                                                    before starting any I2C operations. */
/* M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_BMON[SDA] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_BMON_SDA_OFS (1)                             /* !< SDA Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_BMON_SDA_MASK ((uint32_t)0x00000002U)         /* !< I2C SDA Status */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_BMON_SDA_CLEARED ((uint32_t)0x00000000U)         /* !< The I2CSDA signal is low. */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_BMON_SDA_SET ((uint32_t)0x00000002U)         /* !< The I2CSDA signal is high. Note:
                                                                                    During and right after reset, the SDA
                                                                                    pin is in GPIO input mode without the
                                                                                    internal pull enabled. For proper I2C
                                                                                    operation, the user should have the
                                                                                    external pull-up resistor in place
                                                                                    before starting any I2C operations. */

/* M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TXDATA Bits */
/* M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TXDATA[DATA] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TXDATA_DATA_MASK ((uint32_t)0x000000FFU)         /* !< Transmit Data This byte contains
                                                                                    the data to be transferred during the
                                                                                    next transaction. */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TXDATA_DATA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_RXDATA Bits */
/* M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_RXDATA[DATA] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_RXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_RXDATA_DATA_MASK ((uint32_t)0x000000FFU)         /* !< Received Data.  This field contains
                                                                                    the last received data. */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_RXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_RXDATA_DATA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TA Bits */
/* M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TA[DIR] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TA_DIR_OFS (0)                             /* !< DIR Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TA_DIR_MASK ((uint32_t)0x00000001U)         /* !< Receive/Send The DIR bit specifies
                                                                                    if the next operation is a Receive
                                                                                    (High) or Transmit (Low). 0h =
                                                                                    Transmit 1h = Receive */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TA_DIR_TRANSMIT ((uint32_t)0x00000000U)         /* !< in transmit mode. */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TA_DIR_RECEIVE ((uint32_t)0x00000001U)         /* !< is in receive mode. */
/* M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TA[ADDR] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TA_ADDR_OFS (1)                             /* !< ADDR Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TA_ADDR_MASK ((uint32_t)0x000007FEU)         /* !< I2C Target Address This field
                                                                                    specifies bits A9 through A0 of the
                                                                                    Target address. In 7-bit addressing
                                                                                    mode as selected by MSA.MODE bit, the
                                                                                    top 3 bits are don't care */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TA_ADDR_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TA_ADDR_MAXIMUM ((uint32_t)0x000007FEU)         /* !< Highest possible value */
/* M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TA[MODE] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TA_MODE_OFS (15)                            /* !< MODE Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TA_MODE_MASK ((uint32_t)0x00008000U)         /* !< This bit selects the adressing mode
                                                                                    to be used  When 0, 7-bit addressing
                                                                                    is used. When 1, 10-bit addressing is
                                                                                    used. */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TA_MODE_MODE7 ((uint32_t)0x00000000U)         /* !< 7-bit addressing mode */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TA_MODE_MODE10 ((uint32_t)0x00008000U)         /* !< 10-bit addressing mode */

