TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TIMEOUT_CNT Bits */
/* M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TIMEOUT_CNT[TCNTA] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTA_OFS (0)                             /* !< TCNTA Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTA_MASK ((uint32_t)0x000000FFU)         /* !< Timeout Count A Current Count: This
                                                                                    field contains the upper 8 bits of a
                                                                                    12-bit current counter for timeout
                                                                                    counter A */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest Value */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TIMEOUT_CTL Bits */
/* M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TIMEOUT_CTL[TCNTLA] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_OFS (0)                             /* !< TCNTLA Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_MASK ((uint32_t)0x000000FFU)         /* !< Timeout counter A load value
                                                                                    Counter A is used for SCL low
                                                                                    detection. This field contains the
                                                                                    upper 8 bits of a 12-bit pre-load
                                                                                    value for the Timeout A count. NOTE:
                                                                                    The value of CNTLA must be greater
                                                                                    than 1h.  Each count is equal to 520
                                                                                    times the timeout period of
                                                                                    functional clock. For example, with
                                                                                    8MHz functional clock and a 100KHz
                                                                                    operating I2C clock, one timeout
                                                                                    period will be equal to (1 / 8MHz) *
                                                                                    520 or 65 us. */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest Value */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TIMEOUT_CTL[TCNTAEN] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_OFS (15)                            /* !< TCNTAEN Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_MASK ((uint32_t)0x00008000U)         /* !< Timeout Counter A Enable */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Timeout Counter B */
#define M33C1SPGSS2_UC0_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_ENABLE ((uint32_t)0x00008000U)         /* !< Enable Timeout Counter B */

/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_IMASK Bits */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_IMASK[TXTRG] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_IMASK_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_IMASK_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_IMASK_TXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_IMASK_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_RIS Bits */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_RIS[TXTRG] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_RIS_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_RIS_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_RIS_TXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_RIS_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_MIS Bits */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_MIS[TXTRG] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_MIS_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_MIS_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_MIS_TXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_MIS_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_ISET Bits */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_ISET[TXTRG] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_ISET_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_ISET_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_ISET_TXTRG_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG0_ISET_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_IMASK Bits */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_IMASK[RXTRG] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_IMASK_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_IMASK_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_IMASK_RXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_IMASK_RXTRG_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

