TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_RIS Bits */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_RIS[RXTRG] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_RIS_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_RIS_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger 				    When FIFO
                                                                                    is present, trigger when RX FIFO
                                                                                    contains >= defined bytes
                                                                                    when FIFO is not present, this
                                                                                    indicates when buffer is full */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_RIS_RXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_RIS_RXTRG_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_MIS Bits */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_MIS[RXTRG] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_MIS_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_MIS_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_MIS_RXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_MIS_RXTRG_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_ISET Bits */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_ISET[RXTRG] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_ISET_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_ISET_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_ISET_RXTRG_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_DMA_TRIG1_ISET_RXTRG_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_IIDX Bits */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_IIDX[STAT] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_IIDX_STAT_OFS (0)                             /* !< STAT Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_IIDX_STAT_MASK ((uint32_t)0x000000FFU)         /* !< I2C Module Interrupt Vector Value.
                                                                                    This register provides the highes
                                                                                    priority interrupt index. A read
                                                                                    clears the corresponding interrupt
                                                                                    flag in RIS and MISC. 15h-1Fh =
                                                                                    Reserved */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_IIDX_STAT_NO_INTR ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_IIDX_STAT_RXDONEFG ((uint32_t)0x00000001U)         /* !< Data received */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_IIDX_STAT_TXDONEFG ((uint32_t)0x00000002U)         /* !< data transmitted */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_IIDX_STAT_RXTRG ((uint32_t)0x00000003U)         /* !< Receive Trigger */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_IIDX_STAT_TXTRG ((uint32_t)0x00000004U)         /* !< Transmit Trigger */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_IIDX_STAT_RXFULL ((uint32_t)0x00000005U)         /* !< RX FIFO FULL Event/interrupt
                                                                                    pending */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_IIDX_STAT_TXEMPTY ((uint32_t)0x00000006U)         /* !< Transmit FIFO/Buffer Empty
                                                                                    Event/interrupt pending */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_IIDX_STAT_NACKFG ((uint32_t)0x00000008U)         /* !< Address/Data NACK */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_IIDX_STAT_STARTFG ((uint32_t)0x00000009U)         /* !< Start Event */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_IIDX_STAT_STOPFG ((uint32_t)0x0000000AU)         /* !< Stop Event */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_IIDX_STAT_ARBLOSTFG ((uint32_t)0x0000000BU)         /* !< Arbitration Lost */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_IIDX_STAT_PEC_RX_ERR ((uint32_t)0x0000000CU)         /* !< PEC Receive Error Event */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_IIDX_STAT_TIMEOUTA ((uint32_t)0x0000000DU)         /* !< Timeout A Event */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_IIDX_STAT_TIMEOUTB ((uint32_t)0x0000000EU)         /* !< Timeout B Event */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_IIDX_STAT_DMA_DONE_RX ((uint32_t)0x00000010U)         /* !< DMA DONE on Channel RX */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_IIDX_STAT_DMA_DONE_TX ((uint32_t)0x00000011U)         /* !< DMA DONE on Channel TX */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_IIDX_STAT_DMA_PREIRQ_RX ((uint32_t)0x00000013U)         /* !< DMA PRE IRQ INTERRUPT */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_IIDX_STAT_DMA_PREIRQ_TX ((uint32_t)0x00000014U)         /* !< DMA PRE IRQ INTERRUPT */

/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK Bits */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK[RXDONE] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_RXDONE_OFS (0)                             /* !< RXDONE Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_RXDONE_MASK ((uint32_t)0x00000001U)         /* !< RXDONE interrupt */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_RXDONE_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_RXDONE_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK[TIMEOUTA] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_TIMEOUTA_OFS (12)                            /* !< TIMEOUTA Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_TIMEOUTA_MASK ((uint32_t)0x00001000U)         /* !< TIMEOUTA interrupt */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_TIMEOUTA_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_TIMEOUTA_SET ((uint32_t)0x00001000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK[NACK] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_NACK_OFS (7)                             /* !< NACK Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_NACK_MASK ((uint32_t)0x00000080U)         /* !< NACK interrupt */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_NACK_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_NACK_SET ((uint32_t)0x00000080U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK[START] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_START_OFS (8)                             /* !< START Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_START_MASK ((uint32_t)0x00000100U)         /* !< START interrupt */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_START_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_START_SET ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK[STOP] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_STOP_OFS (9)                             /* !< STOP Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_STOP_MASK ((uint32_t)0x00000200U)         /* !< STOP interrupt */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_STOP_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_STOP_SET ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK[ARBLOST] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_ARBLOST_OFS (10)                            /* !< ARBLOST Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_ARBLOST_MASK ((uint32_t)0x00000400U)         /* !< Arbitration Lost interrupt */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_ARBLOST_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_ARBLOST_SET ((uint32_t)0x00000400U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK[TXDONE] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_TXDONE_OFS (1)                             /* !< TXDONE Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_TXDONE_MASK ((uint32_t)0x00000002U)         /* !< Transmit Transaction completed
                                                                                    Interrupt */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_TXDONE_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_TXDONE_SET ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK[RXTRG] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_RXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_RXTRG_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK[TXTRG] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_TXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK[DMA_DONE_TX] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< DMA Done on Event Channel TX */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_TX_SET ((uint32_t)0x00010000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK[DMA_DONE_RX] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< DMA Done on Event Channel RX */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_RX_SET ((uint32_t)0x00008000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK[RXFULL] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_RXFULL_OFS (4)                             /* !< RXFULL Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_RXFULL_MASK ((uint32_t)0x00000010U)         /* !< RXFIFO full event */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_RXFULL_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_RXFULL_SET ((uint32_t)0x00000010U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK[TXEMPTY] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_TXEMPTY_OFS (5)                             /* !< TXEMPTY Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_TXEMPTY_MASK ((uint32_t)0x00000020U)         /* !< Transmit FIFO/Buffer Empty
                                                                                    interrupt. */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_TXEMPTY_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_IMASK_TXEMPTY_SET ((uint32_t)0x00000020U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS Bits */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS[RXDONE] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_RXDONE_OFS (0)                             /* !< RXDONE Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_RXDONE_MASK ((uint32_t)0x00000001U)         /* !< Receive Done Interrupt:      RXDONE
                                                                                    interrupt is raised when a burst
                                                                                    length completes     Or, in case of
                                                                                    quick command, when a quick command
                                                                                    with R/Wn bit set to '1' */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_RXDONE_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_RXDONE_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS[TIMEOUTA] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_TIMEOUTA_OFS (12)                            /* !< TIMEOUTA Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_TIMEOUTA_MASK ((uint32_t)0x00001000U)         /* !< Timeout A Interrupt */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_TIMEOUTA_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_TIMEOUTA_SET ((uint32_t)0x00001000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS[NACK] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_NACK_OFS (7)                             /* !< NACK Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_NACK_MASK ((uint32_t)0x00000080U)         /* !< Address/Data NACK Interrupt: set
                                                                                    when address or data nack is received */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_NACK_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_NACK_SET ((uint32_t)0x00000080U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS[START] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_START_OFS (8)                             /* !< START Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_START_MASK ((uint32_t)0x00000100U)         /* !< START Detection Interrupt */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_START_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_START_SET ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS[STOP] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_STOP_OFS (9)                             /* !< STOP Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_STOP_MASK ((uint32_t)0x00000200U)         /* !< STOP Detection Interrupt */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_STOP_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_STOP_SET ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS[ARBLOST] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_ARBLOST_OFS (10)                            /* !< ARBLOST Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_ARBLOST_MASK ((uint32_t)0x00000400U)         /* !< Arbitration Lost Interrupt: in
                                                                                    multi-controller systems, when this
                                                                                    controller loses out during
                                                                                    arbitration */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_ARBLOST_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_ARBLOST_SET ((uint32_t)0x00000400U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS[TXDONE] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_TXDONE_OFS (1)                             /* !< TXDONE Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_TXDONE_MASK ((uint32_t)0x00000002U)         /* !< Transmit Done Interrupt:
                                                                                    TXDONE interrupt is raised when a
                                                                                    burst length completes     Or, in
                                                                                    case of quick command, when a quick
                                                                                    command with R/Wn bit set to '0' */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_TXDONE_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_TXDONE_SET ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS[RXTRG] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger 				    When FIFO
                                                                                    is present, as per IFLS settings
                                                                                    when FIFO is not present, this
                                                                                    indicates when buffer is full */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_RXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_RXTRG_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS[TXTRG] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger     When FIFO is
                                                                                    present, as per IFLS settings
                                                                                    When FIFO is not present, trigger
                                                                                    when transmit buffer is empty */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_TXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS[DMA_DONE_TX] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< DMA Done on Event Channel TX */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_DMA_DONE_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_DMA_DONE_TX_SET ((uint32_t)0x00010000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS[DMA_DONE_RX] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< DMA Done on Event Channel RX */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_DMA_DONE_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_DMA_DONE_RX_SET ((uint32_t)0x00008000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS[RXFULL] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_RXFULL_OFS (4)                             /* !< RXFULL Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_RXFULL_MASK ((uint32_t)0x00000010U)         /* !< RXFIFO full event. This interrupt
                                                                                    is set when receive FIFO is full. */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_RXFULL_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_RXFULL_SET ((uint32_t)0x00000010U)         /* !< Interrupt occured */
/* M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS[TXEMPTY] Bits */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_TXEMPTY_OFS (5)                             /* !< TXEMPTY Offset */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_TXEMPTY_MASK ((uint32_t)0x00000020U)         /* !< Transmit FIFO Empty: set when
                                                                                    Transmit FIFO is empty */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_TXEMPTY_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC0_I2CC_IPSTANDARD_CPU_INT_RIS_TXEMPTY_SET ((uint32_t)0x00000020U)         /* !< Interrupt occured */

