TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS Bits */
/* M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS[TXIFLSEL] Bits */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_TXIFLSEL_OFS (0)                             /* !< TXIFLSEL Offset */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_TXIFLSEL_MASK ((uint32_t)0x00000007U)         /* !< FIFO Level Select for generating
                                                                                    events (interrupt/dma).  Note: for
                                                                                    undefined settings the default
                                                                                    configuration is used. */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_TXIFLSEL_LVL_3_4 ((uint32_t)0x00000001U)         /* !< TX FIFO <= 3/4 empty */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_TXIFLSEL_LVL_1_2 ((uint32_t)0x00000002U)         /* !< TX FIFO <= 1/2 empty (default) */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_TXIFLSEL_LVL_1_4 ((uint32_t)0x00000003U)         /* !< TX FIFO <= 1/4 empty */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_TXIFLSEL_LVL_NOT_FULL ((uint32_t)0x00000004U)         /* !< Opposite of full */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_TXIFLSEL_LVL_EMPTY ((uint32_t)0x00000005U)         /* !< TX FIFO is empty */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_TXIFLSEL_LVL_ALMOST_EMPTY ((uint32_t)0x00000006U)         /* !< TX FIFO <= 1 */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_TXIFLSEL_LVL_ALMOST_FULL ((uint32_t)0x00000007U)         /* !< TX_FIFO >= (MAX_FIFO_LEN -1) */
/* M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS[RXIFLSEL] Bits */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_RXIFLSEL_OFS (4)                             /* !< RXIFLSEL Offset */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_RXIFLSEL_MASK ((uint32_t)0x00000070U)         /* !< FIFO Level Select for generating
                                                                                    events (interrupt/dma).  Note: for
                                                                                    undefined settings the default
                                                                                    configuration is used. */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_RXIFLSEL_LVL_1_4 ((uint32_t)0x00000010U)         /* !< RX FIFO >= 1/4 full */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_RXIFLSEL_LVL_1_2 ((uint32_t)0x00000020U)         /* !< RX FIFO >= 1/2 full (default) */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_RXIFLSEL_LVL_3_4 ((uint32_t)0x00000030U)         /* !< RX FIFO >= 3/4 full */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_RXIFLSEL_LVL_NOT_EMPTY ((uint32_t)0x00000040U)         /* !< Opposite of empty */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_RXIFLSEL_LVL_FULL ((uint32_t)0x00000050U)         /* !< RX FIFO is full */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_RXIFLSEL_LVL_ALMOST_FULL ((uint32_t)0x00000060U)         /* !< RX_FIFO >= (MAX_FIFO_LEN -1) */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_RXIFLSEL_LVL_ALMOST_EMPTY ((uint32_t)0x00000070U)         /* !< RX_FIFO <= 1 */
/* M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS[RXTOSEL] Bits */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_RXTOSEL_OFS (8)                             /* !< RXTOSEL Offset */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_RXTOSEL_MASK ((uint32_t)0x00000F00U)         /* !< UART Receive Interrupt Timeout
                                                                                    Select. When receiving no start edge
                                                                                    for an additional character within
                                                                                    the set bittimes a RX interrupt is
                                                                                    set even if the FIFO level is not
                                                                                    reached. A value of 0 disables this
                                                                                    function. */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_RXTOSEL_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_RXTOSEL_MAXIMUM ((uint32_t)0x00000F00U)         /* !< Highest possible value */
/* M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS[TXCLR] Bits */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_TXCLR_OFS (3)                             /* !< TXCLR Offset */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_TXCLR_MASK ((uint32_t)0x00000008U)         /* !< TX FIFO CLEAR. Setting this bit
                                                                                    will clear the TX FIFO contents. */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_TXCLR_DISABLE ((uint32_t)0x00000000U)         /* !< Disable FIFO clear */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_TXCLR_ENABLE ((uint32_t)0x00000008U)         /* !< Enable FIFO Clear */
/* M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS[RXCLR] Bits */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_RXCLR_OFS (7)                             /* !< RXCLR Offset */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_RXCLR_MASK ((uint32_t)0x00000080U)         /* !< RX FIFO CLEAR. Setting this bit
                                                                                    will clear the RX FIFO contents. */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_RXCLR_DISABLE ((uint32_t)0x00000000U)         /* !< Disable FIFO clear */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IFLS_RXCLR_ENABLE ((uint32_t)0x00000080U)         /* !< Enable FIFO Clear */

/* M33C1SPGSS2_UC3_UART_IPSPECIFIC_IBRD Bits */
/* M33C1SPGSS2_UC3_UART_IPSPECIFIC_IBRD[DIVINT] Bits */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IBRD_DIVINT_OFS (0)                             /* !< DIVINT Offset */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IBRD_DIVINT_MASK ((uint32_t)0x0000FFFFU)         /* !< Integer Baud-Rate Divisor */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IBRD_DIVINT_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_IBRD_DIVINT_MAXIMUM ((uint32_t)0x0000FFFFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC3_UART_IPSPECIFIC_FBRD Bits */
/* M33C1SPGSS2_UC3_UART_IPSPECIFIC_FBRD[DIVFRAC] Bits */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_FBRD_DIVFRAC_OFS (0)                             /* !< DIVFRAC Offset */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_FBRD_DIVFRAC_MASK ((uint32_t)0x0000003FU)         /* !< Fractional Baud-Rate Divisor */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_FBRD_DIVFRAC_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_FBRD_DIVFRAC_MAXIMUM ((uint32_t)0x0000003FU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC3_UART_IPSPECIFIC_TXDATA Bits */
/* M33C1SPGSS2_UC3_UART_IPSPECIFIC_TXDATA[DATA] Bits */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_TXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_TXDATA_DATA_MASK ((uint32_t)0x000000FFU)         /* !< Data Transmitted or Received  Data
                                                                                    that is to be transmitted via the
                                                                                    UART is written to this field.  When
                                                                                    read, this field contains the data
                                                                                    that was received by the UART. */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_TXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_TXDATA_DATA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

