TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA Bits */
/* M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA[DATA] Bits */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA_DATA_MASK ((uint32_t)0x000000FFU)         /* !< Received Data.  When read, this
                                                                                    field contains the data that was
                                                                                    received by the UART. */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA_DATA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA[FRMERR] Bits */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA_FRMERR_OFS (8)                             /* !< FRMERR Offset */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA_FRMERR_MASK ((uint32_t)0x00000100U)         /* !< UART Framing Error  Writing to this
                                                                                    bit has no effect. The flag is
                                                                                    cleared by writing 1 to the FRMERR
                                                                                    bit in the UART EVENT ICLR register.
                                                                                    This error is associated with the
                                                                                    character at the top of the FIFO. */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA_FRMERR_CLR ((uint32_t)0x00000000U)         /* !< No framing error has occurred */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA_FRMERR_SET ((uint32_t)0x00000100U)         /* !< The received character does not
                                                                                    have a valid stop bit sequence, which
                                                                                    is one or two stop bits depending on
                                                                                    the UARTLCRH.STP2 setting (a valid
                                                                                    stop bit is 1). */
/* M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA[PARERR] Bits */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA_PARERR_OFS (9)                             /* !< PARERR Offset */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA_PARERR_MASK ((uint32_t)0x00000200U)         /* !< UART Parity Error   Writing to this
                                                                                    bit has no effect. The flag is
                                                                                    cleared by writing 1 to the PARERR
                                                                                    bit in the UART EVENT ICLR register. */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA_PARERR_CLR ((uint32_t)0x00000000U)         /* !< No parity error has occurred */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA_PARERR_SET ((uint32_t)0x00000200U)         /* !< The parity of the received data
                                                                                    character does not match the parity
                                                                                    defined by bits 2 and 7 of the
                                                                                    UARTLCRH register. */
/* M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA[BRKERR] Bits */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA_BRKERR_OFS (10)                            /* !< BRKERR Offset */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA_BRKERR_MASK ((uint32_t)0x00000400U)         /* !< UART Break Error  Writing to this
                                                                                    bit has no effect. The flag is
                                                                                    cleared by writing 1 to the BRKERR
                                                                                    bit in the UART EVENT ICLR register.
                                                                                    This error is associated with the
                                                                                    character at the top of the FIFO.
                                                                                    When a break occurs, only one 0
                                                                                    character is loaded into the FIFO.
                                                                                    The next character is only enabled
                                                                                    after the receive data input goes to
                                                                                    a 1 (marking state) and the next
                                                                                    valid start bit is received. */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA_BRKERR_CLR ((uint32_t)0x00000000U)         /* !< No break condition has occurred */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA_BRKERR_SET ((uint32_t)0x00000400U)         /* !< A break condition has been
                                                                                    detected, indicating that the receive
                                                                                    data input was held low for longer
                                                                                    than a full-word transmission time
                                                                                    (defined as start, data, parity, and
                                                                                    stop bits). */
/* M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA[NERR] Bits */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA_NERR_OFS (11)                            /* !< NERR Offset */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA_NERR_MASK ((uint32_t)0x00000800U)         /* !< Noise Error. Writing to this bit
                                                                                    has no effect. The flag is cleared by
                                                                                    writing 1 to the NERR bit in the UART
                                                                                    EVENT ICLR register. */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA_NERR_CLR ((uint32_t)0x00000000U)         /* !< No noise error occurred */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_RXDATA_NERR_SET ((uint32_t)0x00000800U)         /* !< Noise error occurred during
                                                                                    majority voting */

/* M33C1SPGSS2_LINCNT Bits */
/* M33C1SPGSS2_LINCNT[VALUE] Bits */
#define M33C1SPGSS2_LINCNT_VALUE_OFS             (0)                             /* !< VALUE Offset */
#define M33C1SPGSS2_LINCNT_VALUE_MASK            ((uint32_t)0x0000FFFFU)         /* !< 16 bit up counter clocked by the
                                                                                    functional clock of the UART. */
#define M33C1SPGSS2_LINCNT_VALUE_MINIMUM         ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_LINCNT_VALUE_MAXIMUM         ((uint32_t)0x0000FFFFU)         /* !< Highest possible value */

/* M33C1SPGSS2_LINCTL Bits */
/* M33C1SPGSS2_LINCTL[CTRENA] Bits */
#define M33C1SPGSS2_LINCTL_CTRENA_OFS            (0)                             /* !< CTRENA Offset */
#define M33C1SPGSS2_LINCTL_CTRENA_MASK           ((uint32_t)0x00000001U)         /* !< LIN Counter Enable. LIN counter
                                                                                    will only count when enabled. */
#define M33C1SPGSS2_LINCTL_CTRENA_DISABLE        ((uint32_t)0x00000000U)         /* !< Counter disabled */
#define M33C1SPGSS2_LINCTL_CTRENA_ENABLE         ((uint32_t)0x00000001U)         /* !< Counter enabled */
/* M33C1SPGSS2_LINCTL[ZERONE] Bits */
#define M33C1SPGSS2_LINCTL_ZERONE_OFS            (1)                             /* !< ZERONE Offset */
#define M33C1SPGSS2_LINCTL_ZERONE_MASK           ((uint32_t)0x00000002U)         /* !< Zero on negative Edge of RXD. When
                                                                                    enabled the counter is set to 0 and
                                                                                    starts counting on a negative edge of
                                                                                    RXD */
#define M33C1SPGSS2_LINCTL_ZERONE_DISABLE        ((uint32_t)0x00000000U)         /* !< Zero on negative edge disabled */
#define M33C1SPGSS2_LINCTL_ZERONE_ENABLE         ((uint32_t)0x00000002U)         /* !< Zero on negative edge enabled */
/* M33C1SPGSS2_LINCTL[CNTRXLOW] Bits */
#define M33C1SPGSS2_LINCTL_CNTRXLOW_OFS          (2)                             /* !< CNTRXLOW Offset */
#define M33C1SPGSS2_LINCTL_CNTRXLOW_MASK         ((uint32_t)0x00000004U)         /* !< Count while low Signal on RXD When
                                                                                    counter is enabled and the signal on
                                                                                    RXD is low, the counter increments. */
#define M33C1SPGSS2_LINCTL_CNTRXLOW_DISABLE      ((uint32_t)0x00000000U)         /* !< Count while low Signal on UARTxRXD
                                                                                    disabled */
#define M33C1SPGSS2_LINCTL_CNTRXLOW_ENABLE       ((uint32_t)0x00000004U)         /* !< Count while low Signal on UARTxRXD
                                                                                    enabled */
/* M33C1SPGSS2_LINCTL[LINC0CAP] Bits */
#define M33C1SPGSS2_LINCTL_LINC0CAP_OFS          (4)                             /* !< LINC0CAP Offset */
#define M33C1SPGSS2_LINCTL_LINC0CAP_MASK         ((uint32_t)0x00000010U)         /* !< Capture Counter on negative RXD
                                                                                    Edge. When enabled the counter value
                                                                                    is captured to LINC0 register on each
                                                                                    negative RXD edge. A LINC0 interrupt
                                                                                    is triggered when enabled. */
#define M33C1SPGSS2_LINCTL_LINC0CAP_DISABLE      ((uint32_t)0x00000000U)         /* !< Capture counter on negative
                                                                                    UARTxRXD edge disabled */
#define M33C1SPGSS2_LINCTL_LINC0CAP_ENABLE       ((uint32_t)0x00000010U)         /* !< Capture counter on negative
                                                                                    UARTxRXD edge enabled */
/* M33C1SPGSS2_LINCTL[LINC1CAP] Bits */
#define M33C1SPGSS2_LINCTL_LINC1CAP_OFS          (5)                             /* !< LINC1CAP Offset */
#define M33C1SPGSS2_LINCTL_LINC1CAP_MASK         ((uint32_t)0x00000020U)         /* !< Capture Counter on positive RXD
                                                                                    Edge. When enabled the counter value
                                                                                    is captured to LINC1 register on each
                                                                                    positive RXD edge. A LINC1 interrupt
                                                                                    is triggered when enabled. */
#define M33C1SPGSS2_LINCTL_LINC1CAP_DISABLE      ((uint32_t)0x00000000U)         /* !< Capture counter on positive
                                                                                    UARTxRXD edge disabled */
#define M33C1SPGSS2_LINCTL_LINC1CAP_ENABLE       ((uint32_t)0x00000020U)         /* !< Capture counter on positive
                                                                                    UARTxRXD edge enabled */
/* M33C1SPGSS2_LINCTL[LINC0_MATCH] Bits */
#define M33C1SPGSS2_LINCTL_LINC0_MATCH_OFS       (6)                             /* !< LINC0_MATCH Offset */
#define M33C1SPGSS2_LINCTL_LINC0_MATCH_MASK      ((uint32_t)0x00000040U)         /* !< Counter Compare Match Mode  When
                                                                                    this bit is set to 1 a counter
                                                                                    compare match with LINC0 register
                                                                                    triggers an LINC0 interrupt when
                                                                                    enabled. */
#define M33C1SPGSS2_LINCTL_LINC0_MATCH_DISABLE   ((uint32_t)0x00000000U)         /* !< Counter compare match mode disabled
                                                                                    (capture mode enabled) */
#define M33C1SPGSS2_LINCTL_LINC0_MATCH_ENABLE    ((uint32_t)0x00000040U)         /* !< Counter compare match enabled
                                                                                    (capture mode disabled) */
/* M33C1SPGSS2_LINCTL[EN_FRM_ERR] Bits */
#define M33C1SPGSS2_LINCTL_EN_FRM_ERR_OFS        (7)                             /* !< EN_FRM_ERR Offset */
#define M33C1SPGSS2_LINCTL_EN_FRM_ERR_MASK       ((uint32_t)0x00000080U)         /* !< Enable FRAME ERROR */
#define M33C1SPGSS2_LINCTL_EN_FRM_ERR_DISABLE    ((uint32_t)0x00000000U)         /* !< Disable Frame Error Generation  If
                                                                                    STOP bit of '0' is received, then,
                                                                                    FRAME ERROR is not generated */
#define M33C1SPGSS2_LINCTL_EN_FRM_ERR_ENABLE     ((uint32_t)0x00000080U)         /* !< Enable Frame Error Generation  If
                                                                                    STOP bit of '0' is received, then,
                                                                                    FRAME ERROR is generated */

/* M33C1SPGSS2_LINC0 Bits */
/* M33C1SPGSS2_LINC0[DATA] Bits */
#define M33C1SPGSS2_LINC0_DATA_OFS               (0)                             /* !< DATA Offset */
#define M33C1SPGSS2_LINC0_DATA_MASK              ((uint32_t)0x0000FFFFU)         /* !< 16 Bit Capture / Compare Register
                                                                                    Captures current LINCTR value on RXD
                                                                                    falling edge and can generate a LINC0
                                                                                    interrupt when capture is enabled
                                                                                    (LINC0CAP = 1). If compare mode is
                                                                                    enabled (LINC0_MATCH = 1), a counter
                                                                                    match can generate a LINC0 interrupt. */
#define M33C1SPGSS2_LINC0_DATA_MINIMUM           ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_LINC0_DATA_MAXIMUM           ((uint32_t)0x0000FFFFU)         /* !< Highest possible value */

