TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_LINC1 Bits */
/* M33C1SPGSS2_LINC1[DATA] Bits */
#define M33C1SPGSS2_LINC1_DATA_OFS               (0)                             /* !< DATA Offset */
#define M33C1SPGSS2_LINC1_DATA_MASK              ((uint32_t)0x0000FFFFU)         /* !< 16 Bit Capture / Compare Register
                                                                                    Captures current LINCTR value on RXD
                                                                                    rising edge and can generate a LINC1
                                                                                    interrupt when capture is enabled
                                                                                    (LINC1CAP = 1) */
#define M33C1SPGSS2_LINC1_DATA_MINIMUM           ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_LINC1_DATA_MAXIMUM           ((uint32_t)0x0000FFFFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC3_UART_IPSPECIFIC_AMASK Bits */
/* M33C1SPGSS2_UC3_UART_IPSPECIFIC_AMASK[VALUE] Bits */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_AMASK_VALUE_OFS (0)                             /* !< VALUE Offset */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_AMASK_VALUE_MASK ((uint32_t)0x000000FFU)         /* !< Self Address Mask for 9-Bit Mode
                                                                                    This field contains the address mask
                                                                                    that creates a set of addresses that
                                                                                    should be matched.  A 0 bit in the
                                                                                    MSK bitfield configures, that the
                                                                                    corresponding bit in the ADDR
                                                                                    bitfield of the UARTxADDR register is
                                                                                    don't care. A 1 bit in the MSK
                                                                                    bitfield configures, that the
                                                                                    corresponding bit in the ADDR
                                                                                    bitfield of the UARTxADDR register
                                                                                    must match. */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_AMASK_VALUE_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_AMASK_VALUE_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC3_UART_IPSPECIFIC_ADDR Bits */
/* M33C1SPGSS2_UC3_UART_IPSPECIFIC_ADDR[VALUE] Bits */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_ADDR_VALUE_OFS (0)                             /* !< VALUE Offset */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_ADDR_VALUE_MASK ((uint32_t)0x000000FFU)         /* !< Self Address for 9-Bit Mode  This
                                                                                    field contains the address that
                                                                                    should be matched when UARTxAMASK is
                                                                                    FFh. */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_ADDR_VALUE_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC3_UART_IPSPECIFIC_ADDR_VALUE_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_IMASK Bits */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_IMASK[TXINT] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_IMASK_TXINT_OFS (11)                            /* !< TXINT Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_IMASK_TXINT_MASK ((uint32_t)0x00000800U)         /* !< Enable UART Transmit Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_IMASK_TXINT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_IMASK_TXINT_SET ((uint32_t)0x00000800U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_RIS Bits */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_RIS[TXINT] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_RIS_TXINT_OFS (11)                            /* !< TXINT Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_RIS_TXINT_MASK ((uint32_t)0x00000800U)         /* !< UART Transmit Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_RIS_TXINT_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_RIS_TXINT_SET ((uint32_t)0x00000800U)         /* !< Interrupt occurred */

/* M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_MIS Bits */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_MIS[TXINT] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_MIS_TXINT_OFS (11)                            /* !< TXINT Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_MIS_TXINT_MASK ((uint32_t)0x00000800U)         /* !< Masked UART Transmit Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_MIS_TXINT_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_MIS_TXINT_SET ((uint32_t)0x00000800U)         /* !< Interrupt occurred */

/* M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_ISET Bits */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_ISET[TXINT] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_ISET_TXINT_OFS (11)                            /* !< TXINT Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_ISET_TXINT_MASK ((uint32_t)0x00000800U)         /* !< Set UART Transmit Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_ISET_TXINT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_TX_ISET_TXINT_SET ((uint32_t)0x00000800U)         /* !< Set Interrupt */

/* M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_IMASK Bits */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_IMASK[RTOUT] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RTOUT_OFS (0)                             /* !< RTOUT Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RTOUT_MASK ((uint32_t)0x00000001U)         /* !< Enable UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RTOUT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RTOUT_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_IMASK[RXINT] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RXINT_OFS (10)                            /* !< RXINT Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RXINT_MASK ((uint32_t)0x00000400U)         /* !< Enable UART Receive Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RXINT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RXINT_SET ((uint32_t)0x00000400U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_RIS Bits */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_RIS[RTOUT] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RTOUT_OFS (0)                             /* !< RTOUT Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RTOUT_MASK ((uint32_t)0x00000001U)         /* !< UARTOUT Receive Time-Out Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RTOUT_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RTOUT_SET ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_RIS[RXINT] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RXINT_OFS (10)                            /* !< RXINT Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RXINT_MASK ((uint32_t)0x00000400U)         /* !< UART Receive Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RXINT_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RXINT_SET ((uint32_t)0x00000400U)         /* !< Interrupt occurred */

/* M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_MIS Bits */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_MIS[RTOUT] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RTOUT_OFS (0)                             /* !< RTOUT Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RTOUT_MASK ((uint32_t)0x00000001U)         /* !< Masked UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RTOUT_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RTOUT_SET ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_MIS[RXINT] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RXINT_OFS (10)                            /* !< RXINT Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RXINT_MASK ((uint32_t)0x00000400U)         /* !< Masked UART Receive Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RXINT_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RXINT_SET ((uint32_t)0x00000400U)         /* !< Interrupt occurred */

/* M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_ISET Bits */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_ISET[RTOUT] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RTOUT_OFS (0)                             /* !< RTOUT Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RTOUT_MASK ((uint32_t)0x00000001U)         /* !< Set UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RTOUT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RTOUT_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_ISET[RXINT] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RXINT_OFS (10)                            /* !< RXINT Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RXINT_MASK ((uint32_t)0x00000400U)         /* !< Set UART Receive Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RXINT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RXINT_SET ((uint32_t)0x00000400U)         /* !< Set Interrupt */

