TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR Bits */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR[FRMERR] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_FRMERR_OFS (1)                             /* !< FRMERR Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_FRMERR_MASK ((uint32_t)0x00000002U)         /* !< Clear UART Framing Error Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_FRMERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_FRMERR_CLR ((uint32_t)0x00000002U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR[PARERR] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_PARERR_OFS (2)                             /* !< PARERR Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_PARERR_MASK ((uint32_t)0x00000004U)         /* !< Clear UART Parity Error Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_PARERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_PARERR_CLR ((uint32_t)0x00000004U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR[BRKERR] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_BRKERR_OFS (3)                             /* !< BRKERR Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_BRKERR_MASK ((uint32_t)0x00000008U)         /* !< Clear UART Break Error Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_BRKERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_BRKERR_CLR ((uint32_t)0x00000008U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR[OVRERR] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_OVRERR_OFS (4)                             /* !< OVRERR Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_OVRERR_MASK ((uint32_t)0x00000010U)         /* !< Clear UART Receive Overrun Error
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_OVRERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_OVRERR_CLR ((uint32_t)0x00000010U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR[RXNE] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_RXNE_OFS (5)                             /* !< RXNE Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_RXNE_MASK ((uint32_t)0x00000020U)         /* !< Clear Negative Edge on UARTxRXD
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_RXNE_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_RXNE_CLR ((uint32_t)0x00000020U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR[RXPE] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_RXPE_OFS (6)                             /* !< RXPE Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_RXPE_MASK ((uint32_t)0x00000040U)         /* !< Clear Positive Edge on UARTxRXD
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_RXPE_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_RXPE_CLR ((uint32_t)0x00000040U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR[LINC0] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_LINC0_OFS (7)                             /* !< LINC0 Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_LINC0_MASK ((uint32_t)0x00000080U)         /* !< Clear LIN Capture 0 / Match
                                                                                    Interrupt . */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_LINC0_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_LINC0_CLR ((uint32_t)0x00000080U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR[LINC1] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_LINC1_OFS (8)                             /* !< LINC1 Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_LINC1_MASK ((uint32_t)0x00000100U)         /* !< Clear LIN Capture 1 Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_LINC1_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_LINC1_CLR ((uint32_t)0x00000100U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR[LINOVF] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_LINOVF_OFS (9)                             /* !< LINOVF Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_LINOVF_MASK ((uint32_t)0x00000200U)         /* !< Clear LIN Hardware Counter Overflow
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_LINOVF_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_LINOVF_CLR ((uint32_t)0x00000200U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR[RXINT] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_RXINT_OFS (10)                            /* !< RXINT Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_RXINT_MASK ((uint32_t)0x00000400U)         /* !< Clear UART Receive Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_RXINT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_RXINT_CLR ((uint32_t)0x00000400U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR[TXINT] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_TXINT_OFS (11)                            /* !< TXINT Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_TXINT_MASK ((uint32_t)0x00000800U)         /* !< Clear UART Transmit Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_TXINT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_TXINT_CLR ((uint32_t)0x00000800U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR[EOT] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_EOT_OFS (12)                            /* !< EOT Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_EOT_MASK ((uint32_t)0x00001000U)         /* !< Clear UART End of Transmission
                                                                                    Interrupt Indicates that the last bit
                                                                                    of all transmitted data and flags has
                                                                                    left the serializer and without any
                                                                                    further Data in the TX Fifo or
                                                                                    Buffer. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_EOT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_EOT_CLR ((uint32_t)0x00001000U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR[ADDR_MATCH] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_ADDR_MATCH_OFS (13)                            /* !< ADDR_MATCH Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_ADDR_MATCH_MASK ((uint32_t)0x00002000U)         /* !< Clear Address Match Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_ADDR_MATCH_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_ADDR_MATCH_CLR ((uint32_t)0x00002000U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR[CTS] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_CTS_OFS (14)                            /* !< CTS Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_CTS_MASK ((uint32_t)0x00004000U)         /* !< Clear UART Clear to Send Modem
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_CTS_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_CTS_CLR ((uint32_t)0x00004000U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR[DMA_DONE_RX] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< Clear DMA Done on RX Event Channel
                                                                                    Interrupt */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_DMA_DONE_RX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_DMA_DONE_RX_CLR ((uint32_t)0x00008000U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR[DMA_DONE_TX] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< Clear DMA Done on TX Event Channel
                                                                                    Interrupt */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_DMA_DONE_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_DMA_DONE_TX_CLR ((uint32_t)0x00010000U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR[RTOUT] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_RTOUT_OFS (0)                             /* !< RTOUT Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_RTOUT_MASK ((uint32_t)0x00000001U)         /* !< Clear UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_RTOUT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_RTOUT_CLR ((uint32_t)0x00000001U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR[NERR] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_NERR_OFS (17)                            /* !< NERR Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_NERR_MASK ((uint32_t)0x00020000U)         /* !< Noise Error on triple voting.
                                                                                    Asserted when the 3 samples of
                                                                                    majority voting are not equal */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_NERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_NERR_CLR ((uint32_t)0x00020000U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR[LTOUT] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_LTOUT_OFS (20)                            /* !< LTOUT Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_LTOUT_MASK ((uint32_t)0x00100000U)         /* !< Clear UARTOUT Line Time-Out
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_LTOUT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_ICLR_LTOUT_CLR ((uint32_t)0x00100000U)         /* !< Clear Interrupt */

/* M33C1SPGSS2_UC3_UART_IPSTANDARD_CLKDIV Bits */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_CLKDIV[RATIO] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_CLKDIV_RATIO_OFS (0)                             /* !< RATIO Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_CLKDIV_RATIO_MASK ((uint32_t)0x00000007U)         /* !< Selects divide ratio of module
                                                                                    clock Division factor 0 : DIV_BY_1 1
                                                                                    : DIV_BY_2 .... 63: DIV_BY_64 */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_1 ((uint32_t)0x00000000U)         /* !< Do not divide clock source */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_2 ((uint32_t)0x00000001U)         /* !< Divide clock source by 2 */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_3 ((uint32_t)0x00000002U)         /* !< Divide clock source by 3 */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_4 ((uint32_t)0x00000003U)         /* !< Divide clock source by 4 */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_5 ((uint32_t)0x00000004U)         /* !< Divide clock source by 5 */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_6 ((uint32_t)0x00000005U)         /* !< Divide clock source by 6 */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_7 ((uint32_t)0x00000006U)         /* !< Divide clock source by 7 */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_8 ((uint32_t)0x00000007U)         /* !< Divide clock source by 8 */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_61 ((uint32_t)0x0000003CU)         /* !< Divide clock source by 61 */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_62 ((uint32_t)0x0000003DU)         /* !< Divide clock source by 62 */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_63 ((uint32_t)0x0000003EU)         /* !< Divide clock source by 63 */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_64 ((uint32_t)0x0000003FU)         /* !< Divide clock source by 64 */

/* M33C1SPGSS2_UC3_UART_IPSTANDARD_CLKSEL Bits */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_CLKSEL[BUSCLK_SEL] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_CLKSEL_BUSCLK_SEL_OFS (3)                             /* !< BUSCLK_SEL Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_CLKSEL_BUSCLK_SEL_MASK ((uint32_t)0x00000008U)         /* !< Selects BUS CLK as clock source if
                                                                                    enabled */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_CLKSEL_BUSCLK_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_CLKSEL_BUSCLK_SEL_ENABLE ((uint32_t)0x00000008U)         /* !< Select this clock as a source */

/* M33C1SPGSS2_UC3_UART_IPSTANDARD_PDBGCTL Bits */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_PDBGCTL[FREE] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_PDBGCTL_FREE_OFS (0)                             /* !< FREE Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_PDBGCTL_FREE_MASK ((uint32_t)0x00000001U)         /* !< Free run control */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_PDBGCTL_FREE_STOP ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_PDBGCTL_FREE_RUN ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_PDBGCTL[SOFT] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_PDBGCTL_SOFT_OFS (1)                             /* !< SOFT Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_PDBGCTL_SOFT_MASK ((uint32_t)0x00000002U)         /* !< Soft halt boundary control. This
                                                                                    function is only available, if [FREE]
                                                                                    is set to 'STOP' */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_PDBGCTL_SOFT_DEPRECATED ((uint32_t)0x00000000U)         /* !< Not supported */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_PDBGCTL_SOFT_DELAYED ((uint32_t)0x00000002U)         /* !< The peripheral blocks the debug
                                                                                    freeze until it has reached a
                                                                                    boundary where it can resume without
                                                                                    corruption */

/* M33C1SPGSS2_UC3_UART_IPSTANDARD_INTCTL Bits */
/* M33C1SPGSS2_UC3_UART_IPSTANDARD_INTCTL[INTEVAL] Bits */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_INTCTL_INTEVAL_OFS (0)                             /* !< INTEVAL Offset */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_INTCTL_INTEVAL_MASK ((uint32_t)0x00000001U)         /* !< Writing a 1 to this field
                                                                                    re-evaluates the interrupt sources. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_INTCTL_INTEVAL_DISABLE ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define M33C1SPGSS2_UC3_UART_IPSTANDARD_INTCTL_INTEVAL_EVAL ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */

/* M33C1SPGSS2_UC2_UART_LMGMT_DFT_ATRT_TEST0 Bits */
/* M33C1SPGSS2_UC2_UART_LMGMT_DFT_ATRT_TEST0[DTB_MUX_SEL] Bits */
#define M33C1SPGSS2_UC2_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_OFS (0)                             /* !< DTB_MUX_SEL Offset */
#define M33C1SPGSS2_UC2_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_MASK ((uint32_t)0x0000001FU)         /* !< This bit field is used to select
                                                                                    DTB mux digital output signals. */
#define M33C1SPGSS2_UC2_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Disables DTB MUX */
#define M33C1SPGSS2_UC2_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP1 ((uint32_t)0x00000001U)         /* !< Selects test group 1 */
#define M33C1SPGSS2_UC2_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP2 ((uint32_t)0x00000002U)         /* !< Selects test group 2 */
#define M33C1SPGSS2_UC2_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP3 ((uint32_t)0x00000003U)         /* !< Selects test group 3 */
#define M33C1SPGSS2_UC2_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP4 ((uint32_t)0x00000004U)         /* !< Selects test group 4 */
#define M33C1SPGSS2_UC2_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP5 ((uint32_t)0x00000005U)         /* !< Selects test group 5 */
#define M33C1SPGSS2_UC2_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP6 ((uint32_t)0x00000006U)         /* !< Selects test group 6 */
#define M33C1SPGSS2_UC2_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP7 ((uint32_t)0x00000007U)         /* !< Selects test group 7 */

