TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC2_UART_IPSPECIFIC_TXDATA Bits */
/* M33C1SPGSS2_UC2_UART_IPSPECIFIC_TXDATA[DATA] Bits */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_TXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_TXDATA_DATA_MASK ((uint32_t)0x000000FFU)         /* !< Data Transmitted or Received  Data
                                                                                    that is to be transmitted via the
                                                                                    UART is written to this field.  When
                                                                                    read, this field contains the data
                                                                                    that was received by the UART. */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_TXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_TXDATA_DATA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA Bits */
/* M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA[DATA] Bits */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA_DATA_MASK ((uint32_t)0x000000FFU)         /* !< Received Data.  When read, this
                                                                                    field contains the data that was
                                                                                    received by the UART. */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA_DATA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA[FRMERR] Bits */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA_FRMERR_OFS (8)                             /* !< FRMERR Offset */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA_FRMERR_MASK ((uint32_t)0x00000100U)         /* !< UART Framing Error  Writing to this
                                                                                    bit has no effect. The flag is
                                                                                    cleared by writing 1 to the FRMERR
                                                                                    bit in the UART EVENT ICLR register.
                                                                                    This error is associated with the
                                                                                    character at the top of the FIFO. */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA_FRMERR_CLR ((uint32_t)0x00000000U)         /* !< No framing error has occurred */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA_FRMERR_SET ((uint32_t)0x00000100U)         /* !< The received character does not
                                                                                    have a valid stop bit sequence, which
                                                                                    is one or two stop bits depending on
                                                                                    the UARTLCRH.STP2 setting (a valid
                                                                                    stop bit is 1). */
/* M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA[PARERR] Bits */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA_PARERR_OFS (9)                             /* !< PARERR Offset */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA_PARERR_MASK ((uint32_t)0x00000200U)         /* !< UART Parity Error   Writing to this
                                                                                    bit has no effect. The flag is
                                                                                    cleared by writing 1 to the PARERR
                                                                                    bit in the UART EVENT ICLR register. */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA_PARERR_CLR ((uint32_t)0x00000000U)         /* !< No parity error has occurred */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA_PARERR_SET ((uint32_t)0x00000200U)         /* !< The parity of the received data
                                                                                    character does not match the parity
                                                                                    defined by bits 2 and 7 of the
                                                                                    UARTLCRH register. */
/* M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA[BRKERR] Bits */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA_BRKERR_OFS (10)                            /* !< BRKERR Offset */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA_BRKERR_MASK ((uint32_t)0x00000400U)         /* !< UART Break Error  Writing to this
                                                                                    bit has no effect. The flag is
                                                                                    cleared by writing 1 to the BRKERR
                                                                                    bit in the UART EVENT ICLR register.
                                                                                    This error is associated with the
                                                                                    character at the top of the FIFO.
                                                                                    When a break occurs, only one 0
                                                                                    character is loaded into the FIFO.
                                                                                    The next character is only enabled
                                                                                    after the receive data input goes to
                                                                                    a 1 (marking state) and the next
                                                                                    valid start bit is received. */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA_BRKERR_CLR ((uint32_t)0x00000000U)         /* !< No break condition has occurred */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA_BRKERR_SET ((uint32_t)0x00000400U)         /* !< A break condition has been
                                                                                    detected, indicating that the receive
                                                                                    data input was held low for longer
                                                                                    than a full-word transmission time
                                                                                    (defined as start, data, parity, and
                                                                                    stop bits). */
/* M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA[NERR] Bits */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA_NERR_OFS (11)                            /* !< NERR Offset */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA_NERR_MASK ((uint32_t)0x00000800U)         /* !< Noise Error. Writing to this bit
                                                                                    has no effect. The flag is cleared by
                                                                                    writing 1 to the NERR bit in the UART
                                                                                    EVENT ICLR register. */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA_NERR_CLR ((uint32_t)0x00000000U)         /* !< No noise error occurred */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_RXDATA_NERR_SET ((uint32_t)0x00000800U)         /* !< Noise error occurred during
                                                                                    majority voting */

/* M33C1SPGSS2_UC2_UART_IPSPECIFIC_AMASK Bits */
/* M33C1SPGSS2_UC2_UART_IPSPECIFIC_AMASK[VALUE] Bits */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_AMASK_VALUE_OFS (0)                             /* !< VALUE Offset */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_AMASK_VALUE_MASK ((uint32_t)0x000000FFU)         /* !< Self Address Mask for 9-Bit Mode
                                                                                    This field contains the address mask
                                                                                    that creates a set of addresses that
                                                                                    should be matched.  A 0 bit in the
                                                                                    MSK bitfield configures, that the
                                                                                    corresponding bit in the ADDR
                                                                                    bitfield of the UARTxADDR register is
                                                                                    don't care. A 1 bit in the MSK
                                                                                    bitfield configures, that the
                                                                                    corresponding bit in the ADDR
                                                                                    bitfield of the UARTxADDR register
                                                                                    must match. */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_AMASK_VALUE_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_AMASK_VALUE_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC2_UART_IPSPECIFIC_ADDR Bits */
/* M33C1SPGSS2_UC2_UART_IPSPECIFIC_ADDR[VALUE] Bits */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_ADDR_VALUE_OFS (0)                             /* !< VALUE Offset */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_ADDR_VALUE_MASK ((uint32_t)0x000000FFU)         /* !< Self Address for 9-Bit Mode  This
                                                                                    field contains the address that
                                                                                    should be matched when UARTxAMASK is
                                                                                    FFh. */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_ADDR_VALUE_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC2_UART_IPSPECIFIC_ADDR_VALUE_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

