TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_IMASK Bits */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_IMASK[TXINT] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_IMASK_TXINT_OFS (11)                            /* !< TXINT Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_IMASK_TXINT_MASK ((uint32_t)0x00000800U)         /* !< Enable UART Transmit Interrupt. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_IMASK_TXINT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_IMASK_TXINT_SET ((uint32_t)0x00000800U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_RIS Bits */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_RIS[TXINT] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_RIS_TXINT_OFS (11)                            /* !< TXINT Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_RIS_TXINT_MASK ((uint32_t)0x00000800U)         /* !< UART Transmit Interrupt. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_RIS_TXINT_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_RIS_TXINT_SET ((uint32_t)0x00000800U)         /* !< Interrupt occurred */

/* M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_MIS Bits */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_MIS[TXINT] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_MIS_TXINT_OFS (11)                            /* !< TXINT Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_MIS_TXINT_MASK ((uint32_t)0x00000800U)         /* !< Masked UART Transmit Interrupt. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_MIS_TXINT_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_MIS_TXINT_SET ((uint32_t)0x00000800U)         /* !< Interrupt occurred */

/* M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_ISET Bits */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_ISET[TXINT] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_ISET_TXINT_OFS (11)                            /* !< TXINT Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_ISET_TXINT_MASK ((uint32_t)0x00000800U)         /* !< Set UART Transmit Interrupt. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_ISET_TXINT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_TX_ISET_TXINT_SET ((uint32_t)0x00000800U)         /* !< Set Interrupt */

/* M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_IMASK Bits */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_IMASK[RTOUT] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RTOUT_OFS (0)                             /* !< RTOUT Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RTOUT_MASK ((uint32_t)0x00000001U)         /* !< Enable UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RTOUT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RTOUT_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_IMASK[RXINT] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RXINT_OFS (10)                            /* !< RXINT Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RXINT_MASK ((uint32_t)0x00000400U)         /* !< Enable UART Receive Interrupt. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RXINT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RXINT_SET ((uint32_t)0x00000400U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_RIS Bits */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_RIS[RTOUT] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RTOUT_OFS (0)                             /* !< RTOUT Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RTOUT_MASK ((uint32_t)0x00000001U)         /* !< UARTOUT Receive Time-Out Interrupt. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RTOUT_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RTOUT_SET ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_RIS[RXINT] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RXINT_OFS (10)                            /* !< RXINT Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RXINT_MASK ((uint32_t)0x00000400U)         /* !< UART Receive Interrupt. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RXINT_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RXINT_SET ((uint32_t)0x00000400U)         /* !< Interrupt occurred */

/* M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_MIS Bits */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_MIS[RTOUT] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RTOUT_OFS (0)                             /* !< RTOUT Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RTOUT_MASK ((uint32_t)0x00000001U)         /* !< Masked UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RTOUT_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RTOUT_SET ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_MIS[RXINT] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RXINT_OFS (10)                            /* !< RXINT Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RXINT_MASK ((uint32_t)0x00000400U)         /* !< Masked UART Receive Interrupt. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RXINT_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RXINT_SET ((uint32_t)0x00000400U)         /* !< Interrupt occurred */

/* M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_ISET Bits */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_ISET[RTOUT] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RTOUT_OFS (0)                             /* !< RTOUT Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RTOUT_MASK ((uint32_t)0x00000001U)         /* !< Set UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RTOUT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RTOUT_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_ISET[RXINT] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RXINT_OFS (10)                            /* !< RXINT Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RXINT_MASK ((uint32_t)0x00000400U)         /* !< Set UART Receive Interrupt. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RXINT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RXINT_SET ((uint32_t)0x00000400U)         /* !< Set Interrupt */

