TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX Bits */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX[STAT] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_OFS (0)                             /* !< STAT Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_MASK ((uint32_t)0x000000FFU)         /* !< UART Module Interrupt Vector Value.
                                                                                    This register provides the highes
                                                                                    priority interrupt index. A read
                                                                                    clears the corresponding interrupt
                                                                                    flag in RIS and MIS registers.
                                                                                    15h-1Fh = Reserved */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_NO_INTR ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_RTFG ((uint32_t)0x00000001U)         /* !< UART receive time-out interrupt;
                                                                                    Interrupt Flag: RT; Interrupt
                                                                                    Priority: Highest */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_FEFG ((uint32_t)0x00000002U)         /* !< UART framing error interrupt;
                                                                                    Interrupt Flag: FE */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_PEFG ((uint32_t)0x00000003U)         /* !< UART parity error interrupt;
                                                                                    Interrupt Flag: PE */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_BEFG ((uint32_t)0x00000004U)         /* !< UART break error interrupt;
                                                                                    Interrupt Flag: BE */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_OEFG ((uint32_t)0x00000005U)         /* !< UART receive overrun error
                                                                                    interrupt; Interrupt Flag: OE */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_RXNE ((uint32_t)0x00000006U)         /* !< Negative edge on UARTxRXD
                                                                                    interrupt; Interrupt Flag: RXNE */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_RXPE ((uint32_t)0x00000007U)         /* !< Positive edge on UARTxRXD
                                                                                    interrupt; Interrupt Flag: RXPE */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_LINC0 ((uint32_t)0x00000008U)         /* !< LIN capture 0 / match interrupt;
                                                                                    Interrupt Flag: LINC0 */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_LINC1 ((uint32_t)0x00000009U)         /* !< LIN capture 1 interrupt; Interrupt
                                                                                    Flag: LINC1 */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_LINOVF ((uint32_t)0x0000000AU)         /* !< LIN hardware counter overflow
                                                                                    interrupt; Interrupt Flag: LINOVF */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_RXIFG ((uint32_t)0x0000000BU)         /* !< UART receive interrupt; Interrupt
                                                                                    Flag: RX */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_TXIFG ((uint32_t)0x0000000CU)         /* !< UART transmit interrupt; Interrupt
                                                                                    Flag: TX */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_EOT ((uint32_t)0x0000000DU)         /* !< UART end of transmission interrupt
                                                                                    (transmit serializer empty);
                                                                                    Interrupt Flag: EOT */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_ADDR_MATCH ((uint32_t)0x0000000EU)         /* !< 9-bit mode address match interrupt;
                                                                                    Interrupt Flag: ADDR_MATCH */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_CTS ((uint32_t)0x0000000FU)         /* !< UART Clear to Send Modem interrupt;
                                                                                    Interrupt Flag: CTS */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_DMA_DONE_RX ((uint32_t)0x00000010U)         /* !< DMA DONE on RX */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_DMA_DONE_TX ((uint32_t)0x00000011U)         /* !< DMA DONE on TX */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_NERR_EVT ((uint32_t)0x00000012U)         /* !< Noise Error Event */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_DMA_PREIRQ_RX ((uint32_t)0x00000013U)         /* !< DMA PRE IRQ INTERRUPT */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_DMA_PREIRQ_TX ((uint32_t)0x00000014U)         /* !< DMA PRE IRQ INTERRUPT */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_IIDX_STAT_LTFG ((uint32_t)0x00000015U)         /* !< UART line time-out interrupt;
                                                                                    Interrupt Flag */

/* M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK Bits */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK[FRMERR] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_FRMERR_OFS (1)                             /* !< FRMERR Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_FRMERR_MASK ((uint32_t)0x00000002U)         /* !< Enable UART Framing Error
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_FRMERR_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_FRMERR_SET ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK[PARERR] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_PARERR_OFS (2)                             /* !< PARERR Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_PARERR_MASK ((uint32_t)0x00000004U)         /* !< Enable UART Parity Error Interrupt. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_PARERR_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_PARERR_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK[BRKERR] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_BRKERR_OFS (3)                             /* !< BRKERR Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_BRKERR_MASK ((uint32_t)0x00000008U)         /* !< Enable UART Break Error Interrupt. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_BRKERR_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_BRKERR_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK[OVRERR] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_OVRERR_OFS (4)                             /* !< OVRERR Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_OVRERR_MASK ((uint32_t)0x00000010U)         /* !< Enable UART Receive Overrun Error
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_OVRERR_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_OVRERR_SET ((uint32_t)0x00000010U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK[RXINT] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_RXINT_OFS (10)                            /* !< RXINT Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_RXINT_MASK ((uint32_t)0x00000400U)         /* !< Enable UART Receive Interrupt. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_RXINT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_RXINT_SET ((uint32_t)0x00000400U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK[TXINT] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_TXINT_OFS (11)                            /* !< TXINT Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_TXINT_MASK ((uint32_t)0x00000800U)         /* !< Enable UART Transmit Interrupt. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_TXINT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_TXINT_SET ((uint32_t)0x00000800U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK[EOT] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_EOT_OFS (12)                            /* !< EOT Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_EOT_MASK ((uint32_t)0x00001000U)         /* !< Enable UART End of Transmission
                                                                                    Interrupt Indicates that the last bit
                                                                                    of all transmitted data and flags has
                                                                                    left the serializer and without any
                                                                                    further Data in the TX Fifo or
                                                                                    Buffer. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_EOT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_EOT_SET ((uint32_t)0x00001000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK[ADDR_MATCH] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_ADDR_MATCH_OFS (13)                            /* !< ADDR_MATCH Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_ADDR_MATCH_MASK ((uint32_t)0x00002000U)         /* !< Enable Address Match Interrupt. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_ADDR_MATCH_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_ADDR_MATCH_SET ((uint32_t)0x00002000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK[CTS] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_CTS_OFS (14)                            /* !< CTS Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_CTS_MASK ((uint32_t)0x00004000U)         /* !< Enable UART Clear to Send Modem
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_CTS_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_CTS_SET ((uint32_t)0x00004000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK[DMA_DONE_RX] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< Enable DMA Done on RX Event Channel
                                                                                    Interrupt */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_RX_SET ((uint32_t)0x00008000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK[DMA_DONE_TX] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< Enable DMA Done on TX Event Channel
                                                                                    Interrupt */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_DMA_DONE_TX_SET ((uint32_t)0x00010000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK[RTOUT] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_RTOUT_OFS (0)                             /* !< RTOUT Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_RTOUT_MASK ((uint32_t)0x00000001U)         /* !< Enable UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_RTOUT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_RTOUT_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK[NERR] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_NERR_OFS (17)                            /* !< NERR Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_NERR_MASK ((uint32_t)0x00020000U)         /* !< Noise Error on triple voting.
                                                                                    Asserted when the 3 samples of
                                                                                    majority voting are not equal */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_NERR_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_NERR_SET ((uint32_t)0x00020000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK[LTOUT] Bits */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_LTOUT_OFS (20)                            /* !< LTOUT Offset */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_LTOUT_MASK ((uint32_t)0x00100000U)         /* !< Enable UARTOUT Line Time-Out
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_LTOUT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC2_UART_IPSTANDARD_CPU_INT_IMASK_LTOUT_SET ((uint32_t)0x00100000U)         /* !< Set Interrupt Mask */

