TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS Bits */
/* M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS[TXIFLSEL] Bits */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_TXIFLSEL_OFS (0)                             /* !< TXIFLSEL Offset */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_TXIFLSEL_MASK ((uint32_t)0x00000007U)         /* !< FIFO Level Select for generating
                                                                                    events (interrupt/dma).  Note: for
                                                                                    undefined settings the default
                                                                                    configuration is used. */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_TXIFLSEL_LVL_3_4 ((uint32_t)0x00000001U)         /* !< TX FIFO <= 3/4 empty */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_TXIFLSEL_LVL_1_2 ((uint32_t)0x00000002U)         /* !< TX FIFO <= 1/2 empty (default) */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_TXIFLSEL_LVL_1_4 ((uint32_t)0x00000003U)         /* !< TX FIFO <= 1/4 empty */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_TXIFLSEL_LVL_NOT_FULL ((uint32_t)0x00000004U)         /* !< Opposite of full */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_TXIFLSEL_LVL_EMPTY ((uint32_t)0x00000005U)         /* !< TX FIFO is empty */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_TXIFLSEL_LVL_ALMOST_EMPTY ((uint32_t)0x00000006U)         /* !< TX FIFO <= 1 */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_TXIFLSEL_LVL_ALMOST_FULL ((uint32_t)0x00000007U)         /* !< TX_FIFO >= (MAX_FIFO_LEN -1) */
/* M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS[RXIFLSEL] Bits */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_RXIFLSEL_OFS (4)                             /* !< RXIFLSEL Offset */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_RXIFLSEL_MASK ((uint32_t)0x00000070U)         /* !< FIFO Level Select for generating
                                                                                    events (interrupt/dma).  Note: for
                                                                                    undefined settings the default
                                                                                    configuration is used. */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_RXIFLSEL_LVL_1_4 ((uint32_t)0x00000010U)         /* !< RX FIFO >= 1/4 full */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_RXIFLSEL_LVL_1_2 ((uint32_t)0x00000020U)         /* !< RX FIFO >= 1/2 full (default) */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_RXIFLSEL_LVL_3_4 ((uint32_t)0x00000030U)         /* !< RX FIFO >= 3/4 full */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_RXIFLSEL_LVL_NOT_EMPTY ((uint32_t)0x00000040U)         /* !< Opposite of empty */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_RXIFLSEL_LVL_FULL ((uint32_t)0x00000050U)         /* !< RX FIFO is full */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_RXIFLSEL_LVL_ALMOST_FULL ((uint32_t)0x00000060U)         /* !< RX_FIFO >= (MAX_FIFO_LEN -1) */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_RXIFLSEL_LVL_ALMOST_EMPTY ((uint32_t)0x00000070U)         /* !< RX_FIFO <= 1 */
/* M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS[RXTOSEL] Bits */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_RXTOSEL_OFS (8)                             /* !< RXTOSEL Offset */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_RXTOSEL_MASK ((uint32_t)0x00000F00U)         /* !< UART Receive Interrupt Timeout
                                                                                    Select. When receiving no start edge
                                                                                    for an additional character within
                                                                                    the set bittimes a RX interrupt is
                                                                                    set even if the FIFO level is not
                                                                                    reached. A value of 0 disables this
                                                                                    function. */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_RXTOSEL_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_RXTOSEL_MAXIMUM ((uint32_t)0x00000F00U)         /* !< Highest possible value */
/* M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS[TXCLR] Bits */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_TXCLR_OFS (3)                             /* !< TXCLR Offset */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_TXCLR_MASK ((uint32_t)0x00000008U)         /* !< TX FIFO CLEAR. Setting this bit
                                                                                    will clear the TX FIFO contents. */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_TXCLR_DISABLE ((uint32_t)0x00000000U)         /* !< Disable FIFO clear */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_TXCLR_ENABLE ((uint32_t)0x00000008U)         /* !< Enable FIFO Clear */
/* M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS[RXCLR] Bits */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_RXCLR_OFS (7)                             /* !< RXCLR Offset */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_RXCLR_MASK ((uint32_t)0x00000080U)         /* !< RX FIFO CLEAR. Setting this bit
                                                                                    will clear the RX FIFO contents. */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_RXCLR_DISABLE ((uint32_t)0x00000000U)         /* !< Disable FIFO clear */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IFLS_RXCLR_ENABLE ((uint32_t)0x00000080U)         /* !< Enable FIFO Clear */

/* M33C1SPGSS2_UC0_UART_IPSPECIFIC_IBRD Bits */
/* M33C1SPGSS2_UC0_UART_IPSPECIFIC_IBRD[DIVINT] Bits */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IBRD_DIVINT_OFS (0)                             /* !< DIVINT Offset */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IBRD_DIVINT_MASK ((uint32_t)0x0000FFFFU)         /* !< Integer Baud-Rate Divisor */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IBRD_DIVINT_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_IBRD_DIVINT_MAXIMUM ((uint32_t)0x0000FFFFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC0_UART_IPSPECIFIC_FBRD Bits */
/* M33C1SPGSS2_UC0_UART_IPSPECIFIC_FBRD[DIVFRAC] Bits */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_FBRD_DIVFRAC_OFS (0)                             /* !< DIVFRAC Offset */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_FBRD_DIVFRAC_MASK ((uint32_t)0x0000003FU)         /* !< Fractional Baud-Rate Divisor */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_FBRD_DIVFRAC_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_FBRD_DIVFRAC_MAXIMUM ((uint32_t)0x0000003FU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC0_UART_IPSPECIFIC_TXDATA Bits */
/* M33C1SPGSS2_UC0_UART_IPSPECIFIC_TXDATA[DATA] Bits */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_TXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_TXDATA_DATA_MASK ((uint32_t)0x000000FFU)         /* !< Data Transmitted or Received  Data
                                                                                    that is to be transmitted via the
                                                                                    UART is written to this field.  When
                                                                                    read, this field contains the data
                                                                                    that was received by the UART. */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_TXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_TXDATA_DATA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA Bits */
/* M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA[DATA] Bits */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA_DATA_MASK ((uint32_t)0x000000FFU)         /* !< Received Data.  When read, this
                                                                                    field contains the data that was
                                                                                    received by the UART. */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA_DATA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA[FRMERR] Bits */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA_FRMERR_OFS (8)                             /* !< FRMERR Offset */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA_FRMERR_MASK ((uint32_t)0x00000100U)         /* !< UART Framing Error  Writing to this
                                                                                    bit has no effect. The flag is
                                                                                    cleared by writing 1 to the FRMERR
                                                                                    bit in the UART EVENT ICLR register.
                                                                                    This error is associated with the
                                                                                    character at the top of the FIFO. */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA_FRMERR_CLR ((uint32_t)0x00000000U)         /* !< No framing error has occurred */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA_FRMERR_SET ((uint32_t)0x00000100U)         /* !< The received character does not
                                                                                    have a valid stop bit sequence, which
                                                                                    is one or two stop bits depending on
                                                                                    the UARTLCRH.STP2 setting (a valid
                                                                                    stop bit is 1). */
/* M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA[PARERR] Bits */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA_PARERR_OFS (9)                             /* !< PARERR Offset */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA_PARERR_MASK ((uint32_t)0x00000200U)         /* !< UART Parity Error   Writing to this
                                                                                    bit has no effect. The flag is
                                                                                    cleared by writing 1 to the PARERR
                                                                                    bit in the UART EVENT ICLR register. */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA_PARERR_CLR ((uint32_t)0x00000000U)         /* !< No parity error has occurred */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA_PARERR_SET ((uint32_t)0x00000200U)         /* !< The parity of the received data
                                                                                    character does not match the parity
                                                                                    defined by bits 2 and 7 of the
                                                                                    UARTLCRH register. */
/* M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA[BRKERR] Bits */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA_BRKERR_OFS (10)                            /* !< BRKERR Offset */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA_BRKERR_MASK ((uint32_t)0x00000400U)         /* !< UART Break Error  Writing to this
                                                                                    bit has no effect. The flag is
                                                                                    cleared by writing 1 to the BRKERR
                                                                                    bit in the UART EVENT ICLR register.
                                                                                    This error is associated with the
                                                                                    character at the top of the FIFO.
                                                                                    When a break occurs, only one 0
                                                                                    character is loaded into the FIFO.
                                                                                    The next character is only enabled
                                                                                    after the receive data input goes to
                                                                                    a 1 (marking state) and the next
                                                                                    valid start bit is received. */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA_BRKERR_CLR ((uint32_t)0x00000000U)         /* !< No break condition has occurred */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA_BRKERR_SET ((uint32_t)0x00000400U)         /* !< A break condition has been
                                                                                    detected, indicating that the receive
                                                                                    data input was held low for longer
                                                                                    than a full-word transmission time
                                                                                    (defined as start, data, parity, and
                                                                                    stop bits). */
/* M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA[NERR] Bits */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA_NERR_OFS (11)                            /* !< NERR Offset */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA_NERR_MASK ((uint32_t)0x00000800U)         /* !< Noise Error. Writing to this bit
                                                                                    has no effect. The flag is cleared by
                                                                                    writing 1 to the NERR bit in the UART
                                                                                    EVENT ICLR register. */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA_NERR_CLR ((uint32_t)0x00000000U)         /* !< No noise error occurred */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_RXDATA_NERR_SET ((uint32_t)0x00000800U)         /* !< Noise error occurred during
                                                                                    majority voting */

/* M33C1SPGSS2_UC0_UART_IPSPECIFIC_AMASK Bits */
/* M33C1SPGSS2_UC0_UART_IPSPECIFIC_AMASK[VALUE] Bits */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_AMASK_VALUE_OFS (0)                             /* !< VALUE Offset */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_AMASK_VALUE_MASK ((uint32_t)0x000000FFU)         /* !< Self Address Mask for 9-Bit Mode
                                                                                    This field contains the address mask
                                                                                    that creates a set of addresses that
                                                                                    should be matched.  A 0 bit in the
                                                                                    MSK bitfield configures, that the
                                                                                    corresponding bit in the ADDR
                                                                                    bitfield of the UARTxADDR register is
                                                                                    don't care. A 1 bit in the MSK
                                                                                    bitfield configures, that the
                                                                                    corresponding bit in the ADDR
                                                                                    bitfield of the UARTxADDR register
                                                                                    must match. */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_AMASK_VALUE_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_AMASK_VALUE_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC0_UART_IPSPECIFIC_ADDR Bits */
/* M33C1SPGSS2_UC0_UART_IPSPECIFIC_ADDR[VALUE] Bits */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_ADDR_VALUE_OFS (0)                             /* !< VALUE Offset */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_ADDR_VALUE_MASK ((uint32_t)0x000000FFU)         /* !< Self Address for 9-Bit Mode  This
                                                                                    field contains the address that
                                                                                    should be matched when UARTxAMASK is
                                                                                    FFh. */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_ADDR_VALUE_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS2_UC0_UART_IPSPECIFIC_ADDR_VALUE_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_IMASK Bits */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_IMASK[TXINT] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_IMASK_TXINT_OFS (11)                            /* !< TXINT Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_IMASK_TXINT_MASK ((uint32_t)0x00000800U)         /* !< Enable UART Transmit Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_IMASK_TXINT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_IMASK_TXINT_SET ((uint32_t)0x00000800U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_RIS Bits */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_RIS[TXINT] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_RIS_TXINT_OFS (11)                            /* !< TXINT Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_RIS_TXINT_MASK ((uint32_t)0x00000800U)         /* !< UART Transmit Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_RIS_TXINT_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_RIS_TXINT_SET ((uint32_t)0x00000800U)         /* !< Interrupt occurred */

/* M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_MIS Bits */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_MIS[TXINT] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_MIS_TXINT_OFS (11)                            /* !< TXINT Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_MIS_TXINT_MASK ((uint32_t)0x00000800U)         /* !< Masked UART Transmit Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_MIS_TXINT_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_MIS_TXINT_SET ((uint32_t)0x00000800U)         /* !< Interrupt occurred */

/* M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_ISET Bits */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_ISET[TXINT] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_ISET_TXINT_OFS (11)                            /* !< TXINT Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_ISET_TXINT_MASK ((uint32_t)0x00000800U)         /* !< Set UART Transmit Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_ISET_TXINT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_TX_ISET_TXINT_SET ((uint32_t)0x00000800U)         /* !< Set Interrupt */

/* M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_IMASK Bits */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_IMASK[RTOUT] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RTOUT_OFS (0)                             /* !< RTOUT Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RTOUT_MASK ((uint32_t)0x00000001U)         /* !< Enable UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RTOUT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RTOUT_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_IMASK[RXINT] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RXINT_OFS (10)                            /* !< RXINT Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RXINT_MASK ((uint32_t)0x00000400U)         /* !< Enable UART Receive Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RXINT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RXINT_SET ((uint32_t)0x00000400U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_RIS Bits */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_RIS[RTOUT] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RTOUT_OFS (0)                             /* !< RTOUT Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RTOUT_MASK ((uint32_t)0x00000001U)         /* !< UARTOUT Receive Time-Out Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RTOUT_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RTOUT_SET ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_RIS[RXINT] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RXINT_OFS (10)                            /* !< RXINT Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RXINT_MASK ((uint32_t)0x00000400U)         /* !< UART Receive Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RXINT_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RXINT_SET ((uint32_t)0x00000400U)         /* !< Interrupt occurred */

