TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET Bits */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET[FRMERR] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_FRMERR_OFS (1)                             /* !< FRMERR Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_FRMERR_MASK ((uint32_t)0x00000002U)         /* !< Set UART Framing Error Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_FRMERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_FRMERR_SET ((uint32_t)0x00000002U)         /* !< Set Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET[PARERR] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_PARERR_OFS (2)                             /* !< PARERR Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_PARERR_MASK ((uint32_t)0x00000004U)         /* !< Set UART Parity Error Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_PARERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_PARERR_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET[BRKERR] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_BRKERR_OFS (3)                             /* !< BRKERR Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_BRKERR_MASK ((uint32_t)0x00000008U)         /* !< Set UART Break Error Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_BRKERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_BRKERR_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET[OVRERR] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_OVRERR_OFS (4)                             /* !< OVRERR Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_OVRERR_MASK ((uint32_t)0x00000010U)         /* !< Set  UART Receive Overrun Error
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_OVRERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_OVRERR_SET ((uint32_t)0x00000010U)         /* !< Set Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET[RXINT] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_RXINT_OFS (10)                            /* !< RXINT Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_RXINT_MASK ((uint32_t)0x00000400U)         /* !< Set UART Receive Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_RXINT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_RXINT_SET ((uint32_t)0x00000400U)         /* !< Set Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET[TXINT] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_TXINT_OFS (11)                            /* !< TXINT Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_TXINT_MASK ((uint32_t)0x00000800U)         /* !< Set UART Transmit Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_TXINT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_TXINT_SET ((uint32_t)0x00000800U)         /* !< Set Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET[EOT] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_EOT_OFS (12)                            /* !< EOT Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_EOT_MASK ((uint32_t)0x00001000U)         /* !< Set UART End of Transmission
                                                                                    Interrupt Indicates that the last bit
                                                                                    of all transmitted data and flags has
                                                                                    left the serializer and without any
                                                                                    further Data in the TX Fifo or
                                                                                    Buffer. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_EOT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_EOT_SET ((uint32_t)0x00001000U)         /* !< Set Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET[ADDR_MATCH] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_ADDR_MATCH_OFS (13)                            /* !< ADDR_MATCH Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_ADDR_MATCH_MASK ((uint32_t)0x00002000U)         /* !< Set Address Match Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_ADDR_MATCH_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_ADDR_MATCH_SET ((uint32_t)0x00002000U)         /* !< Set Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET[CTS] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_CTS_OFS (14)                            /* !< CTS Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_CTS_MASK ((uint32_t)0x00004000U)         /* !< Set UART Clear to Send Modem
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_CTS_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_CTS_SET ((uint32_t)0x00004000U)         /* !< Set Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET[DMA_DONE_RX] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< Set DMA Done on RX Event Channel
                                                                                    Interrupt */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_DMA_DONE_RX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_DMA_DONE_RX_SET ((uint32_t)0x00008000U)         /* !< Set Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET[DMA_DONE_TX] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< Set DMA Done on TX Event Channel
                                                                                    Interrupt */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_DMA_DONE_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_DMA_DONE_TX_SET ((uint32_t)0x00010000U)         /* !< Set Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET[RTOUT] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_RTOUT_OFS (0)                             /* !< RTOUT Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_RTOUT_MASK ((uint32_t)0x00000001U)         /* !< Set UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_RTOUT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_RTOUT_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET[NERR] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_NERR_OFS (17)                            /* !< NERR Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_NERR_MASK ((uint32_t)0x00020000U)         /* !< Noise Error on triple voting.
                                                                                    Asserted when the 3 samples of
                                                                                    majority voting are not equal */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_NERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing this has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_NERR_SET ((uint32_t)0x00020000U)         /* !< Set the interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET[LTOUT] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_LTOUT_OFS (20)                            /* !< LTOUT Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_LTOUT_MASK ((uint32_t)0x00100000U)         /* !< Set UARTOUT Line Time-Out
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_LTOUT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CPU_INT_ISET_LTOUT_SET ((uint32_t)0x00100000U)         /* !< Set Interrupt */

/* M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR Bits */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR[FRMERR] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_FRMERR_OFS (1)                             /* !< FRMERR Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_FRMERR_MASK ((uint32_t)0x00000002U)         /* !< Clear UART Framing Error Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_FRMERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_FRMERR_CLR ((uint32_t)0x00000002U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR[PARERR] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_PARERR_OFS (2)                             /* !< PARERR Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_PARERR_MASK ((uint32_t)0x00000004U)         /* !< Clear UART Parity Error Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_PARERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_PARERR_CLR ((uint32_t)0x00000004U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR[BRKERR] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_BRKERR_OFS (3)                             /* !< BRKERR Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_BRKERR_MASK ((uint32_t)0x00000008U)         /* !< Clear UART Break Error Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_BRKERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_BRKERR_CLR ((uint32_t)0x00000008U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR[OVRERR] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_OVRERR_OFS (4)                             /* !< OVRERR Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_OVRERR_MASK ((uint32_t)0x00000010U)         /* !< Clear UART Receive Overrun Error
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_OVRERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_OVRERR_CLR ((uint32_t)0x00000010U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR[RXINT] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_RXINT_OFS (10)                            /* !< RXINT Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_RXINT_MASK ((uint32_t)0x00000400U)         /* !< Clear UART Receive Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_RXINT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_RXINT_CLR ((uint32_t)0x00000400U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR[TXINT] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_TXINT_OFS (11)                            /* !< TXINT Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_TXINT_MASK ((uint32_t)0x00000800U)         /* !< Clear UART Transmit Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_TXINT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_TXINT_CLR ((uint32_t)0x00000800U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR[EOT] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_EOT_OFS (12)                            /* !< EOT Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_EOT_MASK ((uint32_t)0x00001000U)         /* !< Clear UART End of Transmission
                                                                                    Interrupt Indicates that the last bit
                                                                                    of all transmitted data and flags has
                                                                                    left the serializer and without any
                                                                                    further Data in the TX Fifo or
                                                                                    Buffer. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_EOT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_EOT_CLR ((uint32_t)0x00001000U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR[ADDR_MATCH] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_ADDR_MATCH_OFS (13)                            /* !< ADDR_MATCH Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_ADDR_MATCH_MASK ((uint32_t)0x00002000U)         /* !< Clear Address Match Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_ADDR_MATCH_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_ADDR_MATCH_CLR ((uint32_t)0x00002000U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR[CTS] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_CTS_OFS (14)                            /* !< CTS Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_CTS_MASK ((uint32_t)0x00004000U)         /* !< Clear UART Clear to Send Modem
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_CTS_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_CTS_CLR ((uint32_t)0x00004000U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR[DMA_DONE_RX] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< Clear DMA Done on RX Event Channel
                                                                                    Interrupt */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_DMA_DONE_RX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_DMA_DONE_RX_CLR ((uint32_t)0x00008000U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR[DMA_DONE_TX] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< Clear DMA Done on TX Event Channel
                                                                                    Interrupt */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_DMA_DONE_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_DMA_DONE_TX_CLR ((uint32_t)0x00010000U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR[RTOUT] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_RTOUT_OFS (0)                             /* !< RTOUT Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_RTOUT_MASK ((uint32_t)0x00000001U)         /* !< Clear UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_RTOUT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_RTOUT_CLR ((uint32_t)0x00000001U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR[NERR] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_NERR_OFS (17)                            /* !< NERR Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_NERR_MASK ((uint32_t)0x00020000U)         /* !< Noise Error on triple voting.
                                                                                    Asserted when the 3 samples of
                                                                                    majority voting are not equal */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_NERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_NERR_CLR ((uint32_t)0x00020000U)         /* !< Clear Interrupt */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR[LTOUT] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_LTOUT_OFS (20)                            /* !< LTOUT Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_LTOUT_MASK ((uint32_t)0x00100000U)         /* !< Clear UARTOUT Line Time-Out
                                                                                    Interrupt. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_LTOUT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_ICLR_LTOUT_CLR ((uint32_t)0x00100000U)         /* !< Clear Interrupt */

/* M33C1SPGSS2_UC0_UART_IPSTANDARD_CLKDIV Bits */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_CLKDIV[RATIO] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CLKDIV_RATIO_OFS (0)                             /* !< RATIO Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CLKDIV_RATIO_MASK ((uint32_t)0x00000007U)         /* !< Selects divide ratio of module
                                                                                    clock Division factor 0 : DIV_BY_1 1
                                                                                    : DIV_BY_2 .... 63: DIV_BY_64 */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_1 ((uint32_t)0x00000000U)         /* !< Do not divide clock source */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_2 ((uint32_t)0x00000001U)         /* !< Divide clock source by 2 */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_3 ((uint32_t)0x00000002U)         /* !< Divide clock source by 3 */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_4 ((uint32_t)0x00000003U)         /* !< Divide clock source by 4 */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_5 ((uint32_t)0x00000004U)         /* !< Divide clock source by 5 */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_6 ((uint32_t)0x00000005U)         /* !< Divide clock source by 6 */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_7 ((uint32_t)0x00000006U)         /* !< Divide clock source by 7 */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_8 ((uint32_t)0x00000007U)         /* !< Divide clock source by 8 */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_61 ((uint32_t)0x0000003CU)         /* !< Divide clock source by 61 */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_62 ((uint32_t)0x0000003DU)         /* !< Divide clock source by 62 */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_63 ((uint32_t)0x0000003EU)         /* !< Divide clock source by 63 */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CLKDIV_RATIO_DIV_BY_64 ((uint32_t)0x0000003FU)         /* !< Divide clock source by 64 */

