TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_CLKSEL Bits */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_CLKSEL[BUSCLK_SEL] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CLKSEL_BUSCLK_SEL_OFS (3)                             /* !< BUSCLK_SEL Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CLKSEL_BUSCLK_SEL_MASK ((uint32_t)0x00000008U)         /* !< Selects BUS CLK as clock source if
                                                                                    enabled */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CLKSEL_BUSCLK_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_CLKSEL_BUSCLK_SEL_ENABLE ((uint32_t)0x00000008U)         /* !< Select this clock as a source */

/* M33C1SPGSS2_UC0_UART_IPSTANDARD_PDBGCTL Bits */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_PDBGCTL[FREE] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_PDBGCTL_FREE_OFS (0)                             /* !< FREE Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_PDBGCTL_FREE_MASK ((uint32_t)0x00000001U)         /* !< Free run control */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_PDBGCTL_FREE_STOP ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_PDBGCTL_FREE_RUN ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_PDBGCTL[SOFT] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_PDBGCTL_SOFT_OFS (1)                             /* !< SOFT Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_PDBGCTL_SOFT_MASK ((uint32_t)0x00000002U)         /* !< Soft halt boundary control. This
                                                                                    function is only available, if [FREE]
                                                                                    is set to 'STOP' */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_PDBGCTL_SOFT_DEPRECATED ((uint32_t)0x00000000U)         /* !< Not supported */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_PDBGCTL_SOFT_DELAYED ((uint32_t)0x00000002U)         /* !< The peripheral blocks the debug
                                                                                    freeze until it has reached a
                                                                                    boundary where it can resume without
                                                                                    corruption */

/* M33C1SPGSS2_UC0_UART_IPSTANDARD_INTCTL Bits */
/* M33C1SPGSS2_UC0_UART_IPSTANDARD_INTCTL[INTEVAL] Bits */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_INTCTL_INTEVAL_OFS (0)                             /* !< INTEVAL Offset */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_INTCTL_INTEVAL_MASK ((uint32_t)0x00000001U)         /* !< Writing a 1 to this field
                                                                                    re-evaluates the interrupt sources. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_INTCTL_INTEVAL_DISABLE ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define M33C1SPGSS2_UC0_UART_IPSTANDARD_INTCTL_INTEVAL_EVAL ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */

/* M33C1SPGSS2_FUPDATE_U0_SCLK_SCL_RX Bits */
/* M33C1SPGSS2_FUPDATE_U0_SCLK_SCL_RX[IOADDR] Bits */
#define M33C1SPGSS2_FUPDATE_U0_SCLK_SCL_RX_IOADDR_OFS (2)                             /* !< IOADDR Offset */
#define M33C1SPGSS2_FUPDATE_U0_SCLK_SCL_RX_IOADDR_MASK ((uint32_t)0x0FFFFFFCU)         /* !< IO Address. This is the address
                                                                                    that corresponds to the SOC
                                                                                    address[27:2] of the module IP
                                                                                    instance specific IO signal in the
                                                                                    Full Write subregion of the pinmux
                                                                                    subregion. */
/* M33C1SPGSS2_FUPDATE_U0_SCLK_SCL_RX[LOCK] Bits */
#define M33C1SPGSS2_FUPDATE_U0_SCLK_SCL_RX_LOCK_OFS (1)                             /* !< LOCK Offset */
#define M33C1SPGSS2_FUPDATE_U0_SCLK_SCL_RX_LOCK_MASK ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define M33C1SPGSS2_FUPDATE_U0_SCLK_SCL_RX_LOCK_NOEFFECT ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define M33C1SPGSS2_FUPDATE_U0_SCLK_SCL_RX_LOCK_LOCK ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* M33C1SPGSS2_FUPDATE_U0_SCLK_SCL_RX[GSEL] Bits */
#define M33C1SPGSS2_FUPDATE_U0_SCLK_SCL_RX_GSEL_OFS (0)                             /* !< GSEL Offset */
#define M33C1SPGSS2_FUPDATE_U0_SCLK_SCL_RX_GSEL_MASK ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define M33C1SPGSS2_FUPDATE_U0_SCLK_SCL_RX_GSEL_PCHAN ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define M33C1SPGSS2_FUPDATE_U0_SCLK_SCL_RX_GSEL_GCHAN ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

/* M33C1SPGSS2_STAT_IO0 Bits */
/* M33C1SPGSS2_STAT_IO0[WAKEUP] Bits */
#define M33C1SPGSS2_STAT_IO0_WAKEUP_OFS          (16)                            /* !< WAKEUP Offset */
#define M33C1SPGSS2_STAT_IO0_WAKEUP_MASK         ((uint32_t)0x00010000U)         /* !< This PAD has WAKEUP function
                                                                                    asserted */
/* M33C1SPGSS2_STAT_IO0[PAD] Bits */
#define M33C1SPGSS2_STAT_IO0_PAD_OFS             (0)                             /* !< PAD Offset */
#define M33C1SPGSS2_STAT_IO0_PAD_MASK            ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

