TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss2.h
/* M33C1SPGSS2_FUPDATE_U3_CTS Bits */
/* M33C1SPGSS2_FUPDATE_U3_CTS[IOADDR] Bits */
#define M33C1SPGSS2_FUPDATE_U3_CTS_IOADDR_OFS    (2)                             /* !< IOADDR Offset */
#define M33C1SPGSS2_FUPDATE_U3_CTS_IOADDR_MASK   ((uint32_t)0x0FFFFFFCU)         /* !< IO Address. This is the address
                                                                                    that corresponds to the SOC
                                                                                    address[27:2] of the module IP
                                                                                    instance specific IO signal in the
                                                                                    Full Write subregion of the pinmux
                                                                                    subregion. */
/* M33C1SPGSS2_FUPDATE_U3_CTS[LOCK] Bits */
#define M33C1SPGSS2_FUPDATE_U3_CTS_LOCK_OFS      (1)                             /* !< LOCK Offset */
#define M33C1SPGSS2_FUPDATE_U3_CTS_LOCK_MASK     ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define M33C1SPGSS2_FUPDATE_U3_CTS_LOCK_NOEFFECT ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define M33C1SPGSS2_FUPDATE_U3_CTS_LOCK_LOCK     ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* M33C1SPGSS2_FUPDATE_U3_CTS[GSEL] Bits */
#define M33C1SPGSS2_FUPDATE_U3_CTS_GSEL_OFS      (0)                             /* !< GSEL Offset */
#define M33C1SPGSS2_FUPDATE_U3_CTS_GSEL_MASK     ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define M33C1SPGSS2_FUPDATE_U3_CTS_GSEL_PCHAN    ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define M33C1SPGSS2_FUPDATE_U3_CTS_GSEL_GCHAN    ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

/* M33C1SPGSS2_STAT_IO15 Bits */
/* M33C1SPGSS2_STAT_IO15[WAKEUP] Bits */
#define M33C1SPGSS2_STAT_IO15_WAKEUP_OFS         (16)                            /* !< WAKEUP Offset */
#define M33C1SPGSS2_STAT_IO15_WAKEUP_MASK        ((uint32_t)0x00010000U)         /* !< This PAD has WAKEUP function
                                                                                    asserted */
/* M33C1SPGSS2_STAT_IO15[PAD] Bits */
#define M33C1SPGSS2_STAT_IO15_PAD_OFS            (0)                             /* !< PAD Offset */
#define M33C1SPGSS2_STAT_IO15_PAD_MASK           ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

/* M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX Bits */
/* M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX[PSTATE] Bits */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_PSTATE_OFS (6)                             /* !< PSTATE Offset */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_PSTATE_MASK ((uint32_t)0x000000C0U)         /* !< Peripheral-Analog Channel State */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_PSTATE_UNASSIGNED ((uint32_t)0x00000000U)         /* !< P-Channel is in Unassigned State */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_PSTATE_HANDOVER ((uint32_t)0x00000040U)         /* !< P-Channel is in Handover State */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_PSTATE_CONC_NOT_LOCKED ((uint32_t)0x00000080U)         /* !< P-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_PSTATE_CONC_LOCKED ((uint32_t)0x000000C0U)         /* !< P-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX[GSTATE] Bits */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_GSTATE_OFS (14)                            /* !< GSTATE Offset */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_GSTATE_MASK ((uint32_t)0x0000C000U)         /* !< GPIO Channel State */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_GSTATE_UNASSIGNED ((uint32_t)0x00000000U)         /* !< G-Channel is in Unassigned State */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_GSTATE_HANDOVER ((uint32_t)0x00004000U)         /* !< G-Channel is in Handover State */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_GSTATE_CONC_NOT_LOCKED ((uint32_t)0x00008000U)         /* !< G-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_GSTATE_CONC_LOCKED ((uint32_t)0x0000C000U)         /* !< G-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX[PIPD] Bits */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_PIPD_OFS (16)                            /* !< PIPD Offset */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_PIPD_MASK ((uint32_t)0x00010000U)         /* !< Pull down enable */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_PIPD_NO_PULL_DOWN ((uint32_t)0x00000000U)         /* !< No pull down */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_PIPD_PULL_DOWN ((uint32_t)0x00010000U)         /* !< Pull down */
/* M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX[PIPU] Bits */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_PIPU_OFS (17)                            /* !< PIPU Offset */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_PIPU_MASK ((uint32_t)0x00020000U)         /* !< Pull up enable */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_PIPU_NO_PULL_UP ((uint32_t)0x00000000U)         /* !< No pull up */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_PIPU_PULL_UP ((uint32_t)0x00020000U)         /* !< Pull up */
/* M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX[INENA] Bits */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_INENA_OFS (18)                            /* !< INENA Offset */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_INENA_MASK ((uint32_t)0x00040000U)         /* !< Input enable */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_INENA_INP_DISABLE ((uint32_t)0x00000000U)         /* !< Inputs 0 to connected core */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_INENA_INP_ENABLE ((uint32_t)0x00040000U)         /* !< Inputs IO pad value to connected
                                                                                    core */
/* M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX[HYSTEN] Bits */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_HYSTEN_OFS (19)                            /* !< HYSTEN Offset */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_HYSTEN_MASK ((uint32_t)0x00080000U)         /* !< Hysteresis enable */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_HYSTEN_DIS_HYST ((uint32_t)0x00000000U)         /* !< No hysteresis */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_HYSTEN_EN_HYST ((uint32_t)0x00080000U)         /* !< Hysteresis on */
/* M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX[INV] Bits */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_INV_OFS (26)                            /* !< INV Offset */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_INV_MASK ((uint32_t)0x04000000U)         /* !< Invert digital input/output
                                                                                    relative to peripheral/GPIO */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_INV_NO_CHNG ((uint32_t)0x00000000U)         /* !< Input and output are non-inverted */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_INV_CHNG ((uint32_t)0x04000000U)         /* !< Input and output are inverted */
/* M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX[WUEN] Bits */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_WUEN_OFS (27)                            /* !< WUEN Offset */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_WUEN_MASK ((uint32_t)0x08000000U)         /* !< Wake up enable */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_WUEN_NO_WAKEUP ((uint32_t)0x00000000U)         /* !< Wake up not enabled */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_WUEN_WAKEUP ((uint32_t)0x08000000U)         /* !< Wake up enabled */
/* M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX[WCOMP] Bits */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_WCOMP_OFS (28)                            /* !< WCOMP Offset */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_WCOMP_MASK ((uint32_t)0x10000000U)         /* !< Wake up compare value */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_WCOMP_MATCH_ZERO ((uint32_t)0x00000000U)         /* !< Match 0 will wake */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_WCOMP_MATCH_ONE ((uint32_t)0x10000000U)         /* !< Match 1 will wake */
/* M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX[GFLT] Bits */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_GFLT_OFS (30)                            /* !< GFLT Offset */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_GFLT_MASK ((uint32_t)0x40000000U)         /* !< Glitch Filter Enable */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_GFLT_DISABLE ((uint32_t)0x00000000U)         /* !< No internal glitch filter */
#define M33C1SPGSS2_PINCM_U0_SCLK_SCL_RX_GFLT_ENABLE ((uint32_t)0x40000000U)         /* !< Use internal glitch filter */

/* M33C1SPGSS2_PINCM_U0_PICO_SDA_TX Bits */
/* M33C1SPGSS2_PINCM_U0_PICO_SDA_TX[PSTATE] Bits */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_PSTATE_OFS (6)                             /* !< PSTATE Offset */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_PSTATE_MASK ((uint32_t)0x000000C0U)         /* !< Peripheral-Analog Channel State */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_PSTATE_UNASSIGNED ((uint32_t)0x00000000U)         /* !< P-Channel is in Unassigned State */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_PSTATE_HANDOVER ((uint32_t)0x00000040U)         /* !< P-Channel is in Handover State */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_PSTATE_CONC_NOT_LOCKED ((uint32_t)0x00000080U)         /* !< P-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_PSTATE_CONC_LOCKED ((uint32_t)0x000000C0U)         /* !< P-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* M33C1SPGSS2_PINCM_U0_PICO_SDA_TX[GSTATE] Bits */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_GSTATE_OFS (14)                            /* !< GSTATE Offset */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_GSTATE_MASK ((uint32_t)0x0000C000U)         /* !< GPIO Channel State */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_GSTATE_UNASSIGNED ((uint32_t)0x00000000U)         /* !< G-Channel is in Unassigned State */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_GSTATE_HANDOVER ((uint32_t)0x00004000U)         /* !< G-Channel is in Handover State */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_GSTATE_CONC_NOT_LOCKED ((uint32_t)0x00008000U)         /* !< G-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_GSTATE_CONC_LOCKED ((uint32_t)0x0000C000U)         /* !< G-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* M33C1SPGSS2_PINCM_U0_PICO_SDA_TX[PIPD] Bits */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_PIPD_OFS (16)                            /* !< PIPD Offset */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_PIPD_MASK ((uint32_t)0x00010000U)         /* !< Pull down enable */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_PIPD_NO_PULL_DOWN ((uint32_t)0x00000000U)         /* !< No pull down */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_PIPD_PULL_DOWN ((uint32_t)0x00010000U)         /* !< Pull down */
/* M33C1SPGSS2_PINCM_U0_PICO_SDA_TX[PIPU] Bits */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_PIPU_OFS (17)                            /* !< PIPU Offset */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_PIPU_MASK ((uint32_t)0x00020000U)         /* !< Pull up enable */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_PIPU_NO_PULL_UP ((uint32_t)0x00000000U)         /* !< No pull up */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_PIPU_PULL_UP ((uint32_t)0x00020000U)         /* !< Pull up */
/* M33C1SPGSS2_PINCM_U0_PICO_SDA_TX[INENA] Bits */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_INENA_OFS (18)                            /* !< INENA Offset */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_INENA_MASK ((uint32_t)0x00040000U)         /* !< Input enable */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_INENA_INP_DISABLE ((uint32_t)0x00000000U)         /* !< Inputs 0 to connected core */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_INENA_INP_ENABLE ((uint32_t)0x00040000U)         /* !< Inputs IO pad value to connected
                                                                                    core */
/* M33C1SPGSS2_PINCM_U0_PICO_SDA_TX[HYSTEN] Bits */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_HYSTEN_OFS (19)                            /* !< HYSTEN Offset */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_HYSTEN_MASK ((uint32_t)0x00080000U)         /* !< Hysteresis enable */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_HYSTEN_DIS_HYST ((uint32_t)0x00000000U)         /* !< No hysteresis */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_HYSTEN_EN_HYST ((uint32_t)0x00080000U)         /* !< Hysteresis on */
/* M33C1SPGSS2_PINCM_U0_PICO_SDA_TX[INV] Bits */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_INV_OFS (26)                            /* !< INV Offset */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_INV_MASK ((uint32_t)0x04000000U)         /* !< Invert digital input/output
                                                                                    relative to peripheral/GPIO */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_INV_NO_CHNG ((uint32_t)0x00000000U)         /* !< Input and output are non-inverted */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_INV_CHNG ((uint32_t)0x04000000U)         /* !< Input and output are inverted */
/* M33C1SPGSS2_PINCM_U0_PICO_SDA_TX[WUEN] Bits */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_WUEN_OFS (27)                            /* !< WUEN Offset */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_WUEN_MASK ((uint32_t)0x08000000U)         /* !< Wake up enable */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_WUEN_NO_WAKEUP ((uint32_t)0x00000000U)         /* !< Wake up not enabled */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_WUEN_WAKEUP ((uint32_t)0x08000000U)         /* !< Wake up enabled */
/* M33C1SPGSS2_PINCM_U0_PICO_SDA_TX[WCOMP] Bits */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_WCOMP_OFS (28)                            /* !< WCOMP Offset */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_WCOMP_MASK ((uint32_t)0x10000000U)         /* !< Wake up compare value */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_WCOMP_MATCH_ZERO ((uint32_t)0x00000000U)         /* !< Match 0 will wake */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_WCOMP_MATCH_ONE ((uint32_t)0x10000000U)         /* !< Match 1 will wake */
/* M33C1SPGSS2_PINCM_U0_PICO_SDA_TX[GFLT] Bits */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_GFLT_OFS (30)                            /* !< GFLT Offset */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_GFLT_MASK ((uint32_t)0x40000000U)         /* !< Glitch Filter Enable */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_GFLT_DISABLE ((uint32_t)0x00000000U)         /* !< No internal glitch filter */
#define M33C1SPGSS2_PINCM_U0_PICO_SDA_TX_GFLT_ENABLE ((uint32_t)0x40000000U)         /* !< Use internal glitch filter */

